[
    {
        "title": "Data Platform Engineer",
        "company": "Macquarie Group",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Financial Services"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 4,
        "workplace_type": "N/A",
        "description": "Our Data Platform Engineering team is dedicated to developing and maintaining data product systems and processes that transform raw data into high-quality, consistent information for various downstream use cases. We operate entirely on cloud platforms, utilising both Google Cloud and AWS, and are committed to leveraging innovative approaches to automation.\n\nAt Macquarie, our advantage is bringing together diverse people and empowering them to shape all kinds of possibilities. We are a global financial services group operating in 34 markets and with 55 years of unbroken profitability. You’ll be part of a friendly and supportive team where everyone - no matter what role - contributes ideas and drives outcomes.\n\n What role will you play? \n\nAs a Data Platform Engineer, you will be responsible for building new automation and orchestration solutions while enhancing our existing data product applications. You will be involved in the design, development, testing, operations, and delivering incremental improvements in iterative cycles. You will bring an Agile mindset and a keen interest in software engineering across a range of technologies.\n\nWhat You Offer\n\nExperience with orchestration technologies to manage data product applications. Proficiency in observability and monitoring platforms such as Prometheus & Grafana, Sumo Logic, Splunk, or Dynatrace. Java or other programming experience, including the development of shared libraries for observability to provide standard logging, monitoring, and tracing. Familiarity with SQL, NoSQL, and event streaming platforms. \\Knowledge of Continuous Integration and Continuous Deployment (CI/CD) technologies.Expertise in cloud technologies such as AWS and/or GCP. Experience with Docker and/or Kubernetes containers. \n\nWe love hearing from anyone inspired to build a better future with us, if you're excited about the role or working at Macquarie we encourage you to apply.\n\nAbout Technology \n\nTechnology enables every aspect of our business, for our people, our customers and our communities. Bring your unique perspective and join a global team who is passionate about accelerating the digital enterprise, connecting people and data, building platforms and applications and designing tomorrow’s technology solutions.\n\nBenefits\n\nMacquarie employees can access a wide range of benefits which, depending on eligibility criteria, include:\n\nHybrid and flexible working arrangements One wellbeing leave day per year and up to five additional days leave based on length of serviceUp to 20 weeks paid parental leave as well as benefits to support you as you transition to life as a working parent Paid volunteer leave and donation matching Range of benefits to support your physical, psychological and financial wellbeing Access to a wide range of learning and development opportunities\n\n Our commitment to diversity, equity and inclusion \n\nWe are committed to providing a working environment that embraces diversity, equity, and inclusion. We encourage people from all backgrounds to apply for a role regardless of their identity, including gender, race, ethnicity, cultural identity, nationality, age, sexual orientation, gender identity, intersex status, marital or family status, neurodiversity, religion or belief, disabilities, or socio-economic background.\n\nIf you require adjustments to your working arrangements or the recruitment process, please let us know when applying.",
        "skills": [
            "C++",
            "Cloud Computing",
            "Continuous Integration (CI)",
            "Continuous Integration and Continuous Delivery (CI/CD)",
            "Docker Products",
            "Google Cloud Platform (GCP)",
            "Java",
            "Kubernetes",
            "Python (Programming Language)",
            "SQL"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087691453",
        "reposted": false,
        "posted_time": "2024-12-03 07:05:34",
        "expire_time": "2025-01-02 07:05:34",
        "apply_url": "https://recruitment.macquarie.com/en_US/careers/JobDetail?jobId=13530&source=LinkedIn.com"
    },
    {
        "title": "Cloud Support Engineer (Analytics)",
        "company": "Amazon Web Services (AWS)",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "industries": [
            "IT Services and IT Consulting"
        ],
        "job_functions": [
            "Information Technology",
            "Consulting",
            "Engineering"
        ],
        "applies": 2,
        "workplace_type": "N/A",
        "description": "Description\n\nAmazon Web Services (AWS) is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will act as the ‘Cloud Ambassador’ across all the cloud products, arming our customers with required tools & tactics to get the most out of their Product and Support investment.\n\nWould you like to use the latest cloud computing technologies? Do you have an interest in helping customers understand application architectures and integration approaches? Are you familiar with best practices for applications, servers and networks? Do you want to be part of a customer facing technology team helping to ensure the success of AWS as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies. Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs. Interact with leading engineers around the world. Partner with AWS teams to help reproduce and resolve customer issues. Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services. Drive customer communication during critical events. Drive projects that improve support-related processes and our customers’ technical support experience. Write tutorials, how-to videos, and other technical articles for the developer community. Work on critical, highly complex customer problems that may span multiple AWS services.\n\nA day in the life\n\n First and foremost this is a customer support role – in The Cloud. On a typical day, a Support Engineer will be primarily responsible for solving customer’s cases through a variety of customer contact channels which include telephone, email, and web/live chat. You will apply advanced troubleshooting techniques to provide tailored solutions for our customers and drive customer interactions by thoughtfully working with customers to dive deep into the root cause of an issue. Apart from working on a broad spectrum of technical issues, an AWS Support Engineer may also coach/mentor new hires, develop & present training, partner with development teams on complex issues or contact deflection initiatives, participate in new hiring, write tools/script to help the team, or work with leadership on process improvement and strategic initiatives. Career development: We promote advancement opportunities across the organization to help you meet your career goals. Training: We have training programs to help you develop the skills required to be successful in your role. We hire smart people who are keen to build a career with AWS, so we are more interested in the areas that you do know instead of those you haven’t been exposed to yet. Support engineers interested in travel have presented training or participated in focused summits across our sites or at specific AWS events. As we operate on a follow-the-sun model, with Premium Support sites located globally, working hours and days are based on customer demand and may include weekends (on a rotational basis). Hear from our people: https://youtu.be/GC3bWcFFZTo\n\nAbout The Team\n\nSales, Marketing and Global Services (SMGS)\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Auckland or Wellington Amazon offices.\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Exposure to streaming technologies (Kafka, Kinesis, Rabbit MQ). Log analysis and General Troubleshooting (tuning and optimisation, Search and Indexing Operations, mapping, monitoring) understanding on Elastic Stack (Elastic, Logstash, Beats, Kibana, Fluentd etc) and knowledge on Opensearch APIs. Experience in Business Analytics application, support, and troubleshooting concepts Experience with System Administration and troubleshooting with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server and associated technologies (Active Directory) Experience with Networking and troubleshooting (TCP/IP, DNS, OSI model, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related) Experience with Apache Flink, Apache Spark Bachelor’s degree in Information Science / Information Technology, Data Science, Computer Science, Engineering, Mathematics, Physics, or a related field OR equivalent experience in a technical position\n\nPreferred Qualifications\n\n Experience in a customer support environment Experience analyzing, troubleshooting, and providing solutions to technical issues Understanding of Cloud Computing concepts Experience scripting or developing in at least one of the following languages : Python, R, Ruby, GO, Java, .NET (C#), JavaScript Good understanding of distributed systems Exposure to Database Fundamentals and General Troubleshooting (tuning and optimization, deadlocks, keys, normalization) in any Relational Database Engines (MySQL, PostgreSQL, Oracle, SQLServer)\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844246",
        "skills": [
            "Analytics",
            "Apache Flink",
            "Business Analytics",
            "Curl",
            "Domain Name System (DNS)",
            "Local Area Network (LAN)",
            "OSI Model",
            "Ruby",
            "Scripting",
            "Traceroute"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210074",
        "reposted": false,
        "posted_time": "2024-12-03 09:22:30",
        "expire_time": "2025-01-02 09:22:30",
        "apply_url": "https://www.amazon.jobs/jobs/2844246/cloud-support-engineer-analytics?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid"
    },
    {
        "title": "Senior Data Engineer",
        "company": "TechTalent",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "",
        "industries": [],
        "job_functions": [],
        "applies": 14,
        "workplace_type": "Hybrid",
        "description": "We are seeking a Data Engineer to take charge of Techtalent’s data analytics infrastructure. This position offers the opportunity to build and refine Techtalent's data practices to enhance business impact. You will have significant ownership over our data and analytics platforms, contributing to team productivity and satisfaction. As we continue to grow, ensuring our data is scalable and well-organized will be a priority! You will collaborate closely with Product and Engineering teams, working with both technical and non-technical stakeholders to drive change.Join our startup and product-led growth journey at Techtalent!This is a hybrid position based in either Melbourne or Sydney.ResponsibilitiesBecome the primary owner of Techtalent’s data and analytics platforms.Maintain our analytics infrastructure and dashboards, utilizing various tools.Assist a small product team in making well-informed, data-driven decisions while aligning data strategy with broader business goals.Review and ensure the accuracy of our data.Collaborate with Product and Engineering teams to identify key metrics for success.Lead cross-functional efforts around data quality, reporting, insights, and resolving data inconsistencies to answer business questions.Design, build, install, and maintain data processing systems and databases.Integrate data from multiple sources, ensuring consistency and reliability.Build and maintain efficient data pipelines to support the ETL (Extract, Transform, Load) process into data warehouses or data lakes.Optimize data processing systems for scalability and performance.Implement data quality checks and validation to ensure data accuracy and reliability.Document data processes, architecture, and workflows to ensure transparency and continuity.RequirementsStrong collaboration skills, with the ability to understand stakeholder needs and develop strategies that address them.Excellent communication skills, with the ability to advocate for and educate others about data best practices.Proficient in SQL for data wrangling.Experience using data modeling tools like dbt.Proficiency in Python or R.Familiarity with modern event data stacks and tools such as Segment, Amplitude, Looker Studio, BigQuery, Google Analytics, and AWS/GCP (preferred).A clear vision for building a leading-edge analytics stack and a strategy for its development.A solid foundation in mathematics and statistics.Strong numerical and visual skills, with the ability to simplify complex data insights.Experience with data systems supporting machine learning, and familiarity with database migration or modernization projects (preferred).Experience with A/B Testing is highly desirable.",
        "skills": [
            "Analytics",
            "Communication",
            "Data Engineering",
            "Data Modeling",
            "Data Quality",
            "Databases",
            "Extract, Transform, Load (ETL)",
            "Key Metrics",
            "SQL",
            "Strategy"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088077210",
        "reposted": false,
        "posted_time": "2024-12-03 15:09:30",
        "expire_time": "2025-06-01 15:09:30",
        "apply_url": "https://www.linkedin.com/job-apply/4088077210"
    },
    {
        "title": "Cloud Support Engineer (Analytics)",
        "company": "Amazon Web Services (AWS)",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "industries": [
            "IT Services and IT Consulting"
        ],
        "job_functions": [
            "Information Technology",
            "Consulting",
            "Engineering"
        ],
        "applies": 3,
        "workplace_type": "N/A",
        "description": "Description\n\nAmazon Web Services (AWS) is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will act as the ‘Cloud Ambassador’ across all the cloud products, arming our customers with required tools & tactics to get the most out of their Product and Support investment.\n\nWould you like to use the latest cloud computing technologies? Do you have an interest in helping customers understand application architectures and integration approaches? Are you familiar with best practices for applications, servers and networks? Do you want to be part of a customer facing technology team helping to ensure the success of AWS as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies. Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs. Interact with leading engineers around the world. Partner with AWS teams to help reproduce and resolve customer issues. Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services. Drive customer communication during critical events. Drive projects that improve support-related processes and our customers’ technical support experience. Write tutorials, how-to videos, and other technical articles for the developer community. Work on critical, highly complex customer problems that may span multiple AWS services.\n\nA day in the life\n\n First and foremost this is a customer support role – in The Cloud. On a typical day, a Support Engineer will be primarily responsible for solving customer’s cases through a variety of customer contact channels which include telephone, email, and web/live chat. You will apply advanced troubleshooting techniques to provide tailored solutions for our customers and drive customer interactions by thoughtfully working with customers to dive deep into the root cause of an issue. Apart from working on a broad spectrum of technical issues, an AWS Support Engineer may also coach/mentor new hires, develop & present training, partner with development teams on complex issues or contact deflection initiatives, participate in new hiring, write tools/script to help the team, or work with leadership on process improvement and strategic initiatives. Career development: We promote advancement opportunities across the organization to help you meet your career goals. Training: We have training programs to help you develop the skills required to be successful in your role. We hire smart people who are keen to build a career with AWS, so we are more interested in the areas that you do know instead of those you haven’t been exposed to yet. Support engineers interested in travel have presented training or participated in focused summits across our sites or at specific AWS events. As we operate on a follow-the-sun model, with Premium Support sites located globally, working hours and days are based on customer demand and may include weekends (on a rotational basis). Hear from our people: https://youtu.be/GC3bWcFFZTo\n\nAbout The Team\n\nSales, Marketing and Global Services (SMGS)\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Auckland or Wellington Amazon offices.\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Exposure to streaming technologies (Kafka, Kinesis, Rabbit MQ). Log analysis and General Troubleshooting (tuning and optimisation, Search and Indexing Operations, mapping, monitoring) understanding on Elastic Stack (Elastic, Logstash, Beats, Kibana, Fluentd etc) and knowledge on Opensearch APIs. Experience in Business Analytics application, support, and troubleshooting concepts Experience with System Administration and troubleshooting with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server and associated technologies (Active Directory) Experience with Networking and troubleshooting (TCP/IP, DNS, OSI model, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related) Experience with Apache Flink, Apache Spark Bachelor’s degree in Information Science / Information Technology, Data Science, Computer Science, Engineering, Mathematics, Physics, or a related field OR equivalent experience in a technical position\n\nPreferred Qualifications\n\n Experience in a customer support environment Experience analyzing, troubleshooting, and providing solutions to technical issues Understanding of Cloud Computing concepts Experience scripting or developing in at least one of the following languages : Python, R, Ruby, GO, Java, .NET (C#), JavaScript Good understanding of distributed systems Exposure to Database Fundamentals and General Troubleshooting (tuning and optimization, deadlocks, keys, normalization) in any Relational Database Engines (MySQL, PostgreSQL, Oracle, SQLServer)\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844246",
        "skills": [
            "Analytics",
            "Apache Flink",
            "Business Analytics",
            "Curl",
            "Domain Name System (DNS)",
            "Local Area Network (LAN)",
            "OSI Model",
            "Ruby",
            "Scripting",
            "Traceroute"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090208432",
        "reposted": false,
        "posted_time": "2024-12-03 09:22:30",
        "expire_time": "2025-01-02 09:22:30",
        "apply_url": "https://www.amazon.jobs/jobs/2844246/cloud-support-engineer-analytics?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid"
    },
    {
        "title": "Senior Platform Engineer",
        "company": "Commonwealth Bank",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Financial Services"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 3,
        "workplace_type": "Hybrid",
        "description": "See yourself in the team\n\nWe're building tomorrow’s bank today. This means we need creative and diverse engineers to help us redefine what customers expect from a bank. Envisioning new technologies that are still waiting to be invented and reimagining products that support our customers and help build Australia’s future economy.\n\nThe role of Platform Engineers is to design, build, run and evolve tools, infrastructure, templates and capabilities to deliver business value, and write code to drive automation in running our infrastructure and environments.\n\nDo work that matters\n\nCommBank Data is the emerging Cloud data platform solution consisting of AWS native services and capabilities that ingests data from multiple source systems and executes business use cases for AI, advanced analytics (machine learning) at scale, across the comprehensive dataset and facilitates data discovery by advanced analytics users.\n\nThis role will see you become part of the Data Platform Greenfields crew, a part of the wider Data Engineering and Data Platform Chapter. The crew is accountable and responsible for the platform’s availability, performance, security and lifecycle management.\n\nCollaboratively we work to design, build and run ‘platforms’ to deliver customer value at greater quality, velocity, and safety.\n\nTo be successful in this role, some of the broad roles and responsibilities may include:\n\nExpertise in cloud infrastructure design and operations.Develop platform architecture that aligns with Business needs and support system resources in AWS environment across the Group, focusing on high quality, security, scalability, performance, and cost efficiency.Comprehensive understanding of driving automation through understanding processes and implementing improvements.Support requests related to platform technical implementation, responding to incidents/problems and perform root cause analysis.Proactively identify and develop solutions to mitigate platform risks against system failure, data loss, inappropriate disclosure or use of data, malicious attacks etc.Manage ongoing environment expansion and life cycle, e.g. system upgrades, security patching.Develop and maintain runbooks, document system configuration and standard operating procedures.\n\nWe’re interested in hearing from people who possess the following skills:\n\nPassion for designing, developing, deploying, and running high-quality software and platforms.Have experience in core AWS services like EC2, VPC, S3, Identity and Access Management (IAM), Lamda and with AWS Managed services - Amazon RDS, Dynamo DB and Redshift .Proficient in Python scripting, Bash, or PowerShell to automate tasks, manage configurations and troubleshooting essential.Deep understanding and hands on experience on AWS CloudWatch, Prometheus, Grafana to ensure proactive issue detection and resolution essential.Proficient Linux and Unix Configuration and troubleshootingExperience delivering scalable solutions on infrastructure as a code (IaC) using Terraform/AWS Cloud Formation.Good understanding of DevOps and CI/CD tools like GitHub, Jenkins TeamCity CI/CD pipeline, AWS CodePipeline and AWS CodeBuild to automate deployments.\n\nWorking with us\n\nWe support our people with the flexibility to balance where work is done with at least half their time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work in the role you’re interested in.\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 16/12/2024",
        "skills": [
            "Analytical Skills",
            "Automation",
            "Bash",
            "Linux",
            "Powershell",
            "Python (Programming Language)",
            "Root Cause Analysis",
            "Scripting",
            "Terraform",
            "Troubleshooting"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090200829",
        "reposted": false,
        "posted_time": "2024-12-03 08:07:08",
        "expire_time": "2025-01-02 08:07:08",
        "apply_url": "https://cba.wd3.myworkdayjobs.com/CommBank_Careers/job/VIC-CBD-Melbourne-Area/Senior-Platform-Engineer_REQ224894?source=LinkedIn"
    },
    {
        "title": "Lead Machine Learning Engineer - Content Group",
        "company": "Canva",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Engineering"
        ],
        "applies": 3,
        "workplace_type": "Hybrid",
        "description": "Job Description\n\nJoin the team redefining how the world experiences design.\n\nHey, g'day, mabuhay, kia ora, 你好, hallo, vítejte!\n\nThanks for stopping by. We know job hunting can be a little time-consuming and you're probably keen to find out what's on offer, so we'll get straight to the point.\n\nWhere And How You Can Work\n\nOur flagship campus is in Sydney. We also have a campus in Melbourne and co-working spaces in Brisbane, Perth and Adelaide. But you have choice in where and how you work, we trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals.\n\nWhat You’d Be Doing In This Role\n\nAs Canva scales change continues to be part of our DNA. But we like to think that's all part of the fun. So this will give you the flavour of the type of things you'll be working on when you start, but this will likely evolve.\n\nAt The Moment, This Role Is Focused On\n\nCo-owning and delivering the AI/ML roadmap for the Content group.Accountable for the delivery of the primary identified opportunities in Content, partnering with product and engineering teams.Advocate for AI/ML across teams in Content, facilitating ideation and discovery of use cases; develop quick prototypes; educate PMs, designers, and engineers on what’s possible.Contributing to the full life cycle of ML/data models: data analysis, data preprocessing and pipeline, modelling, tuning and productisation.Working alongside data specialists, software engineers and product owners to identify business and growth opportunities.Collaborate with MLEs across the organisation to tap into existing ML capabilities and/or work on problems that require intra-group and cross-supergroup solutions.Advocating uptake of AI where relevant and required across the Group.\n\n\nYou're probably a match if\n\nYou have solid experience building and deploying machine learning models and a strong understanding of end-to-end machine learning pipelines and components.You have worked with a multi-skilled team to deliver a great experience to users.You have a keen interest or prior experience in content-related machine learning projects, such as semantic tagging, content classification, and visual content understanding (highly desirable).You have strong coding proficiency in Python; interviews will be in Python.You are familiar with several of the following: PyTorch, AnyScale, WeightsAndBiases, Kubernetes, Docker.You have a strong understanding of Computer Science/Engineering fundamentals and first principles covering system design, data structures, architecture, and design patterns.You have exposure to data warehouse skills, such as SQL.You have applied research skills with the ability to dig into academic & industry publications and translate this into products and value for users.\n\n\nAbout The Team\n\nThe Content Group is a collection of several groups whose mission is to “build the most inspiring, diverse, and truly local content library on a global scale”.\n\nThe Content group is a “group of groups” comprising four main areas:\n\nContent Partnership and AcquisitionContent PlatformContent ReviewContent Strategy and Experience\n\n\nMachine Learning and Artificial Intelligence play an increasingly vital role in how we drive experiences through our content library. The Lead MLE in the Content Group, would be responsible for working with the engineering and product leaders to set the ML strategy across teams and ensure delivery of all relevant projects in the Content group.\n\nWhat's in it for you?\n\nAchieving our crazy big goals motivates us to work hard - and we do - but you'll experience lots of moments of magic, connectivity and fun woven throughout life at Canva, too. We also offer a range of benefits to set you up for every success in and outside of work.\n\nHere's a Taste Of What's On Offer\n\nEquity packages - we want our success to be yours tooInclusive parental leave policy that supports all parents & carersAn annual Vibe & Thrive allowance to support your wellbeing, social connection, office setup & moreFlexible leave options that empower you to be a force for good, take time to recharge and supports you personally\n\n\nCheck out lifeatcanva.com for more info.\n\nOther Stuff To Know\n\nWe make hiring decisions based on your experience, skills and passion, as well as how you can enhance Canva and our culture. When you apply, please tell us the pronouns you use and any reasonable adjustments you may need during the interview process.\n\nWe celebrate all types of skills and backgrounds at Canva so even if you don’t feel like your skills quite match what’s listed above - we still want to hear from you!\n\nPlease note that interviews are conducted virtually.",
        "skills": [
            "Applied Research",
            "Artificial Intelligence (AI)",
            "Computer Science",
            "Data Analysis",
            "Data Analytics",
            "Data Science",
            "Deep Learning",
            "Machine Learning",
            "Pattern Recognition",
            "Python (Programming Language)"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090064122",
        "reposted": false,
        "posted_time": "2024-12-03 05:22:48",
        "expire_time": "2025-01-02 05:22:48",
        "apply_url": "https://jobs.smartrecruiters.com/Canva/6000000000185263-lead-machine-learning-engineer-content-group?trid=2d92f286-613b-4daf-9dfa-6340ffbecf73"
    },
    {
        "title": "Cloud Support Engineer (Big Data / AIML)",
        "company": "Amazon Web Services (AWS)",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "industries": [
            "IT Services and IT Consulting"
        ],
        "job_functions": [
            "Information Technology",
            "Consulting",
            "Engineering"
        ],
        "applies": 0,
        "workplace_type": "N/A",
        "description": "Description\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nAmazon Web Services is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will interact with leading engineers and customers around the world to troubleshoot, build, secure, and optimise their workloads.\n\nWould you like to use the latest cloud computing technologies? Do you have a passion for Machine Learning? Can you apply advanced troubleshooting techniques to provide tailored solutions for our customers? Do you want to be part of a customer facing technology team helping to ensure the success of Amazon Web Services (AWS) as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies, specifically within Machine Learning Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs Interact with leading engineers around the world Partner with Amazon Web Services teams to help reproduce and resolve customer issues Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services Drive customer communication during critical events Drive projects that improve support-related processes and our customers’ technical support experience Write tutorials, how-to videos, and other technical articles for the developer community Work on critical, highly complex customer problems that may span multiple AWS services\n\nAbout The Team\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Australia Sydney or Melbourne Amazon offices.\n\nBasic Qualifications\n\n Bachelor's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field The Big Data role supports services that focus on Machine Learning technologies, including Amazon SageMaker and Bedrock, as well as dealing with open source models Experience with programming/scripting (Batch, VB, PowerShell, Java, C#, Chef, Perl, Ruby and/or PHP) Experience with System Administration with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server Experience with Networking and troubleshooting (TCP/IP, DNS, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related)\n\nPreferred Qualifications\n\n Strong analysis and troubleshooting skills and experience Experienced with Linux system monitoring and analysis Good understanding of distributed computing environments Exposure to Virtualization (VMware, Xen, Hypervisor) Prior working experience with AWS - any or all of EC2, S3, EBS, ELB, Dynamo DB, EMR, Glue, Athena Exposure to security concepts / best practices\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844251",
        "skills": [
            "Curl",
            "Doctrine (PHP)",
            "Domain Name System (DNS)",
            "Dynamo",
            "Elastic Load Balancing",
            "LAN-WAN",
            "Local Area Network (LAN)",
            "Traceroute",
            "Troubleshooting",
            "Wide Area Network (WAN)"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210056",
        "reposted": false,
        "posted_time": "2024-12-03 09:22:30",
        "expire_time": "2025-01-02 09:22:30",
        "apply_url": "https://www.amazon.jobs/jobs/2844251/cloud-support-engineer-big-data--aiml?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid"
    },
    {
        "title": "Software Engineer, Sustaining Engineering",
        "company": "Canonical",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Technology, Information and Internet"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 3,
        "workplace_type": "Remote",
        "description": "This is a fast-paced engineering role in Linux-based software-defined infrastructure and applications, covering all layers of the stack, including bare metal, virtualization (KVM) and containerization (Docker/LXC/LXD), storage (Ceph and Linux filesystems), networking (OVS, OVN and Core networking), up to OpenStack and Kubernetes, and the open source applications running on top of them. It will challenge you to show the breadth of engineering skill needed to work on almost any aspect of Ubuntu and the open source things people run with it.\n\nThis role is an opportunity for a technologist with a passion for Linux and open source to build a career with Canonical and drive success for our customers, community and the company. If you have an affinity for open source development, great communication skills, and a passion for troubleshooting and fixing issues in technology used by millions across the world, then you will enjoy working with some of the best people in the industry at Canonical.\n\nLocation: This is a remote role, we have teams in all time zones.\n\nThis role deals with critical issues in the open source stack that require software engineering for upstream bug fixes. Our engineers have to be able to work productively at any level of the stack above the kernel, in a wide range of languages, to understand and address the software issues at hand. Our group is critical to the success of our enterprise customers, partners and Ubuntu itself.\n\nYou will help with troubleshooting and driving issues to resolution with workarounds, guidance, and bug fixes to be released upstream and in Ubuntu.\n\nWhat your day will look like\n\nResolve complex customer problems related to Ubuntu, Kernel, Ceph, OpenStack, or Kubernetes and other open source softwareMaintain a close working relationship with Canonical's field, support and product engineering teamsParticipate in upstream communitiesDevelop bug fixes, backport patches, and work with upstream for inclusionReview code produced by other engineersDemonstrate good judgment in technical methods and techniquesPrioritize work and manage your time effectively against those prioritiesParticipate in team discussions to improve processes, tools, and documentationMaintain clear, technical and concise communicationsWork from home and travel internationally up to 10% of work time for team meetings, events and conferences\n\nWhat we are looking for in you \n\nProfessional experience as a software engineer Background in Computer Science, STEM or similarStrong experience with Linux, and at least one of the following:Ceph, OpenStack, Kubernetes or other cloud technologiesStrong development-level experience with at least one of Python, Go, C or C++ on LinuxAbility to troubleshoot with debugging tools like gdbFamiliarity with git source code repositories and branchesAn exceptional academic track record Willingness to travel up to 4 times a year for internal events\nAdditional Skills That You Might Also Bring\n\nYou love technology and working with brilliant peopleYou are curious, flexible, articulate, and accountableYou value soft skills and are passionate, enterprising, thoughtful, and self-motivatedYou have interest in, and experience with most of the following: Ubuntu Linux - kernel or userspace, Kubernetes, OpenStack, Ceph, QEMU/KVM, LXC/LXD, Python, Go, C, Postgresql, Mongo, Debian packaging, distributed systems\n\nWhat we offer you\n\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\nDistributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!Personal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveEmployee Assistance ProgrammeOpportunity to travel to new locations to meet colleagues from your team and othersPriority Pass for travel and travel upgrades for long haul company events\n\nAbout Canonical\n\nCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.\n\nCanonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\n\nCanonical is an equal opportunity employer\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n\n",
        "skills": [
            "C (Programming Language)",
            "Ceph",
            "Communication",
            "Computer Science",
            "Internal Events",
            "Kernel-based Virtual Machine (KVM)",
            "Linux",
            "Python (Programming Language)",
            "Ubuntu",
            "Upstream Oil and Gas"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089850987",
        "reposted": false,
        "posted_time": "2024-12-03 01:18:08",
        "expire_time": "2025-01-02 01:18:08",
        "apply_url": "https://grnh.se/ec7ff32d1us"
    },
    {
        "title": "Software Engineer, Photos",
        "company": "Google",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "",
        "industries": [
            "Information Services",
            "Technology, Information and Internet"
        ],
        "job_functions": [
            "Information Technology",
            "Engineering"
        ],
        "applies": 77,
        "workplace_type": "On-site",
        "description": "At Google, we have a vision of empowerment and equitable opportunity for all Aboriginal and Torres Strait Islander peoples and commit to building reconciliation through Google’s technology, platforms and people and we welcome Indigenous applicants. Please see our Reconciliation Action Plan for more information.\n\nApplicants to this role must have work authorization in Australia as this role is not eligible for work visa sponsorship.\n\nMinimum qualifications:\n\nBachelor’s degree or equivalent practical experience.2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting. 2 years of experience with data structures or algorithms in either an academic or industry setting. \n\nPreferred qualifications:\n\nMaster's degree or PhD in Computer Science or related technical fields.2 years of experience with performance, large-scale systems data analysis, visualization tools or debugging.Experience developing accessible technologies. Experience in code and system health, diagnosis and resolution, and software test engineering.\n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.\n\nResponsibilities\n\nWrite product or system development code.Lead design reviews with peers and stakeholders to decide among available technologies.Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
        "skills": [
            "Algorithms",
            "Computer Science",
            "Data Analysis",
            "Data Analytics",
            "Data Structures",
            "Debugging",
            "Programming Languages",
            "Software Development",
            "Software Testing",
            "Test Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087448060",
        "reposted": false,
        "posted_time": "2024-12-03 04:28:01",
        "expire_time": "2025-01-02 04:28:01",
        "apply_url": "https://careers.google.com/jobs/results/124150987060323014-software-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract"
    },
    {
        "title": "Programmer - 6-month contract",
        "company": "NBCUniversal",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "industries": [
            "Broadcast Media Production and Distribution",
            "Entertainment Providers",
            "Media Production"
        ],
        "job_functions": [
            "Production"
        ],
        "applies": 6,
        "workplace_type": "On-site",
        "description": "Company Description\n\nUniversal Networks International, a division of NBCUniversal, is one of the world’s premier entertainment networks, delivering quality content and compelling brands across Europe, the Middle East, Africa, Latin America and APAC.\n\nUniversal Networks International has the following core brands in the portfolio within the APAC portfolio; Bravo, 7Bravo, Universal TV, Studio Universal and DreamWorks – which deliver a full range of entertainment experiences to local audiences across the globe. Universal Networks International is part of NBCUniversal, a Comcast Corporation, and is one of the world’s leading media and entertainment companies in the development, production, and marketing of entertainment, news, and information to a global audience.\n\nJob Description\n\nCreate ‘must see’ annual Programming Plans and monthly Programming Schedules working with the Senior Program ManagerContribute to the monthly program planning meetingsSchedule and deliver daily transmission logs ensuring correct placement of NBCU promosEnsure appropriate creation and placement of Secondary Events (Certification Bugs & Zips)Download drafts and final schedules for transmission and deliver to affiliatesAction programming and presentation amendments in the broadcast systemLiaise with affiliates and broadcast playout on late changes / schedule issuesUsing all available reporting from the Research team, analyse ratings and monitor program performanceWork with the Ad Sales team on program sponsorship opportunities on linear and non-linearEnter all program metadata information into Lacuna including contract information (licence period, licence fees, runs etc) as well as programme information (synopsis, cast, classification etc)Manage VOD and blackouts information for all non-linear applicationsDistribute final schedules to internal and external stakeholdersClassification / compliance for programming and promosManage program run inventoryPrepare monthly / quarterly KPP and highlights documentsEnsure correct classification /compliance for programmes and promos to ensure appropriate warnings and censors are applied in Landmark and EPGMange file delivery for BSVOD channelsProvide metadata and EPG schedule for BSVOD channelsCreate monthly KPP document for BSVOD channelsApprove and process invoicesAssist with ad hoc programming related tasksEnsure all deadlines are met\n\nQualifications\n\nSKILLS AND EXPERIENCE – Desirable \n\nRelevant experience in a broadcast environmentFamiliarity with programme licence information and an understanding of the transmission processExperience using broadcast support systems in the programming and presentation scheudling fieldsAccurate data collection/entry and processing skills into required broadcast support systemA knowledge of different file formatsSKILLS AND EXPERIENCE – Essential A sound knowledge of Microsoft office packages, specifically Excel and wordStrong written and verbal communication with the confidence to work with a broad range of internal and external colleaguesEnthusiastic and proactive approach, with a flexible attitude to working on ever-changing projects and ad hoc dutiesExcellent time management and organisational skills, with the ability to work to deadlines with a high level of accuracyAbility to think on your feet and problem solvePositive attitude and solid team playerAn interest in working in media and developing a career within the broadcast industry\n\nThe responsibilities associated with this position are not limited to the above description and may be modified at any time by the Company.\n\nAdditional Information\n\nAs part of our selection process, external candidates may be required to attend an in-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision.\n\nNBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.",
        "skills": [
            "Broadcasting",
            "Communication",
            "Data Collection",
            "Non-linear Editing",
            "Oral Communication",
            "Presentations",
            "Program Planning",
            "Programming",
            "Software Development",
            "Support Systems"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087660002",
        "reposted": false,
        "posted_time": "2024-12-03 03:28:31",
        "expire_time": "2025-01-02 03:28:31",
        "apply_url": "https://jobs.smartrecruiters.com/NBCUniversal3/744000029812375-programmer-6-month-contract"
    },
    {
        "title": "Staff Software Engineer, Data Platform (AUS)",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 4,
        "workplace_type": "Remote",
        "description": "The Role\n\nAs Staff Software Engineer for Linktree’s Data Platform team, you’ll play a crucial role in building a robust, scalable data platform that drives innovative experiences in our core product. Your contributions will unlock new opportunities for our tens of millions of users and our billions of visitors around the world, helping us achieve Linktree’s mission: empowering anyone to curate, grow and monetize their digital universe.\n\nYou’ll collaborate with a talented group of engineers, analysts, data scientists and product managers and create powerful frameworks, tools, and services that support emerging technologies like semantic search, recommender systems, and content understanding.\n\nNow is an exciting time to join our team as we undergo a major transition to a self-serve data platform. With our company experiencing rapid growth, you'll have the opportunity to be at the forefront of this transformative shift, shaping a pivotal part of our data strategy and making a lasting impact on our future success. Help us take the next giant leap in our data journey.\n\nWhat You’ll Own\n\nYou’ll be responsible for the delivery and real-world application of a broad range of data, ML and AI technologies;You’ll do hands-on work to continuously level-up our event ingestion, event brokers, data warehouses, data pipelines and data integration systems;You’ll design performant, scalable systems that empower our internal teams to self-serve their data needs;You’ll help steer our overall data strategy, in close collaboration with other Staff Engineers and leaders from across the company;You’ll manage a portfolio of experiments with data, testing a wide range of ideas and doubling down on those that work best;You’ll mentor your peers, within a culture of deep collaboration, honest feedback and continuous improvement;You’ll evangelise best practices for data and ML, and drive adoption across the company.\n\nWho We’re Looking For\n\nExperience: 5+ years of software engineering experience with a strong background in building scalable data platforms. Experience with data technologies (e.g. Spark), data warehousing solutions (e.g. Snowflake), and cloud platforms (e.g. AWS).Technical Skills: Proficiency in programming languages such as Python, or Typescript and experience with infrastructure as code tools such as CDK.Communication: Excellent interpersonal and communication skills, with the ability to collaborate effectively across teams and present technical concepts to non-technical stakeholders.Education: Bachelor’s degree in Computer Science, Engineering, or a related field. Advanced degrees or relevant certifications are a plus.\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "Communication",
            "Computer Science",
            "Programming",
            "Programming Languages",
            "TypeScript"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088711058",
        "reposted": false,
        "posted_time": "2024-12-03 12:52:54",
        "expire_time": "2025-01-02 12:52:54",
        "apply_url": "https://jobs.gem.com/linktree/6863bbaa-70ef-42e8-850a-09a6e54ff499?src=LinkedIn+Paid"
    },
    {
        "title": "Cloud Support Engineer (Big Data / AIML)",
        "company": "Amazon Web Services (AWS)",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "industries": [
            "IT Services and IT Consulting"
        ],
        "job_functions": [
            "Information Technology",
            "Consulting",
            "Engineering"
        ],
        "applies": 0,
        "workplace_type": "N/A",
        "description": "Description\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nAmazon Web Services is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will interact with leading engineers and customers around the world to troubleshoot, build, secure, and optimise their workloads.\n\nWould you like to use the latest cloud computing technologies? Do you have a passion for Machine Learning? Can you apply advanced troubleshooting techniques to provide tailored solutions for our customers? Do you want to be part of a customer facing technology team helping to ensure the success of Amazon Web Services (AWS) as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies, specifically within Machine Learning Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs Interact with leading engineers around the world Partner with Amazon Web Services teams to help reproduce and resolve customer issues Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services Drive customer communication during critical events Drive projects that improve support-related processes and our customers’ technical support experience Write tutorials, how-to videos, and other technical articles for the developer community Work on critical, highly complex customer problems that may span multiple AWS services\n\nAbout The Team\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Australia Sydney or Melbourne Amazon offices.\n\nBasic Qualifications\n\n Bachelor's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field The Big Data role supports services that focus on Machine Learning technologies, including Amazon SageMaker and Bedrock, as well as dealing with open source models Experience with programming/scripting (Batch, VB, PowerShell, Java, C#, Chef, Perl, Ruby and/or PHP) Experience with System Administration with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server Experience with Networking and troubleshooting (TCP/IP, DNS, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related)\n\nPreferred Qualifications\n\n Strong analysis and troubleshooting skills and experience Experienced with Linux system monitoring and analysis Good understanding of distributed computing environments Exposure to Virtualization (VMware, Xen, Hypervisor) Prior working experience with AWS - any or all of EC2, S3, EBS, ELB, Dynamo DB, EMR, Glue, Athena Exposure to security concepts / best practices\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844251",
        "skills": [
            "Curl",
            "Doctrine (PHP)",
            "Domain Name System (DNS)",
            "Dynamo",
            "Elastic Load Balancing",
            "LAN-WAN",
            "Local Area Network (LAN)",
            "Traceroute",
            "Troubleshooting",
            "Wide Area Network (WAN)"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090206850",
        "reposted": false,
        "posted_time": "2024-12-03 09:22:30",
        "expire_time": "2025-01-02 09:22:30",
        "apply_url": "https://www.amazon.jobs/jobs/2844251/cloud-support-engineer-big-data--aiml?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid"
    },
    {
        "title": "Mid-Senior AWS Data Engineer",
        "company": "InfoCentric",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Information Services"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 21,
        "workplace_type": "On-site",
        "description": "Job Description\n\nAs a strong AWS Data Engineer, you are a critical enabler in building, optimizing, and maintaining a robust data infrastructure. You excel in designing scalable, high-performance data pipelines that are essential for effective analytics, reporting, and machine learning processes. Your understanding of AWS and Snowflake goes beyond the basics—you leverage these platforms to their fullest potential, implementing best practices for data security, scalability, and cost efficiency.\n\nResponsibilities\n\nDesign, implement, and maintain large-scale data pipelines and architectures on AWS and Snowflake platforms.Develop ETL processes to gather data from multiple sources, ensuring data quality, integrity, and optimal performance.Collaborate with data analysts and business stakeholders to understand requirements and deliver data solutions that enable advanced analytics and reporting.Build and manage data warehouses and data marts on Snowflake, optimizing data structures and storage to enhance accessibility and efficiency.Perform data migrations and integration from on-premises systems or other cloud environments to AWS and Snowflake.Implement and manage AWS services such as S3, Glue, Lambda, Redshift, and EMR as needed to support data workflows and pipelines.Monitor and optimize data pipelines for performance, scalability, and cost efficiency.Implement data governance practices, including data security, privacy, and access controls, in compliance with industry standards.\n\nYour Expertise Includes\n\nAdvanced Cloud Proficiency: Deep understanding of AWS services (S3, Glue, Redshift, Lambda, and EMR) and their integration to build and maintain scalable data architectures.Expert Snowflake Skills: Proficiency in using Snowflake for data warehousing, with knowledge of how to optimize data storage, manage costs, and implement security best practices.ETL Mastery: You can develop and manage complex ETL processes, ensuring data consistency, quality, and performance across multiple sources.SQL and Programming Strength: Strong in SQL for complex transformations and skilled in scripting languages such as Python or Java for automation and data manipulation.Data Modeling Expertise: Experienced in data modeling for structured and semi-structured data, ensuring the data architecture supports business requirements and optimizes analytical access.Governance and Compliance: Familiarity with data governance frameworks, ensuring data security, privacy, and compliance in cloud environments.",
        "skills": [
            "Amazon Redshift",
            "Business Requirements",
            "Data Analytics",
            "Data Architecture",
            "Data Manipulation",
            "Data Modeling",
            "Data Warehousing",
            "Extract, Transform, Load (ETL)",
            "Snowflake",
            "Snowflake Cloud"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4071744973",
        "reposted": true,
        "posted_time": "2024-12-03 10:54:53",
        "expire_time": "2025-01-10 17:12:48",
        "apply_url": "https://infocentric.breezy.hr/p/e7aa3b912a43-mid-senior-aws-data-engineer?source=%5BLinkedIn%5D"
    },
    {
        "title": "AWS Engineer",
        "company": "micro1",
        "location": "APAC",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 104,
        "workplace_type": "Remote",
        "description": "Job Title: AWS Engineer\nJob Type: Full-time\nLocation: Remote\nAbout us:micro1 connects exceptional talent to transformative projects. We’re here to provide not just a job, but a platform for you to grow and achieve your career goals. We're proud to work with trusted partners such as Deel, Immutable, O’Gara, and LegalSoft.\nWhat We Offer:Work from anywhereHealthcare reimbursementWi-Fi reimbursementUnlimited learning and more.\nJob Summary:Join our dynamic team as an AWS Engineer, where you'll play a pivotal role in optimizing AWS infrastructure. At micro1, we connect skilled remote professionals with top-tier Silicon Valley companies, offering you an opportunity for a stable and rewarding career while working on exciting projects.\nKey Responsibilities:• Manage AWS resources efficiently to ensure optimal performance.• Design and implement scalable cloud solutions using AWS services.• Collaborate with cross-functional teams to meet project objectives.• Monitor and optimize AWS infrastructure for cost and performance.• Ensure high levels of security and compliance within AWS environments.• Develop automation scripts for regular tasks using AWS Lambda.• Provide technical support and guidance to other teams as needed.\nRequired Skills and Qualifications:• Strong expertise in AWS services including EC2 and Lambda.• Proven experience in managing AWS infrastructure.• Excellent written and verbal communication skills.• Proficient in designing and deploying scalable cloud solutions.• Ability to collaborate effectively in a remote team environment.\nPreferred Qualifications:• Experience in cloud security practices.• AWS certification is a plus.",
        "skills": [
            "AWS Lambda",
            "Amazon EC2",
            "Amazon Web Services (AWS)",
            "Cloud Computing",
            "Cloud Infrastructure",
            "Cloud Security",
            "Communication",
            "Cross-functional Team Leadership",
            "Oral Communication",
            "Python (Programming Language)"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090515384",
        "reposted": false,
        "posted_time": "2024-12-03 17:29:37",
        "expire_time": "2025-01-02 17:29:37",
        "apply_url": "https://jobs.micro1.ai/post/9596ad56-d367-4246-8293-71e8c0fd30d4/"
    },
    {
        "title": "Senior Backend Engineer, Content Moderation",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 6,
        "workplace_type": "N/A",
        "description": "The Role\n\nLinktree is a leading platform that empowers users to centralize their online presence, streamlining how they connect with their audience across various channels. As our company grows, so does the complexity and importance of ensuring a safe and engaging environment for our diverse user base.\n\nWe are seeking a skilled Backend Software Engineer to join our dynamic Content Moderation Team. In this role, you’ll be working with a small team of Software and Machine Learning Engineers in developing and maintaining backend systems that detect and action violative content uploaded to our platform.\n\nWhat You’ll Own\n\nOur Content Moderation platform capabilities, scanning all content shared on Linktree for violations of our Community Standards and implementation of our Trust & Safety team’s policiesThe build, deployment, infrastructure, testing and monitoring of our deployed and running serviceProcesses for scanning content for violations and either automatically moderating it or queueing it for review if requiredTooling used by our Trust & Safety team to review trends in content being uploaded and review content flagged as potentially violativeStandardised interfaces between the Content Moderation team and the rest of the Linktree organisation to communicate content being uploaded, classified, detected as violative and moderated to enable consistent integrations with all teams\n\nWho We’re Looking For\n\nBachelor’s degree in Engineering, Computer Science, Information and Technology or equivalent and 5+ years of relevant industry experience.Prior experience with backend software development (We use Typescript primarily but experience with any equivalent language is fine)Prior experience building services with open source web application frameworks (e.g. Spring, ASP.NET, ExpressJS, Symfony, NestJS) and object oriented programmingPrior experience managing the cloud infrastructure, deployment pipelines, build, testing and monitoring of containerised backend microservicesPrior experience developing and designing event-driven and synchronous systemsWillingness to contribute to the front-end tooling used by the Trust & Safety team (we use a third party platform enabling us to develop this tooling using a building-block framework)Strong verbal and written communication skills and a passion for helping other teams\n\nPreferred Experience, Not Required\n\nExperience working for SAAS companiesExperience building self-service tooling and platformsExperience managing AWS cloud infrastructure with their CDK\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "Back-End Web Development",
            "Communication",
            "Computer Science",
            "Microservices",
            "Moderating",
            "Object-Oriented Programming (OOP)",
            "Software Development",
            "Symfony Framework",
            "TypeScript",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088710091",
        "reposted": false,
        "posted_time": "2024-12-03 12:52:54",
        "expire_time": "2025-01-02 12:52:54",
        "apply_url": "https://jobs.gem.com/linktree/0f6f8c77-c885-4ad5-ae7c-c4bebe5f8408?src=LinkedIn+Paid"
    },
    {
        "title": "Python Developers - Swinburne University",
        "company": "CPT Global",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Contract",
        "seniority_level": "Entry level",
        "industries": [
            "Non-profit Organizations",
            "Primary and Secondary Education"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 30,
        "workplace_type": "Hybrid",
        "description": "CPT Global is on the lookout for skilled Python Developers to collaborate on innovative projects at Swinburne University. As a Python Developer, you will contribute to the development and enhancement of applications and systems that support the university's diverse educational and administrative functions. Your role will involve writing clean, maintainable code, designing efficient algorithms, and participating in the full software development lifecycle, from requirements gathering to deployment. You will work closely with academic teams and other stakeholders to understand their needs, creating solutions that are not only functional but also scalable and user-friendly. With your expertise in Python and your problem-solving mindset, you will have the opportunity to impact the academic experience of students and faculty alike, helping to drive technological advancements within the university. CPS Global is committed to fostering a collaborative and inclusive work environment, supporting professional development, and driving innovation in our projects.\n\nKey Responsibilities\n\nDesign, develop, and test scalable applications and systems using PythonCollaborate with stakeholders to gather and analyze requirements and translate them into technical specificationsImplement best practices for software development, including code reviews and unit testingOptimize application performance and scalability while ensuring security measures are in placeProvide technical support and troubleshooting for deployed systems and applicationsStay updated with the latest trends in Python development and apply them to current projects\n\n\nRequirements\n\nProven experience as a Python Developer, with a strong portfolio of projectsProficiency in Python frameworks such as Django or FlaskUnderstanding of database management systems (SQL and NoSQL) and ORM technologiesStrong problem-solving skills and the ability to work independently as well as within a teamExperience with version control systems, such as GitFamiliarity with cloud services and deployment tools is a plusExcellent communication skills, both verbal and written, with the ability to work in a collaborative environment",
        "skills": [],
        "job_url": "https://www.linkedin.com/jobs/view/4090206511",
        "reposted": false,
        "posted_time": "2024-12-03 03:54:25",
        "expire_time": "2025-06-01 07:52:55",
        "apply_url": "https://www.linkedin.com/job-apply/4090206511"
    },
    {
        "title": "Expression Of Interest (EOI) - Senior/ Staff/ Principal Platform Engineer",
        "company": "Commonwealth Bank",
        "location": "Perth, Western Australia, Australia",
        "employment_type": "Part-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Financial Services"
        ],
        "job_functions": [
            "Other"
        ],
        "applies": 12,
        "workplace_type": "Hybrid",
        "description": "We are recruiting Platform Engineers at all levels, across many technology stacks!\n\nWhat is Platform Engineering @ CommBank\n\nPlatform Engineers architect, design, run, and evolve our Platforms – the core technology that our people use to deliver value to our customers.\n\nPlatform Engineers work hard so that our Platforms are loved by their users – our Product Engineers – because they help them get more done, spend less time on undifferentiated heavy lifting, and more time focusing on delivering great products to our customers.\n\nPlatform Engineers take an ‘automate first’ approach, ensuring that deployments and operations are performed via pipelines, and using Infrastructure as Code. Wherever possible, we encourage our people to write code that does the work, and to spend dedicated time improving the flow of work.\n\nWhat levels of role are you recruiting for?\n\nWe are currently recruiting for engineers, senior engineers, staff engineers, principal engineers, and chief engineers, as well as all levels of engineering managers.\n\nWhat skills do Platform Engineers have, and what Technology will I be working on?\n\nPlatform Engineers have strong infrastructure and systems knowledge combined with proficiency in modern DevOps practices, automation, and writing code to automate operations.\n\nThis is not an exhaustive list of technologies, so if you’re unsure, please apply.\n\nCloud: AWS, Kubernetes, Docker, Ansible, TerraformMonitoring & Observability: Go, Python, Grafana, Prometheus.End-User Compute: Windows, Mac OS X, InTune, Entra ID, Autopilot, Active DirectoryEngineering Tooling: GitHub, GitHub Actions, Perfecto, Artifactory, Snyk, TeamCity\n\nThe Responsibilities:\n\nDesign, develop and maintain platforms and tools that make life easier for our product engineersDesign and implement the technology stack and integration using infrastructure as code principlesTroubleshoot and resolve stability issues to increase system resilience and stabilityFocus on automating deployments, testing, and all kinds of toilListen to the users of the platform and iteratively evolve the platform to deliver even better experiencesShare your knowledge, and create documentation that is easy to read and understandMentor and guide junior engineers on the teamParticipate in our overall Engineering community – learning from and teaching others\n\nQualifications and experience:\n\nExperience performing platform engineering, software engineering, or systems engineering, or another related discipline – depending on the level of roleCloud certifications in AWS or Azure are useful, but not required (we will help you get certified if you want)Deep knowledge of the technology concepts and stack of one of our platformsFamiliarity with DevOps methodologies and CI/CD pipelinesScripting and programming skills, and the desire to learn new programming languagesExcellent problem solving and analytical skillsDemonstrated track record of showing that you are kind, curious & humble\n\nWorking with us\n\nWhether you're passionate about customer service, driven by data, or called by creativity, a career with CommBank is for you. Our people bring their diverse backgrounds and unique perspectives to build a respectful, inclusive, and flexible workplace with flexible work locations.\n\nHere, you’ll thrive. You’ll be supported when faced with challenges and empowered to tackle new opportunities. We’re hiring engineers from across all of Australia and have opened technology hubs in Melbourne and Perth. We really love working here, and we think you will too. \n\nWe support our people with the flexibility to balance where work is done with at least half their time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work in the role you’re interested in.\n\nIf this sounds like the role for you then we would love to hear from you. Apply today!\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 14/12/2024",
        "skills": [
            "Analytical Skills",
            "Automation",
            "Autopilot",
            "DevOps",
            "EOI",
            "Microsoft Intune",
            "Problem Solving",
            "Resiliency",
            "Stack",
            "Systems Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4069283165",
        "reposted": true,
        "posted_time": "2024-12-03 10:15:09",
        "expire_time": "2025-02-01 07:55:14",
        "apply_url": "https://cba.wd3.myworkdayjobs.com/CommBank_Careers/job/Sydney-CBD-Area/Expression-Of-Interest--EOI----Senior--Staff--Principal-Platform-Engineer_REQ217672?source=LinkedIn"
    },
    {
        "title": "Expression Of Interest (EOI) - Senior/ Staff/ Principal Platform Engineer",
        "company": "Commonwealth Bank",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Part-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Financial Services"
        ],
        "job_functions": [
            "Other"
        ],
        "applies": 25,
        "workplace_type": "Hybrid",
        "description": "We are recruiting Platform Engineers at all levels, across many technology stacks!\n\nWhat is Platform Engineering @ CommBank\n\nPlatform Engineers architect, design, run, and evolve our Platforms – the core technology that our people use to deliver value to our customers.\n\nPlatform Engineers work hard so that our Platforms are loved by their users – our Product Engineers – because they help them get more done, spend less time on undifferentiated heavy lifting, and more time focusing on delivering great products to our customers.\n\nPlatform Engineers take an ‘automate first’ approach, ensuring that deployments and operations are performed via pipelines, and using Infrastructure as Code. Wherever possible, we encourage our people to write code that does the work, and to spend dedicated time improving the flow of work.\n\nWhat levels of role are you recruiting for?\n\nWe are currently recruiting for engineers, senior engineers, staff engineers, principal engineers, and chief engineers, as well as all levels of engineering managers.\n\nWhat skills do Platform Engineers have, and what Technology will I be working on?\n\nPlatform Engineers have strong infrastructure and systems knowledge combined with proficiency in modern DevOps practices, automation, and writing code to automate operations.\n\nThis is not an exhaustive list of technologies, so if you’re unsure, please apply.\n\nCloud: AWS, Kubernetes, Docker, Ansible, TerraformMonitoring & Observability: Go, Python, Grafana, Prometheus.End-User Compute: Windows, Mac OS X, InTune, Entra ID, Autopilot, Active DirectoryEngineering Tooling: GitHub, GitHub Actions, Perfecto, Artifactory, Snyk, TeamCity\n\nThe Responsibilities:\n\nDesign, develop and maintain platforms and tools that make life easier for our product engineersDesign and implement the technology stack and integration using infrastructure as code principlesTroubleshoot and resolve stability issues to increase system resilience and stabilityFocus on automating deployments, testing, and all kinds of toilListen to the users of the platform and iteratively evolve the platform to deliver even better experiencesShare your knowledge, and create documentation that is easy to read and understandMentor and guide junior engineers on the teamParticipate in our overall Engineering community – learning from and teaching others\n\nQualifications and experience:\n\nExperience performing platform engineering, software engineering, or systems engineering, or another related discipline – depending on the level of roleCloud certifications in AWS or Azure are useful, but not required (we will help you get certified if you want)Deep knowledge of the technology concepts and stack of one of our platformsFamiliarity with DevOps methodologies and CI/CD pipelinesScripting and programming skills, and the desire to learn new programming languagesExcellent problem solving and analytical skillsDemonstrated track record of showing that you are kind, curious & humble\n\nWorking with us\n\nWhether you're passionate about customer service, driven by data, or called by creativity, a career with CommBank is for you. Our people bring their diverse backgrounds and unique perspectives to build a respectful, inclusive, and flexible workplace with flexible work locations.\n\nHere, you’ll thrive. You’ll be supported when faced with challenges and empowered to tackle new opportunities. We’re hiring engineers from across all of Australia and have opened technology hubs in Melbourne and Perth. We really love working here, and we think you will too. \n\nWe support our people with the flexibility to balance where work is done with at least half their time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work in the role you’re interested in.\n\nIf this sounds like the role for you then we would love to hear from you. Apply today!\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 14/12/2024",
        "skills": [
            "Analytical Skills",
            "Automation",
            "Autopilot",
            "DevOps",
            "EOI",
            "Microsoft Intune",
            "Problem Solving",
            "Resiliency",
            "Stack",
            "Systems Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4069283163",
        "reposted": true,
        "posted_time": "2024-12-03 10:15:13",
        "expire_time": "2025-02-01 07:55:14",
        "apply_url": "https://cba.wd3.myworkdayjobs.com/CommBank_Careers/job/Sydney-CBD-Area/Expression-Of-Interest--EOI----Senior--Staff--Principal-Platform-Engineer_REQ217672?source=LinkedIn"
    },
    {
        "title": "Data Engineer",
        "company": "Talent Ready",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "IT Services and IT Consulting",
            "Financial Services",
            "Information Services"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 47,
        "workplace_type": "Hybrid",
        "description": "About the jobWe are recruiting for a technology and engineering professional services business based in Sydney who help enable organisations with their technical architecture and development capabilities to reach transformational outcomes. Utilize the latest in application and integration DevOps and Data technologies and work with high profile clients in government, financial services and utilities. The market for Data expertise is on an exponential growth trajectory and to meet demand they are looking for an experienced Data Engineer.\nDuties and Responsibilities:Deliver client solutions on end to end data engineering projects from a consulting/lead positionComplex analysis and interpretation of clients needs to deliver suitable pipelines, housewarming and data lakesData quality, integrity and usability governance, working in collaboration with the wider data team and businessMentor and direct team members from a technical and design perspectiveStakeholder and client relationship and expectation management\nAbout you:Consulting level experience with data engineering practices like data transformation, modeling and warehousing using modern data technology including Snowflake and Databricks Strong knowledge of Python/SQLMigration experience moving enterprise data warehouse with hands on experience with data warehouse platforms like Teradata/Cloudera or others.We would expect broader experience across AWS Cloud Architecture, DevOps, networking, Machine Learning and security.This role requires strong stakeholder management and communication skills with the ability to problem solve and build relationships underpinned by excellent communication and presentation skills.\nWhy you should join us:We work on the latest cloud technology on challenging complex integration and digital transformation projectsWe offer remote work with 4 days from home per weekWe are a fast paced rapidly growing specialist consulting firm with a strong reputation and growing list of high-profile clientsWe have supportive management and offer career growth and learning opportunitiesWe offer excellent remuneration and flexible, family friendly working arrangements\nIf this sounds like you and you’re interested in joining us on our data journey, please apply now!",
        "skills": [
            "Amazon Web Services (AWS)",
            "Azure Databricks",
            "Cloud Computing",
            "Data Engineering",
            "Data Modeling",
            "Data Pipelines",
            "Data Warehouse Architecture",
            "DevOps",
            "SQL",
            "Snowflake"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087633628",
        "reposted": false,
        "posted_time": "2024-12-03 00:45:47",
        "expire_time": "2025-01-02 00:45:47",
        "apply_url": "N/A"
    },
    {
        "title": "Freelance IT/Network Engineer",
        "company": "Tech Domain",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Part-time",
        "seniority_level": "",
        "industries": [],
        "job_functions": [],
        "applies": 27,
        "workplace_type": "On-site",
        "description": "We are looking for an ONSITE Network Support Engineer/Technician to support Casual Freelancing type tasks in your area. Would you be interested in contractual tasks? you will be paid either on an hourly or daily/half-day basis. Tickets will be dispatched with respect to your area & you may support them as per your availability (weekdays, weekends).\nTasks will be L1 & L2 IT/Networking related like desktop support, Server/Rack part (Hard disk drives, etc.) hardware installation & replacement. Provide on-site assistance (console access Router/Switch/Firewall etc.) to remote support.\nBase Skill Set:\n✅ Expertise in System Desktop Administration, Customer Service, Incident/Change/Release management, and Support for various third-party applications on Windows Platforms\n✅ Professionally trained & certified in IT Infrastructure Library & Windows Server Administration and has a sharp focus on utilizing the programming techniques for various initiative activities\n✅ Basic understanding of DHCP, DNS, IP addressing, fixing wireless Lan, Ethernet desktop configuration issues, and subnetting.\n✅ Technical troubleshooting and hands-on experience with different OS such as iOS, Android, Windows, and Blackberry devices",
        "skills": [
            "Computer Science",
            "EIGRP",
            "IP Networking",
            "Network Administration",
            "Network Configuration",
            "Network Engineering",
            "Network Infrastructure",
            "Network Security",
            "Networking",
            "Troubleshooting"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087660891",
        "reposted": false,
        "posted_time": "2024-12-03 04:34:01",
        "expire_time": "2025-01-02 04:34:01",
        "apply_url": "https://www.linkedin.com/job-apply/4087660891"
    },
    {
        "title": "Software Development Engineer",
        "company": "Easygo",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 175,
        "workplace_type": "N/A",
        "description": "Easygo leads the world in crafting top-tier entertainment experiences. Within our engineering organization, we foster a continuous learning environment, constantly pushing the boundaries of large-scale software design and development. Our culture revolves around fostering growth, nurturing learning, and upholding excellence in engineering, ensuring we consistently set the benchmark for engineering mastery.\nWhy join us?\nAre you a passionate and ambitious software engineer ready to dive into an environment that fosters innovation, continuous learning, and professional growth? We're seeking talented individuals who are eager to tackle complex problems, build scalable solutions, and collaborate with some of the finest engineers in the entertainment industry.\n\nComplex Projects, Creative Solutions: Dive into intricate projects that challenge and push boundaries. Solve complex technical puzzles and craft scalable solutions.\nAccelerate Your Growth: Access mentorship, training, and hands-on experiences to level up your skills. Learn from industry experts and gain expertise in scaling software.\nCollaborate with Industry Leaders: Work alongside exceptional engineers, exchanging ideas and driving innovation forward through collaboration.\nCaring Culture, Career Development: We deeply care about your career. Our culture prioritizes your growth with tailored learning programs and mentorship.\nEmbrace Challenges, Celebrate Success: Take on challenges, learn from failures, and celebrate achievements together.\nShape the Future: Your contributions will shape the future of entertainment.\n\nIf you're passionate about growth, innovation, and working with the best, we'd love to have you on our team!\nKey Responsibilities:\n\nCollaborate with team members to contribute to software development projects.\nParticipate actively in coding, testing, debugging, and troubleshooting software issues.\nLearn and apply coding standards, best practices, and development methodologies.\nAssist in the design and implementation of software solutions under supervision.\nEngage in continuous learning, seeking guidance and learning from experienced team members.\n\nQualifications:\n\nBachelor's/Master's degree in Computer Science or equivalent practical experience.\n1+ years of hands-on experience in software engineering\nStrong problem-solving skills and the ability to thrive in a fast-paced, dynamic environment.\nExcellent communication and collaboration skills.",
        "skills": [
            "Coding Standards",
            "Communication",
            "Computer Science",
            "Creative Problem Solving",
            "Problem Solving",
            "Programming",
            "Software Development",
            "Software Troubleshooting",
            "Training",
            "Troubleshooting"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089874137",
        "reposted": false,
        "posted_time": "2024-12-03 01:58:48",
        "expire_time": "2025-01-02 01:58:48",
        "apply_url": "https://www.linkedin.com/job-apply/4089874137"
    },
    {
        "title": "Expression Of Interest (EOI) - Senior/ Staff/ Principal Platform Engineer",
        "company": "Commonwealth Bank",
        "location": "Brisbane, Queensland, Australia",
        "employment_type": "Part-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Financial Services"
        ],
        "job_functions": [
            "Other"
        ],
        "applies": 12,
        "workplace_type": "Hybrid",
        "description": "We are recruiting Platform Engineers at all levels, across many technology stacks!\n\nWhat is Platform Engineering @ CommBank\n\nPlatform Engineers architect, design, run, and evolve our Platforms – the core technology that our people use to deliver value to our customers.\n\nPlatform Engineers work hard so that our Platforms are loved by their users – our Product Engineers – because they help them get more done, spend less time on undifferentiated heavy lifting, and more time focusing on delivering great products to our customers.\n\nPlatform Engineers take an ‘automate first’ approach, ensuring that deployments and operations are performed via pipelines, and using Infrastructure as Code. Wherever possible, we encourage our people to write code that does the work, and to spend dedicated time improving the flow of work.\n\nWhat levels of role are you recruiting for?\n\nWe are currently recruiting for engineers, senior engineers, staff engineers, principal engineers, and chief engineers, as well as all levels of engineering managers.\n\nWhat skills do Platform Engineers have, and what Technology will I be working on?\n\nPlatform Engineers have strong infrastructure and systems knowledge combined with proficiency in modern DevOps practices, automation, and writing code to automate operations.\n\nThis is not an exhaustive list of technologies, so if you’re unsure, please apply.\n\nCloud: AWS, Kubernetes, Docker, Ansible, TerraformMonitoring & Observability: Go, Python, Grafana, Prometheus.End-User Compute: Windows, Mac OS X, InTune, Entra ID, Autopilot, Active DirectoryEngineering Tooling: GitHub, GitHub Actions, Perfecto, Artifactory, Snyk, TeamCity\n\nThe Responsibilities:\n\nDesign, develop and maintain platforms and tools that make life easier for our product engineersDesign and implement the technology stack and integration using infrastructure as code principlesTroubleshoot and resolve stability issues to increase system resilience and stabilityFocus on automating deployments, testing, and all kinds of toilListen to the users of the platform and iteratively evolve the platform to deliver even better experiencesShare your knowledge, and create documentation that is easy to read and understandMentor and guide junior engineers on the teamParticipate in our overall Engineering community – learning from and teaching others\n\nQualifications and experience:\n\nExperience performing platform engineering, software engineering, or systems engineering, or another related discipline – depending on the level of roleCloud certifications in AWS or Azure are useful, but not required (we will help you get certified if you want)Deep knowledge of the technology concepts and stack of one of our platformsFamiliarity with DevOps methodologies and CI/CD pipelinesScripting and programming skills, and the desire to learn new programming languagesExcellent problem solving and analytical skillsDemonstrated track record of showing that you are kind, curious & humble\n\nWorking with us\n\nWhether you're passionate about customer service, driven by data, or called by creativity, a career with CommBank is for you. Our people bring their diverse backgrounds and unique perspectives to build a respectful, inclusive, and flexible workplace with flexible work locations.\n\nHere, you’ll thrive. You’ll be supported when faced with challenges and empowered to tackle new opportunities. We’re hiring engineers from across all of Australia and have opened technology hubs in Melbourne and Perth. We really love working here, and we think you will too. \n\nWe support our people with the flexibility to balance where work is done with at least half their time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work in the role you’re interested in.\n\nIf this sounds like the role for you then we would love to hear from you. Apply today!\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 14/12/2024",
        "skills": [
            "Analytical Skills",
            "Automation",
            "Autopilot",
            "DevOps",
            "EOI",
            "Microsoft Intune",
            "Problem Solving",
            "Resiliency",
            "Stack",
            "Systems Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4069283170",
        "reposted": true,
        "posted_time": "2024-12-03 10:07:46",
        "expire_time": "2025-02-01 07:55:14",
        "apply_url": "https://cba.wd3.myworkdayjobs.com/CommBank_Careers/job/Sydney-CBD-Area/Expression-Of-Interest--EOI----Senior--Staff--Principal-Platform-Engineer_REQ217672?source=LinkedIn"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 24,
        "workplace_type": "N/A",
        "description": "The Role\n\nWe are looking for Senior Software Engineers who are great problem solvers, enjoy collaborating with others (not just engineers) that value well-written and tested code. As a Software Engineer at Linktree, you’ll be working together with various members and teams to achieve your goals. You’ll dive deep into how we currently work and help us optimize it as you grow into your role. We’re just getting started, so joining us now means a LOT of influence on the direction we’re going.\n\nWhat We’re Looking For\n\nDegree in Engineering, Computer Science, or equivalent and 5+ years of Software Engineering experienceYou care about figuring out how to work backwards from a desired outcome and take pride in building the simplest possible solution to achieve that goal.You care about the users of your systems and actively strive to build solutions that make their lives easier, not harder.Experience with our stack is a plus: Typescript, Node.js and PostGreSQL. The rest of our stack includes GraphQL, AWS (S3, EventBridge, SQS, Lambda, ECS, CDK) and Snowflake. Our monolith consists of a PHP code base.\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            ".NET Framework",
            "ASP.NET",
            "AutoCAD",
            "Cascading Style Sheets (CSS)",
            "Computer Science",
            "HTML",
            "Object-Oriented Programming (OOP)",
            "Programming",
            "Python (Programming Language)",
            "XML"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088705781",
        "reposted": false,
        "posted_time": "2024-12-03 12:52:53",
        "expire_time": "2025-01-02 12:52:53",
        "apply_url": "https://jobs.gem.com/linktree/e404a437-ef52-4751-ad57-96bbbf1600fe?src=LinkedIn+Paid"
    },
    {
        "title": "AI Audio Codec Algorithm and Standardization Engineer",
        "company": "TikTok",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Entertainment Providers"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 0,
        "workplace_type": "N/A",
        "description": "Responsibilities\n\nTikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.\n\nWhy Join Us\n\nCreation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible.\n\nTogether, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day.\n\nTo us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always.\n\nAt TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve.\n\nJoin us.\n\nTeam Introduction\n\nWelcome to Video Arch Intelligent Immersive Audio Team! We are dedicated to pushing the boundaries of immersive audio technology and standardization. In addition to supporting TikTok requirements including short video, live-streaming, content creation tools and also VR/AR experiences, we also stay up-to-date with the latest research in the industry and participate in audio Standards Developing Organizations(SDO) such as MPEG, 3GPP, and IETF, etc. As part of our commitment to innovation, we proactively conduct R&D using Machine Learning and NN models(especially generative models) for immersive audio technology. If you're looking to work with a team that values creativity, innovation, and collaboration, we'd love to hear from you. Please join us to reshape the audio world together.\n\nResponsibilities\n\n Develop a high compression rate full-band AI audio codec algorithm system based on generative frameworks. Research and apply model architectures such as VQ-VAE, GAN, and Diffusion to audio feature representations and high-quality AI audio codec systems. Follow and research the next-generation audio codec system for machines. Build underlying technologies for machine-oriented intelligent audio representation and interaction. Participate in the development of domestic and foreign audio standards and supporting systems, including domestic UWA, AVS standard organizations, and international 3GPP SA4, MPEG-IWG6, IETF, MPAI, etc.\n\nQualifications\n\nMinimum Qualifications\n\n PhD in related majors such as computer science, electronic information, communication engineering, information and systems, artificial intelligence, with a good academic research background. Have the ability to model digital signals and artificial intelligence/deep learning algorithms and validate the systems. Those who have had complete experience in participating in international standard formulation are preferred.\n\nPreferred Qualifications\n\n Good technical vision, communication, and persuasive abilities. Able to effectively communicate technical concepts in English. Have influential works published in related international conferences or mainstream journals such as machine learning, artificial intelligence, and multimedia processing.\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\n\nIn the spirit of reconciliation, TikTok acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.",
        "skills": [
            "Algorithm Design",
            "Algorithms",
            "Artificial Intelligence (AI)",
            "Communication",
            "Computer Science",
            "Computer Vision",
            "Digital Signal Processing",
            "Natural Language Processing (NLP)",
            "Pattern Recognition",
            "Signal Processing"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087817905",
        "reposted": false,
        "posted_time": "2024-12-03 12:27:55",
        "expire_time": "2025-01-02 12:27:55",
        "apply_url": "https://lifeattiktok.com/search/7343406062966524211?spread=5MWH5CQ"
    },
    {
        "title": "Software Developer",
        "company": "Wolters Kluwer",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Information Services"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 48,
        "workplace_type": "On-site",
        "description": "Education (Required):\n\nBachelor's Degree in related field, and relevant experience working within product software engineering.\n\nExperience:\n\nMinimum 1+ years relevant experience working within product software engineering.Software Development: Assist in developing and maintaining software applications under the guidance of senior team members.Testing Support: Assist in writing and executing unit tests to verify the functionality and correctness of software components.Bug Tracking: Help identify, log, and track software defects (bugs) through bug tracking systems.Code Implementation: Write code following coding standards and best practices provided by the team.Collaboration: Work collaboratively with team members and contribute to team discussions and meetings.Version Control Usage: Utilize version control systems to manage code changes and participate in code reviews.Debugging Assistance: Aid in debugging and troubleshooting software issues to assist senior team members in resolving problems.Requirements Understanding: Gain an understanding of project requirements and specifications.Quality Assurance: Participate in testing and quality assurance activities to ensure the reliability and quality of software.Learning and Skill Development: Continuously learn and improve coding skills, programming languages, and software development tools.\n\n\nOur Values \n\nWolters Kluwer continuously strives for an inclusive company culture in which we attract, develop, and retain high-performing, productive, engaged, and diverse talent to deliver on our strategy. As a global company, having a diverse workforce from different backgrounds, nationalities, races, genders, gender identities, ages, sexual orientations, physical disabilities, religions, expertise, and talents is of the utmost importance.\n\nWe pride ourselves on our culture, which promotes inclusion, accessibility and flexible working arrangements.\n\nCulture And Benefits\n\nWe care for our people and a part of that we offer:Flexible Working Arrangement – promoting work life balanceLearning and Development opportunitiesAccess to health and wellness programsInsurance OptionsParental leave benefits that exceed legislative requirementsThe opportunity to work within a global organization with experienced leaders\n\n\nYou can learn more about what we do by visiting our:\n\nWebsite : https://wolterskluwer.com.au/ \n\nYouTube link: https://youtu.be/5Vd08LQGBDQ?si=67-XKyvInCUoBahU/.\n\n",
        "skills": [
            "Bug Tracking",
            "Coding Standards",
            "HTML",
            "Programming",
            "Quality Assurance",
            "Reliability",
            "Software Development",
            "Tracking Systems",
            "Troubleshooting",
            "Version Control"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090211120",
        "reposted": false,
        "posted_time": "2024-12-03 09:09:43",
        "expire_time": "2025-01-02 09:09:43",
        "apply_url": "https://wk.wd3.myworkdayjobs.com/External/job/Software-Developer_R0045119?source=LinkedIn_Posting"
    },
    {
        "title": "Data Engineer",
        "company": "Roy Morgan",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Data Infrastructure and Analytics",
            "Software Development",
            "Technology, Information and Media"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology",
            "Research"
        ],
        "applies": 5,
        "workplace_type": "On-site",
        "description": "About Roy Morgan \n Roy Morgan is Australia's most reputable and longest established market research company, with an unparalleled reputation for reliable, accurate, meaningful, revealing market research. At the forefront of data and research innovation since 1941, today Roy Morgan continues to provide accurate and independent information insights to leading Australian and international companies and governments, as well as partnering with these same companies on bespoke data applications and technology development.\n \n \n About The Role \n The Technology department is responsible for positioning Roy Morgan as an efficient and innovative Research Company that employs best in breed technologies and methodologies to generate powerful insights for its customers. \n \n With this newly created role, we are seeking a Data Engineer to join the Information Technology team with a laser focus on R&D, mapping and implementation of a wider Data Lake/Warehouse strategy, with a strong emphasis on AWS technologies and a driving force with our transformation journey. This is a unique opportunity to assist in developing new ways of working with our world-renowned data sets. \n \n Reporting to the Head of Information Technology, the Data Engineer will initially focus on helping us with R&D on transforming older data stores into high performing data engines, data engine selection, specifically for wide columnar storage and processing engines, fast query performance etc and continuous improvement on data sets, their storage and transformation. The initial work will involve data modelling and testing in several technology stacks/engines, with a focus on building real time analysis queries to upgrade our client facing API backends. Moving beyond, you will be an integral part of helping the company modernise our Data Lake/Warehouse and all associated data management and pipelines, including being a part of the team that develops, implements and maintains the company's Data Lake/Warehouse strategy.\n \n The Data Engineer will work closely with Data Scientists in building analytics models, automating internal processes and finding new and better ways to warehouse and process data to help improve our products and business decisions. The successful candidate will collaborate with product managers, fellow engineers, and other stakeholders to deliver top-notch data-driven solutions for our customers.\n \n \n About You\n Ideally, your skills and experience should include:Bachelor's degree in Information Technology or Data SciencePrevious experience in Data Engineering or similar role, preferably within \"big data\" and/or the Market Research industryStrong background in data pipeline design, ETL processes, and data modellingStrong practical programming skills in R/Python, SQLDeep understanding of Devops principles, with relation to Data EngineeringProficiency in AWS Services including Redshift, Keyspaces, EMR, Lake Formation, Glue jobs, S3, Lambdas, Fargate etcStrong analytical, problem-solving, conceptual and research skillsPractical experience in applying AI and machine learning for real-world solutionsKnowledge of data management and visualization techniquesProven ability to work simultaneously across a variety of different projects and initiatives, while working autonomously, as part of a team and collaborativelyWell-developed communication skills with the ability to convey complex concepts to technical and non-technical stakeholdersAchievement oriented with proven experience of being a part of a cross skilled, motivated and cohesive team Our Offer to You \n We believe in investing in our people and when you join us, you can expect:Vibrant work cultureCompetitive salary packageCompany social events, including Friday night activitiesCompany EAP serviceBenefits including entertainment events, annual flu vaccine, discounted MYKI passes, and corporate discount for health insurance\n \n Roy Morgan values diversity and is committed to building an inclusive workplace culture that reflects our community. We encourage diversity and recognise the enrichment diversity brings to our business and people - whether its diversity of skill, experience and/or background. We welcome applications from diverse backgrounds and community groups including Aboriginal and Torres Strait Islander peoples.\n \n This is a fantastic opportunity to join the Technology team at a time of transformational change and if it sounds like your next opportunity, then apply now!\n",
        "skills": [
            "Amazon Redshift",
            "Analytical Skills",
            "Communication",
            "Data Analytics",
            "Data Engineering",
            "Data Modeling",
            "Data Pipelines",
            "Data Science",
            "Extract, Transform, Load (ETL)",
            "Problem Solving"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088582876",
        "reposted": false,
        "posted_time": "2024-12-03 23:26:18",
        "expire_time": "2025-01-02 23:25:39",
        "apply_url": "https://www.aplitrak.com/?adid=ZWR3YXJkLmFuZy40NjM1MS4xNTUwQHJveW1vcmdhbmF1LmFwbGl0cmFrLmNvbQ"
    },
    {
        "title": "Data Processing Software Engineer ? SKA-Low Telescope",
        "company": "Workforce Australia for Individuals",
        "location": "Perth, Western Australia, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Government Administration"
        ],
        "job_functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 0,
        "workplace_type": "On-site",
        "description": "Acknowledgement of Country \n\nCSIRO acknowledges the Traditional Owners of the land, sea and waters, of the area that we live and work on across Australia. We acknowledge their continuing connection to their culture and pay our respects to their Elders past and present. View our vision towards reconciliation\n\nChild safety \n\nCSIRO is committed to the safety and wellbeing of all children and young people involved in our activities and programs. View our Child Safe Policy .\n\nThe opportunity \n\nThe SKA Observatory (SKAO) is a next-generation radio astronomy facility that will revolutionise our understanding of the Universe and the laws of fundamental physics. Enabled by cutting-edge technology, it promises to have a major impact on society, in science and beyond.\n\nIn Australia, the SKAO is collaborating\n\nClick here to view more detail / apply for Data Processing Software Engineer ? SKA-Low Telescope",
        "skills": [
            ".NET Framework",
            "ASP.NET",
            "C++",
            "Cascading Style Sheets (CSS)",
            "HTML",
            "Object-Oriented Programming (OOP)",
            "Programming",
            "Python (Programming Language)",
            "Software Development",
            "Telescope"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087645465",
        "reposted": false,
        "posted_time": "2024-12-03 02:37:32",
        "expire_time": "2025-01-02 02:37:31",
        "apply_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2335964135"
    },
    {
        "title": "Data Engineer",
        "company": "Capgemini",
        "location": "Sydney, New South Wales, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "IT Services and IT Consulting",
            "Business Consulting and Services"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 83,
        "workplace_type": "Hybrid",
        "description": "Come and join a thriving company and become part of a diverse global collective of free-thinkers, entrepreneurs and industry experts who are all driven to use technology to reimagine what’s possible. Capgemini. Get the future you want.\n \nThis role could be in Sydney, Melbourne, Canberra, Brisbane, or Adelaide. \n \nFor more about why Capgemini https://www.capgemini.com/au-en/careers/why-join-capgemini/\n \n Let’s talk about the role and responsibilities:\n  Collaborate with business analysts and end-users to identify requirements and develop technical specifications for software applications Design, develop, and maintain software applications using one or more programming languages and development frameworks, such as Java, Python, .NET wtc. Perform unit testing and integration testing to ensure software quality and reliability Debug and troubleshoot software issues in a timely and efficient manner Write and maintain technical documentation, including user manuals and system documentation Collaborate with development teams to integrate software applications with other systems and platforms Participate in code reviews and provide constructive feedback to improve code quality Stay up-to-date with emerging technologies and programming languages to improve software development processes and outcomes Provide technical support to end-users to resolve software issues Collaborate with other IT teams, including infrastructure, security, and database administrators, to ensure smooth software application delivery and maintenance \n \n Let's talk about the team:\n \n Capgemini Financial Services is a Global Strategic Business Unit that provides information technology and consultancy services to the Banking, Capital Markets and Insurance industries. Capgemini FS brings you leading insights & deep industry experience to drive the future of Financial Services. Our customers count on us for the very latest in innovative service offerings & next generation global delivery.\n \n \n Let’s talk about your capability and experience:\n  Bachelor's degree in Computer Science, Information Technology, or related field 3+ years of experience in software development, preferably as an analyst programmer in Financial Services (Banking preferred) industry Proficiency in one or more programming languages and development frameworks, such as Java, Python, .NET etc. Experience in developing and maintaining software applications using Agile methodologies Knowledge of software development best practices, including unit testing, code reviews, and version control Strong analytical and problem-solving skills Excellent verbal and written communication skills Demonstrated ability to work collaboratively with cross-functional teams Ability to prioritize and manage multiple projects simultaneously Strong attention to detail and accuracy \n \n About Capgemini\n \nAt Capgemini, we are more than just a business, we are a diverse global collective of strategic and technological experts who are passionate about finding ways technology can help our clients, our people and our communities get the future they want.\n \nOur people are the key to making this vision a reality, which is why we have been recognised by the Australian Workplace Equality Index as LGTBQ+ ‘Employer of the Year’ and ‘Inclusion of Trans and Gender Diverse Employees’ for the past two years. We believe in creating a safe, flexible, and inclusive culture where everyone can bring their authentic selves to work, contributing to our inclusive culture and truly belong, and our staff-led community groups are a testament to this commitment. We are committed to being active allies for everyone. \nWe believe by combining the power of the latest technology with our human energy, we can drive sustainable thinking into our operations and the work we do with clients. Its why we are committing to being carbon neutral for our own operations no later than 2025 and across our supply chain by 2030 and committed to becoming a net zero business by 2040. \n \nEmpower yourself with the knowledge and skills you need to succeed with our access to premier learning platforms, sought-after certifications and boundless development opportunities. You’ll be encouraged to gain at least 40 hours of training each year. \n \nFor over 50 years our values and ethics have been at heart of our identity. From our approach to ethics to the way we interact with one another, honesty, boldness, trust, freedom, team spirit, modesty, and fun guide and inspire all we do and have led to us being recognised as one of the World’s Most Ethical Companies by the Ethisphere Institute 12 years in a row. \n \nOur Commitment to Diversity & Inclusion\nDon’t meet every single requirement for this role? Studies have shown women and people from diverse minority backgrounds are less likely to apply to jobs unless they meet every single requirement. At Capgemini, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role but your experience doesn’t align perfectly, we encourage you to apply and tell us what you can bring to the role.\nWe understand for some people, a standard hiring processes can come with challenges. If you are living with a disability, are gender diverse or neurodivergent and we can provide support with access requirements or by making an adjustment to our hiring process, please contact us at talentacquisitionaunz@capgemini.com\n\nInformation Security and Compliance\nCapgemini Australia has developed and manages, process orientated Management Systems compliant to the requirements of ISO9001, ISO27001 and ISO14001. We are committed to delivering secure solutions and services through state-of-the-art processes and continual improvement frameworks in line with industry best practices as well as contractual, statutory, and regulatory requirements.\n\n",
        "skills": [
            "Communication",
            "Computer Science",
            "Data Engineering",
            "Data Science",
            "Extract, Transform, Load (ETL)",
            "IT Documentation",
            "Problem Solving",
            "Technical Documentation",
            "Technical Specs",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4071484736",
        "reposted": true,
        "posted_time": "2024-12-03 10:16:29",
        "expire_time": "2025-01-10 11:31:13",
        "apply_url": "https://www.capgemini.com/jobs/5FU7GZMBZbg7WoMAl66q/Data-Engineer"
    },
    {
        "title": "Data Engineer",
        "company": "Xero",
        "location": "Melbourne, Victoria, Australia",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 29,
        "workplace_type": "Hybrid",
        "description": "\n\n\nXero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive. \n\n At Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place. \n\nHow you’ll make an impact\n\nAs a data engineer in the Marketing Data Science, Analytics & Insights team, you will be responsible for engineering large and complex data sets, as well as build robust, reusable and optimized data pipelines. You will have broad technical skills of developing and implementing data pipelines as well as data infrastructure to support the implementation of data transformation for analytics, business intelligence, machine learning models and other data projects. \n\nWhat you’ll doCreate integration between Xero’s Kafka infrastructure, Customer Data platform and other OLAP systemsDeploy data pipelines following DevOps principles and incorporating automated code & data testing.Demonstrates a focus on continual self improvement, across both the technical and business aspects of delivering high quality data enrichment solutionsProvide support to data quality and data validation through analysis of data and assisting in understanding the meaning of dataHelp drive continuous improvements to data quality procedures and a consistent approach to how data quality is measured, monitored and reported.Work on incident management, service requests, enhancements/changes and audits \n\nWhat you’ll bring with youStrong data and technical background demonstrating innovation, initiative and a passion for dataConfidence in collecting, collating and interpreting business requirements in order to produce quality outcomesGood time management with the ability to multitask, prioritize and deliver to scheduleHighly motivated and proactive nature, constantly looking at methods for improvementSolution focused and has strong attention to detailExperience working with Business Owners and different stakeholders to gather data requirements and provide solutionsCI/CD tools like Teamcity, GitHub Actions Jenkins, Harness or Circle.cInfrastructure as code utilities like Terraform, Cloudformation.Docker and Kubernetes.Good knowledge of SQL, Snowflake, dbt, Python, AWS, AWS Serverless (Lambda Functions), SQS, -SNS, S3, Glue,Clear and concise oral & written communication including technical documentationExperienced in orchestration tools (such as Apache Airflow, Prefect)Proficient in roll out and maintenance of cloud infrastructureKnowledge of data requirements for ML / AI use cases beneficialCDP implementation experience is plus \n\n Why Xero?  \n Offering very generous paid leave to use however you’d like (plus statutory holidays!), dedicated paid leave to care for your physical and mental wellbeing as well as an Employee Assistance Program to access mental health care for you and your family, health insurance, life insurance, and income protection, wellbeing and sports programmes, employee resource groups, 26 weeks of paid parental leave for primary caregivers, an Employee Share Plan, beautiful offices, flexible working, career development, and many other benefits that reflect our human value, you’ll do the best work of your life at Xero.",
        "skills": [
            "Apache Kafka",
            "Attention to Detail",
            "Collating",
            "Communication",
            "Data Engineering",
            "Data Pipelines",
            "Data Science",
            "Self Help",
            "Skilled Multi-tasker",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210003",
        "reposted": false,
        "posted_time": "2024-12-03 08:39:34",
        "expire_time": "2025-01-02 08:39:34",
        "apply_url": "https://jobs.lever.co/xero/9911bc74-83bc-4fbf-bab8-e4556e0ef271/apply?source=LinkedIn"
    },
    {
        "title": "Senior Analytics Engineer",
        "company": "Linktree",
        "location": "Greater Melbourne Area",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "industries": [
            "Software Development"
        ],
        "job_functions": [
            "Information Technology"
        ],
        "applies": 18,
        "workplace_type": "Remote",
        "description": "The Role\n\nAs a Senior Analytics Engineer on the Data Platform team, you will play a critical role in building the architecture and tools that power our data analytics and reporting functions. Your expertise in data engineering and analytics will create robust data models, develop advanced analytics solutions, and deliver insights that drive business strategy. Your role will be crucial in influencing the direction of our data platform and ensuring its alignment with the company’s strategic goals.\n\nWhat You'll Own\n\nCore Data Models: Design, develop, and maintain essential data models that will be leveraged across various business functions. Your work will ensure consistency and accuracy in the way data is represented and utilised throughout the company.Standards and Best Practices: Define and implement data engineering standards and best practices. Provide guidance and support to other teams to ensure adherence to these standards, promoting high-quality data processes and governance.Cross-Functional Collaboration: Partner with data scientists, analysts, and engineering teams to understand their requirements and deliver data solutions that align with their needs. Facilitate effective communication and knowledge sharing across teams.Strategic Influence: Play a key role in shaping the future direction of the data platform. Provide strategic insights and recommendations to enhance the platform’s capabilities and its impact on business decision-making.\n\nWho We’re Looking For\n\nExperience: 2+ years of experience in analytics engineering, data engineering or a related role.Technical Skills: Proficiency in SQL and experience with data warehousing solutions (e.g., Snowflake). Knowledge of data engineering tools and frameworks (e.g., Apache Airflow, dbt) and programming languages (e.g., Python).Analytics Tools: Experience with business intelligence tools (e.g., Looker) and data visualisation best practices.Communication: Excellent verbal and written communication skills, with the ability to convey technical concepts to non-technical stakeholders.Experience operating at scale: You have worked on data systems that power a product that serves hundreds of millions of active users.\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "Analytical Skills",
            "Analytics",
            "Communication",
            "Core Data",
            "Data Analytics",
            "Data Engineering",
            "Data Models",
            "Knowledge Sharing",
            "Strategic Influence",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088707524",
        "reposted": false,
        "posted_time": "2024-12-03 12:52:54",
        "expire_time": "2025-01-02 12:52:54",
        "apply_url": "https://jobs.gem.com/linktree/8c7b8524-cc61-4e9f-b383-bc0d4b77557d?src=LinkedIn+Paid"
    }
]