[
    {
        "title": "Junior Software Engineer Trainee - Software Development Internship Program",
        "company": "Refonte Learning",
        "location": "APJ",
        "empoyment type": "Internship",
        "seniority level": "Internship",
        "industries": [
            "E-Learning Providers"
        ],
        "Job Functions": [
            "Education",
            "Training"
        ],
        "applies": 112,
        "workplace_type": "Remote",
        "description": "Program Title : Software Engineering Mastery Training and Internship (M/F)Location : RemoteProgram Type : Training with Practical InternshipDuration : 3 monthsCompensation : UnpaidLearn more : https://www.refontelearning.com/\n\nJob Description:The Junior Software Engineer Trainee position is part of our intensive Software Development Internship Program. This program combines comprehensive training in software engineering fundamentals with practical, real-world project experience. You will work alongside experienced developers, participate in agile team projects, and gain exposure to a range of programming languages and frameworks.\nKey Responsibilities:Engage in hands-on coding sessions and implement software features under mentor guidance.Collaborate with cross-functional teams to test, debug, and refine code.Document technical processes and maintain high-quality code following industry standards.\nQualifications:Currently enrolled in a Computer Science or Software Engineering program.Basic knowledge of languages such as Java, Python, or JavaScript.Eager to learn, team-oriented, and passionate about software engineering.\nSkills Developed:Proficiency in object-oriented programming, agile methodologies, and software version control.Experience using collaboration and project management tools (e.g., Git, JIRA).",
        "skills": [
            "Agile Methodologies",
            "Industry standards",
            "Java",
            "JavaScript",
            "Object-Oriented Programming (OOP)",
            "Programming",
            "Python (Programming Language)",
            "React.js",
            "Software Configuration Management",
            "Software Implementation",
            "Version Control"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088696105",
        "if reposted": false,
        "posted_time": "2024-12-01 11:15:39",
        "expire_time": "2024-12-31 11:15:39"
    },
    {
        "title": "Staff Software Engineer - League of Legends, Game Modes",
        "company": "Riot Games",
        "location": "Sydney, New South Wales, Australia",
        "empoyment type": "Full-time",
        "seniority level": "N/A",
        "industries": [
            "Computer Games",
            "Software Development",
            "Technology, Information and Internet"
        ],
        "Job Functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": 1,
        "workplace_type": "On-site",
        "description": "Riot Sydney is looking for an experienced Staff Software Engineer to join the Sydney-based League, Modes team. Internal Job Title: Software Engineer III.\n\nAs Software Engineers at Riot, we bring deep knowledge of specific technical areas and also value the opportunity to work in a variety of broader domains. We work with both new and current technology, creating innovative solutions to overcome high-volume obstacles and to deliver player value.\n\nAs a Staff Software Engineer on the Modes team under League’s Gameplay initiative, you will bring deep gameplay technical knowledge and skills to the game play domains in League of Legends. You will increase sustainability for current rotating modes and develop tools and workflows that make it easier for designers and artists to create awesome experiences for our players. You will work as part of a diverse team consisting of artists, designers, engineers, producers, and QA. You will also be leading the technical decision-making processes on the team, and you will be accountable for all technical decisions as well as the quality of the technology supported by the team. You will report to the Team Engineering Manager.\n\nResponsibilities\n\nLead, identify and build improvements to allow League of Legends to more sustainably maintain rotating game modes.Understand the backend services powering League of Legends and lead technical decisions to best use them.Lead the automation of aspects of creating and running existing rotating game modes.Lead, design and develop features and UI in the League of Legends game engine using C++.Collaborate with cross-disciplinary teams in Sydney and the US (including Game Designers, Artists, Animators, Quality, and Producers) to shape player experiencesGive feedback to designers and artists on the technical tradeoffs of their designs and ideasGive feedback to product leaders about product direction and player affinityCollaborate with and mentor engineering teammates\n\nRequired Qualifications\n\n8+ yrs of collective professional experience building applications or games in a client-server architecture.Bachelor’s degree in Computer Science or comparable field or equivalent experienceExperience working closely with non-engineering collaborators to deliver valueExperience building gamesExperience working with complex code basesProfessional experience using C++\n\nFor this role, you'll succeed through craft expertise and a collaborative spirit that prioritises the delight of players. We will look at your past studies and experience, but for this role, we also look for dedicated people with a personal relationship with games. If you embody player empathy and care about players' experiences, this is the role for you!\n\nWorking closely with Riot teams globally, Riot Sydney is a powerhouse of talent, and experts in global development. Our team works on VALORANT, League of Legends and Teamfight Tactics, alongside exciting R&D and Tech projects.\n\nIf you believe that the Player Experience comes first, we want to hear from you. Our players are a diverse group from different backgrounds, and we want to see that reflected in the people who make our games, all qualified applicants will be considered for employment\n\nOur Perks\n\nAt Riot we strongly believe in work/life balance, and we encourage that with our open paid time off policy, paid parental leave (for both primary and secondary carers) and flexible work schedules to fit your lifestyle.\n\nWe also believe that work should be fun, we have a LAN gaming room, the latest consoles, a play fund so you can broaden and deepen your knowledge of our players and community, and all the snacks you would ever need to power through your day (even healthy snacks!).\n\nAnd that’s not all we offer, there’s also:\n\nMedical, Dental and Vision StipendWellbeing ReimbursementWe will double down on your donations of time and money to non-profitsEmployee Assistance ProgramLearning and Development opportunities\n\nRiot Games fosters a player and workplace experience that values teamwork embodied by the Summoner's Code and Community Code. Our culture embraces differences as a strength, and our values are the guiding principles for how we approach work. We are committed to putting diversity and inclusion (D&I) at the center of everything we do, and promoting a fair and collaborative culture where Rioters treat one another with dignity and respect. We encourage you to read more about our value of thriving together and our ongoing work to build the most inclusive company in Gaming.",
        "skills": [
            "Back-End Web Development",
            "C++",
            "Cascading Style Sheets (CSS)",
            "Computer Science",
            "Distributed Systems",
            "Game Development",
            "Programming",
            "Server Architecture",
            "Software Design",
            "Software Development"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4086305348",
        "if reposted": false,
        "posted_time": "2024-12-01 08:15:17",
        "expire_time": "2024-12-20 20:15:22"
    },
    {
        "title": "Cyber Security and Systems Specialist",
        "company": "Public Sector People",
        "location": "Sydney, New South Wales, Australia",
        "empoyment type": "Temporary",
        "seniority level": "Entry level",
        "industries": [
            "Architecture and Planning",
            "Government Administration",
            "Government Relations Services"
        ],
        "Job Functions": [
            "Engineering",
            "Information Technology"
        ],
        "applies": "N/A",
        "workplace_type": "On-site",
        "description": "Public Sector People (PSP) are currently looking to speak to a Cyber Security Specialist who would be interested in an initial 6-month contract.\n\n6-month contract (minimum) Flexible work arrangement, Western Sydney Location Highly competitive daily rate Must have experience in SIEM, Vuln MgMt, Pen Test and End Point. \n\nThis role is a 6-month contract to assist with a HUGE Digital Transformation project (currently half way through a 4 year project) specifically with a Cyber Security focus.\n\nYou will be working closely with the Security Project Manager to run and drive the current projects and liaise with stakeholders, experience on similar projects essential!\n\nKey Responsibilities\n\nAssist with the ongoing development and implementation of security operations practices and framework. Detect threats, respond to and mitigate cyber events both reactively and proactively. Lead the ongoing ingestion, processing and monitoring of security event data. Participate and encourage cyber security awareness campaigns across the organisation. Participate and lead projects and also responsible for the BAU function of the role. Create and deliver timely and accurate reporting on security scorecards and reports. \n\nRequirements Include:\n\nThe following qualifications and/or experience are required for the position:\n\nMust have significant experience in the implementation of cybersecurity frameworks, governance and reporting implantations. A certification in Network and Security. A certification in ITIL will be highly regarded. Experience in SIEM, Vuln MgMt, Pen Test and End Point. Must have strong and effective stakeholder engagement skills including communication and listening skills. Able to prioritise tasks and work autonomously on both project and BAU focused tasks. \n\nPlease note: If successful in this role, you will be required to have an up-to-date National Police Check (can be completed throughout the selection process).\n\nAPPLY TODAY to be considered for an interview or email dcorkill@publicsectorpeople.com.au if you have any questions.",
        "skills": [
            "Communication",
            "Cybersecurity",
            "Ethical Hacking",
            "Information Security",
            "Information Technology",
            "Pen",
            "Security Awareness",
            "Security Information and Event Management (SIEM)",
            "Stakeholder Engagement",
            "Vulnerability Assessment"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088690772",
        "if reposted": false,
        "posted_time": "2024-12-01 11:04:41",
        "expire_time": "2024-12-31 11:04:41"
    }
]