[
  {
    "title": "Data Centre Chief Engineer, Data Centre Engineering Operations",
    "company": "Amazon Web Services (AWS)",
    "location": "Melbourne, Victoria, Australia",
    "company_id": "2382910",
    "company_url": "https://www.linkedin.com/company/amazon-web-services",
    "employment_type": "Full-time",
    "seniority_level": "",
    "industries": ["IT Services and IT Consulting"],
    "job_functions": ["Information Technology", "Consulting", "Engineering"],
    "applies": 33,
    "workplace_type": "N/A",
    "description": "Description\n\nAmazon Web Services (AWS) is looking for a highly motivated Chief Engineer to join our Data Centre Engineering Operations (DCEO) Team. This committed group works to maintain the critical physical infrastructure that supports AWS. Specifically, this team works to ensure that the data centre's Mechanical/Electrical/Plumbing (MEP) operates at 100% availability, while maintaining first-class customer service to the teams and groups within the data centres. The Data Centre Chief Engineer (CE) is responsible for ensuring that all electrical, mechanical, and fire/life safety equipment within the data centre is operating at peak efficiency. This involves planned preventative maintenance of equipment, daily corrective work, and emergency response. The CE serves as an expert technical resource interacting with onsite Engineering Operations Technicians (EOT) and any third party vendors. They are expected to be a singular focal point for all facility operations within a given data centre and to support AWS.\n\nThe CE manages small-to-medium projects from conception to completion. As well as own cluster-wide technical programs that monitor and maintain the effectiveness of DCEO equipment and staff. These projects and programs involve large amounts of independent work as well as collaboration with external support groups including engineering, automation, processing, and finance in both local and global settings. The CE will be tasked with creating and delivering on key milestones, obtaining and tracking quotes for all necessary costs, and documenting project results for future implementation at other facilities. The goals of such projects are for the CE to drive innovation and resiliency while reducing operational costs in the facilities.\n\nThe CE directs, trains and supports EOT’s in their role of providing hands-on electrical and mechanical equipment troubleshooting and operations. Implementation and execution of site/equipment-specific training exercises is also expected. This equipment includes, but is not limited to, stand-by diesel generators, switchgear, UPS’s, PDU’s, DAHU’s, chillers, chemical treatment systems, pumps, motors, VFD’s, and building automation systems.\n\nKey job responsibilities\n\n Cover gaps in a 24 x 7 rotating shift roster. Responsible for the on-site management of contractors, sub-contractors and vendors, ensuring that all work performed, is in accordance with established practices, procedures & local legislation. Establish performance benchmarks, conduct analyses & prepare reports on all aspects of the critical facility infrastructure operations & maintenance. Generate Change Management requests & Incident Management tickets for events that DCEO are responsible to manage. Work with DC managers (IT) and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability, sustainability and efficiency. Establish documentation relevant to business & facility operations. Responsible for the installation of the racks and the provision of power/cooling within it's constraints. Review the management of both routine maintenance and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. Assist in the design, implementation, commissioning and build out of new facilities. Drive & implement projects to increase current facility capacity, efficiency, sustainability & reliability. Management of the Facility assets and the provision of infrastructure & inventory asset management. Attend and participate in regular Construction & Operational Meetings as required. Familiar with Work Order compliance to ensure all contractual SLA’s are achieved. Interface with Infra Ops management for day to day operational requirements. Assist in recruiting efforts. Assist in the the resolution of any infrastructure engineering or services issue. Delivery of exceptional customer service and satisfaction. Day to day supervision of a team of Engineering Operation technicians.\n\nHold or be able to attain an Australian Government Security Vetting Agency clearance (see https://www.agsva.gov.au/applicants/eligibility-and-suitability)\n\nAbout The Team\n\nAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centres and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. We are experiencing rapid growth, therefore your onboarding will be dynamic in nature, where you will gain diverse experience working in new and established AWS data centre's. These future Amazonians will rotate through various AWS locations to complete training as part of their onboarding to prepare for deployment in a data centre region. This training will be completed over a duration of 6-12 months. Once training is completed, individuals will be relocated to the permanent location.\n\nAbout AWS\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Ability to participate and manage a 24 x 7 rotating shift roster with team leadership experience. 4+ years of relevant work experience in maintaining a DC or Critical Space facility, or other critical environment with Technical (Military/Trade School) training Strong verbal and written communication skills.\n\nPreferred Qualifications\n\n Further education in Electrical Engineering, Mechanical Engineering or relevant discipline.\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\n\nCompany - Amazon Corporate Services Pty Ltd\n\nJob ID: A2737498",
    "skills": [
      "Communication",
      "Data Center Infrastructure",
      "Documentation",
      "Focal Point",
      "From Conception to Completion",
      "Incident Management",
      "Operational Requirements",
      "Racks",
      "Reliability",
      "Troubleshooting"
    ],
    "job_url": "https://www.linkedin.com/jobs/view/4005287772",
    "reposted": true,
    "posted_time": "2024-12-04 10:49:44",
    "expire_time": "2025-02-16 03:22:42",
    "apply_url": "https://www.amazon.jobs/jobs/2737498/data-centre-chief-engineer-data-centre-engineering-operations?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid"
  },
  {
    "title": "Data Operations Engineer (AWS) ",
    "company": "Robert Half",
    "location": "Greater Sydney Area",
    "company_id": "1681",
    "company_url": "https://www.linkedin.com/company/robert-half-international",
    "employment_type": "Full-time",
    "seniority_level": "Mid-Senior level",
    "industries": ["Financial Services"],
    "job_functions": ["Information Technology"],
    "applies": 4,
    "workplace_type": "Hybrid",
    "description": "THE COMPANY: \nThis company is a well-known, prestigious, and high-profile Financial Services firm who employ 1200+ staff.\nThey attract employees who adopt an ‘effort vs reward mindset’ and thrive undertaking meaningful, impactful + visible work, whilst still operating in collaborative environment that encourages ongoing learning, knowledge sharing + proactive innovation.\nHybrid working available.\n\nROLE & RESPONSIBILITIES:\nData Operations Engineer role responsible for ensuring operational performance, support, troubleshooting, and ongoing enhancement of this customer-facing data & analytics platform hosted on-prem and in AWS.\nThis is an operationally focused role involving Incident / Problem / Change Management.\nHybrid working (3 days in office, 2 days WFH).\nDuties include:Implement, maintain, automate, optimize, and operate HA and scalable datasets, pipelines & analytics on AWS and on-prem platforms.Operational support including Incident / Problem / Change Management; Root Cause Analysis; BAU maintenance; and monitoring/alerts etc.Work with Data Engineering & DevOps teams to support data ingestion, processing & analytics workflows.Configure & administer streamlined data access.Platform monitoring & capacity planning – including performance, capacity, security, data quality, future needs etc.Build & deploy services using Terraform.Apply data governance & security standards to the data platform.Non-functional testing.Project involvement.Involvement in paid on-call support and after-hours roster once every 3 weeks.\n\nREQUIRED BACKGROUND / KNOWLEDGE / EXPERIENCE / PERSONAL QUALITIES \nSuitable for a Data Operations Engineer experienced with AWS data product + proven operational experience supporting, monitoring & improving critical HA platforms.\nIdeal for someone curious, who loves to learn, and has a genuine interest in the evolution of technology.\nThe following is required:Proven Data Operations Engineering background providing operational application/platform support inside in high availability / real time processing environments.AWS data pipeline & analytics experience (e.g. AWS DataZone, Lake Formation, Glue, Athena, MWAA, Redshift etc).IaC experience with Terraform is needed.Well-developed experience with Incident / Problem/ Change Management.Scripting skills – preferably Python or SQL.Demonstrate strong technical triage & troubleshooting skills and logical problem-solving abilities.Flexible and adaptable personality capable of decisively making decisions.Display curiosity and an eagerness/enthusiasm to learn.Enjoy taking ownership/accountability and be a collaborative team player.\n\nThis is a full time permanent role located in the Sydney CBD (hybrid working) and is offering $130,000 - $143,497 (plus super) + bonus potential. \n*Please note, full permanent Australian working rights (citizenship or PR) are required to be considered for this position and successful applicants will be contacted.",
    "skills": [
      "AWS Glue",
      "Amazon Athena",
      "Amazon Redshift",
      "Application Support",
      "Change Management",
      "Data Operations",
      "Incident Management",
      "Problem Management",
      "Python (Programming Language)",
      "Terraform"
    ],
    "job_url": "https://www.linkedin.com/jobs/view/4089411113",
    "reposted": false,
    "posted_time": "2024-12-04 07:01:32",
    "expire_time": "2025-01-03 07:01:31",
    "apply_url": "https://www.linkedin.com/job-apply/4089411113"
  }
]
