[
    {
        "title": "Software Engineer, Front End, Photos",
        "company": "Google",
        "location": "Sydney, New South Wales, Australia",
        "description": "At Google, we have a vision of empowerment and equitable opportunity for all Aboriginal and Torres Strait Islander peoples and commit to building reconciliation through Google’s technology, platforms and people and we welcome Indigenous applicants. Please see our Reconciliation Action Plan for more information.\n\nApplicants to this role must have work authorization in Australia as this role is not eligible for work visa sponsorship.\n\nMinimum qualifications:\n\nBachelor’s degree or equivalent practical experience.2 years of experience with software development in one or more programming languages (e.g., Java), or 1 year of experience with an advanced degree.2 years of experience with front-end and user interface development.Experience developing APIs and integrating third-party services.Experience with web development.\n\nPreferred qualifications:\n\nMaster's degree or PhD in Computer Science or related technical fields.Experience developing accessible technologies.\n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.\n\nResponsibilities\n\nDesign, develop, test, deploy, maintain, and enhance software products.Manage individual project's priorities, deadlines, and deliverables.Build web applications using best practices. Work on client-server protocols.Identify technical problems with the requirements, and fix them, helping the team to course-correct when necessary.Utilize communication skills and collaborate with the wider team (e.g., Product Managers, UX designers, and Quality Assurance) to deliver the highest quality product.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
        "skills": [
            "Communication",
            "Computer Science",
            "Front-End Development",
            "Java",
            "Programming",
            "Programming Languages",
            "Software Development",
            "User Experience (UX)",
            "User Interface Design",
            "Web Development"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088723584",
        "posted_time": "2024-12-03 15:04:53"
    },
    {
        "title": "Data Platform Engineer",
        "company": "Macquarie Group",
        "location": "Sydney, New South Wales, Australia",
        "description": "Our Data Platform Engineering team is dedicated to developing and maintaining data product systems and processes that transform raw data into high-quality, consistent information for various downstream use cases. We operate entirely on cloud platforms, utilising both Google Cloud and AWS, and are committed to leveraging innovative approaches to automation.\n\nAt Macquarie, our advantage is bringing together diverse people and empowering them to shape all kinds of possibilities. We are a global financial services group operating in 34 markets and with 55 years of unbroken profitability. You’ll be part of a friendly and supportive team where everyone - no matter what role - contributes ideas and drives outcomes.\n\n What role will you play? \n\nAs a Data Platform Engineer, you will be responsible for building new automation and orchestration solutions while enhancing our existing data product applications. You will be involved in the design, development, testing, operations, and delivering incremental improvements in iterative cycles. You will bring an Agile mindset and a keen interest in software engineering across a range of technologies.\n\nWhat You Offer\n\nExperience with orchestration technologies to manage data product applications. Proficiency in observability and monitoring platforms such as Prometheus & Grafana, Sumo Logic, Splunk, or Dynatrace. Java or other programming experience, including the development of shared libraries for observability to provide standard logging, monitoring, and tracing. Familiarity with SQL, NoSQL, and event streaming platforms. \\Knowledge of Continuous Integration and Continuous Deployment (CI/CD) technologies.Expertise in cloud technologies such as AWS and/or GCP. Experience with Docker and/or Kubernetes containers. \n\nWe love hearing from anyone inspired to build a better future with us, if you're excited about the role or working at Macquarie we encourage you to apply.\n\nAbout Technology \n\nTechnology enables every aspect of our business, for our people, our customers and our communities. Bring your unique perspective and join a global team who is passionate about accelerating the digital enterprise, connecting people and data, building platforms and applications and designing tomorrow’s technology solutions.\n\nBenefits\n\nMacquarie employees can access a wide range of benefits which, depending on eligibility criteria, include:\n\nHybrid and flexible working arrangements One wellbeing leave day per year and up to five additional days leave based on length of serviceUp to 20 weeks paid parental leave as well as benefits to support you as you transition to life as a working parent Paid volunteer leave and donation matching Range of benefits to support your physical, psychological and financial wellbeing Access to a wide range of learning and development opportunities\n\n Our commitment to diversity, equity and inclusion \n\nWe are committed to providing a working environment that embraces diversity, equity, and inclusion. We encourage people from all backgrounds to apply for a role regardless of their identity, including gender, race, ethnicity, cultural identity, nationality, age, sexual orientation, gender identity, intersex status, marital or family status, neurodiversity, religion or belief, disabilities, or socio-economic background.\n\nIf you require adjustments to your working arrangements or the recruitment process, please let us know when applying.",
        "skills": [
            "C++",
            "Cloud Computing",
            "Continuous Integration (CI)",
            "Continuous Integration and Continuous Delivery (CI/CD)",
            "Docker Products",
            "Google Cloud Platform (GCP)",
            "Java",
            "Kubernetes",
            "Python (Programming Language)",
            "SQL"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087691453",
        "posted_time": "2024-12-03 07:05:34"
    },
    {
        "title": "Solutions Architect",
        "company": "Databricks",
        "location": "Brisbane, Queensland, Australia",
        "description": "FEQ126R53\n\nAt Databricks, our core principles are at the heart of everything we do; creating a culture of proactiveness and a customer-centric mindset guides us to create a unified platform that makes data science and analytics accessible to everyone. We aim to inspire our customers to make informed decisions that push their business forward. We provide a user-friendly and intuitive platform that makes it easy to turn insights into action and fosters a culture of creativity, experimentation, and continuous improvement. You will be an essential part of this mission, using your technical expertise to demonstrate how our Data Intelligence Platform can help customers solve their complex data challenges. You'll work with a collaborative, customer-focused team that values innovation and creativity, using your skills to create customized solutions to help our customers achieve their goals and guide their businesses forward. Join us in our quest to change how people work with data and make a better world!\n\nThe Impact You Will Have\n\nForm successful relationships with clients throughout your assigned territory, providing technical and business value to Databricks customers in collaboration with Account Executives.Operate as an expert in big data analytics to excite customers about Databricks. You will develop into a ‘champion’ and trusted advisor on multiple issues of architecture, design, and implementation to lead to the successful adoption of the Databricks Data Intelligence Platform.Scale best practices in your field and support customers by authoring reference architectures, how-tos, and demo applications, and help build the Databricks community in your region by leading workshops, seminars, and meet-ups.Grow your knowledge and expertise to the level of a technical and/or industry specialist.\n\nWhat We Look For\n\nEngage customers in technical sales, challenge their questions, guide clear outcomes, and communicate technical and value propositions.Develop customer relationships and build internal partnerships with account executives and teams.Prior experience with coding in a core programming language (i.e., Python, Java, Scala) and willingness to learn a base level of Spark.Proficient with Big Data Analytics technologies, including hands-on expertise with complex proofs-of-concept and public cloud platform(s). Experienced in use case discovery, scoping, and delivering complex solution architecture designs to multiple audiences requiring an ability to context switch in levels of technical depth.\n\nAbout Databricks\n\nDatabricks is the data and AI company. More than 10,000 organizations worldwide — including Comcast, Condé Nast, Grammarly, and over 50% of the Fortune 500 — rely on the Databricks Data Intelligence Platform to unify and democratize data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe and was founded by the original creators of Lakehouse, Apache Spark™, Delta Lake and MLflow. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.\n\nBenefits\n\nAt Databricks, we strive to provide comprehensive benefits and perks that meet the needs of all of our employees. For specific details on the benefits offered in your region, please visit https://www.mybenefitsnow.com/databricks.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.\n\nCompliance\n\nIf access to export-controlled technology or source code is required for performance of job duties, it is within Employer's discretion whether to apply for a U.S. government license for such positions, and Employer may decline to proceed with an applicant on this basis alone.",
        "skills": [
            "Architecture",
            "Client Relations",
            "Communication",
            "Data Analytics",
            "Data Architecture",
            "Java",
            "Programming Languages",
            "Scala",
            "Solution Architecture",
            "Workshops"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4053741830",
        "posted_time": "2024-12-03 10:21:17"
    },
    {
        "title": "Cloud Support Engineer (Analytics)",
        "company": "Amazon Web Services (AWS)",
        "location": "Sydney, New South Wales, Australia",
        "description": "Description\n\nAmazon Web Services (AWS) is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will act as the ‘Cloud Ambassador’ across all the cloud products, arming our customers with required tools & tactics to get the most out of their Product and Support investment.\n\nWould you like to use the latest cloud computing technologies? Do you have an interest in helping customers understand application architectures and integration approaches? Are you familiar with best practices for applications, servers and networks? Do you want to be part of a customer facing technology team helping to ensure the success of AWS as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies. Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs. Interact with leading engineers around the world. Partner with AWS teams to help reproduce and resolve customer issues. Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services. Drive customer communication during critical events. Drive projects that improve support-related processes and our customers’ technical support experience. Write tutorials, how-to videos, and other technical articles for the developer community. Work on critical, highly complex customer problems that may span multiple AWS services.\n\nA day in the life\n\n First and foremost this is a customer support role – in The Cloud. On a typical day, a Support Engineer will be primarily responsible for solving customer’s cases through a variety of customer contact channels which include telephone, email, and web/live chat. You will apply advanced troubleshooting techniques to provide tailored solutions for our customers and drive customer interactions by thoughtfully working with customers to dive deep into the root cause of an issue. Apart from working on a broad spectrum of technical issues, an AWS Support Engineer may also coach/mentor new hires, develop & present training, partner with development teams on complex issues or contact deflection initiatives, participate in new hiring, write tools/script to help the team, or work with leadership on process improvement and strategic initiatives. Career development: We promote advancement opportunities across the organization to help you meet your career goals. Training: We have training programs to help you develop the skills required to be successful in your role. We hire smart people who are keen to build a career with AWS, so we are more interested in the areas that you do know instead of those you haven’t been exposed to yet. Support engineers interested in travel have presented training or participated in focused summits across our sites or at specific AWS events. As we operate on a follow-the-sun model, with Premium Support sites located globally, working hours and days are based on customer demand and may include weekends (on a rotational basis). Hear from our people: https://youtu.be/GC3bWcFFZTo\n\nAbout The Team\n\nSales, Marketing and Global Services (SMGS)\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Auckland or Wellington Amazon offices.\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Exposure to streaming technologies (Kafka, Kinesis, Rabbit MQ). Log analysis and General Troubleshooting (tuning and optimisation, Search and Indexing Operations, mapping, monitoring) understanding on Elastic Stack (Elastic, Logstash, Beats, Kibana, Fluentd etc) and knowledge on Opensearch APIs. Experience in Business Analytics application, support, and troubleshooting concepts Experience with System Administration and troubleshooting with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server and associated technologies (Active Directory) Experience with Networking and troubleshooting (TCP/IP, DNS, OSI model, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related) Experience with Apache Flink, Apache Spark Bachelor’s degree in Information Science / Information Technology, Data Science, Computer Science, Engineering, Mathematics, Physics, or a related field OR equivalent experience in a technical position\n\nPreferred Qualifications\n\n Experience in a customer support environment Experience analyzing, troubleshooting, and providing solutions to technical issues Understanding of Cloud Computing concepts Experience scripting or developing in at least one of the following languages : Python, R, Ruby, GO, Java, .NET (C#), JavaScript Good understanding of distributed systems Exposure to Database Fundamentals and General Troubleshooting (tuning and optimization, deadlocks, keys, normalization) in any Relational Database Engines (MySQL, PostgreSQL, Oracle, SQLServer)\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844246",
        "skills": [
            "Analytics",
            "Apache Flink",
            "Business Analytics",
            "Curl",
            "Domain Name System (DNS)",
            "Local Area Network (LAN)",
            "OSI Model",
            "Ruby",
            "Scripting",
            "Traceroute"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210074",
        "posted_time": "2024-12-03 09:22:30"
    },
    {
        "title": "Software Engineering Manager, Site Reliability Engineering, FM Store",
        "company": "Google",
        "location": "Sydney, New South Wales, Australia",
        "description": "At Google, we have a vision of empowerment and equitable opportunity for all Aboriginal and Torres Strait Islander peoples and commit to building reconciliation through Google’s technology, platforms and people and we welcome Indigenous applicants. Please see our Reconciliation Action Plan for more information.Minimum qualifications:\n\nBachelor’s degree in Computer Science, a related field, or equivalent practical experience.8 years of experience with data structures or algorithms.5 years of experience with software development in one or more programming languages.3 years of experience managing people or teams, leading projects, and designing, analyzing, and troubleshooting distributed systems. \n\nPreferred qualifications:\n\nMaster's degree in Computer Science or Engineering.\n\nAbout The Job\n\nSite Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to users' needs and a fast rate of improvement. Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation.\n\nOn the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google, while using your expertise in coding, algorithms, complexity analysis and large-scale system design.\n\nSRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.\n\nTo learn more: check out our books on Site Reliability Engineering or read a career profile about why a Software Engineer chose to join SRE.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nResponsibilities\n\nLead a team of software and systems engineers, including iteration and task planning.Deliver on manager responsibilities and care for the team. Set team priorities and drive team Objectives and Key Results (OKR) execution with input from SRE leadership and cross-functional partners.Build and maintain strong partnerships with sibling team shards and cross-functional stakeholders.Establish technical credibility and influence technical direction and high quality delivery from the team.Participate in primary oncall rotation; cultivate technical curiousity and growth mindset, and a blameless postmortem culture within the team.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
        "skills": [
            "Algorithms",
            "Analytical Skills",
            "Computer Science",
            "Data Structures",
            "Negotiation",
            "Objectives and Key Results (OKRs)",
            "Programming Languages",
            "Software Development",
            "Team Management",
            "Technical Direction"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087445319",
        "posted_time": "2024-12-03 04:28:01"
    },
    {
        "title": "Data Analyst - Data Portfolio",
        "company": "ANZ",
        "location": "Melbourne, Victoria, Australia",
        "description": "About Us\n\nAt ANZ, we're applying new ways technology and data can be harnessed as we work towards a common goal: to improve the financial wellbeing and sustainability of our millions of customers.\n\nAbout The Role\n\nAs a Data Analyst within the Data Portfolio, you’ll play a key role in helping the CRR&A Data initiatives. You will collaborate closely with a team of Data Scientists, Data Engineers, and Data Analysts, as well as business teams within the CRR&A portfolio.\n\nBanking is changing and we’re changing with it, giving our people great opportunities to try new things, learn and grow. Whatever your role at ANZ, you’ll be building your future, while helping to build ours.\n\nRole Type: 6 month opportunity\n\nRole Location: Melbourne\n\nWork Hours: Full time\n\nWhat will your day look like?\n\nThis role will help the CRR&A Data team accelerate the closure of events in the backlog of our risk management system NFR Hub through a program of work designed to provide insights and improve event management processes.\n\nAs a member of the Retail Analytics CRR&A Data team, you bring advanced data analysis expertise and a passion for leveraging data to enhance our responses to regulatory requirements.\n\nAs a Data Analyst, your key accountabilities will include:\n\n Developing management dashboards and the supporting data pipelines that contribute to regulatory reporting.  Developing standard Python/SQL queries and procedures to assist with the process optimisation.  Automating new and existing procedures and reporting workflows using Python or other scripting languages.  Providing data initiative support and expertise to product teams in Aus Retail and business teams within the CRR&A portfolio.  Developing insights and progress reporting for stakeholders. \n\n\nWhat will you bring?\n\nTo grow and be successful in this role, you will ideally bring the following:\n\n Recent and extensive experience in a Data Analyst or Data Engineering role.  Extensive knowledge and experience with tools and techniques for analysis, data manipulation and presentation (e.g., Python, SQL, Tableau, QlikSense).  Analytical and inquisitive mindset to continuously improve the level of insight surfaced.  Strong ability to translate data insights into practical business recommendations.  Strong data visualisation skills.  Ability to effectively communicate to all stakeholders (technical and non-technical).  Data engineering tools (e.g., dbt, Spark, Airflow)  Experience with Big Data/Cloud platforms and technologies (Hadoop, Kubernetes)  Knowledge Management platforms and practices (GitHub, Confluence)  Degree qualifications in Data Science, Computer Science, Information Technology, Information Statistics, Applied Mathematics, or equivalent industry experience in data analysis, engineering, or related fields. \n\n\nYou’re not expected to have 100% of these skills. At ANZ a growth mindset is at the heart of our culture, so if you have most of these things in your toolbox, we’d love to hear from you.\n\nSo why join us?\n\nFrom the moment you join ANZ, you'll be doing meaningful work that will shape a world where people and communities thrive.\n\nBut it's not just our customers who'll feel your impact. You'll feel it too. Because at ANZ, you'll have the resources, opportunities, and support you need to take the next big step in your career.\n\nWe're a diverse bunch at ANZ in different roles, different locations, doing different things. That's why we have a range of flexible working arrangements, so our people can 'make work, work for them'. We also provide a range of benefits including access to health and wellbeing services and discounts on selected products and services from ANZ and more.\n\nAt ANZ, you'll be part of an organisation where the different backgrounds, perspectives and life experiences of our people are celebrated. That's because we're committed to building a workplace that reflects the diversity of the communities we serve. We welcome applications from everyone and encourage you to talk to us about any adjustments you may require to our recruitment process or the role itself. If you're a candidate with a disability or access requirement, and have an enquiry about the support provided, please let us know on your application or visit ANZ Accessibility and Inclusion Programs for alternate contact methods.\n\nTo find out more about working at ANZ, visit https://www.anz.com.au/careers . You can apply for this role by visiting ANZ Careers and searching for reference number 82306 .\n\nJob Posting End Date\n\n10/12/2024 , 11.59pm, (Melbourne Australia)\n\n",
        "skills": [
            "Analytical Skills",
            "Analytics",
            "Communication",
            "Computer Science",
            "Data Analytics",
            "Data Engineering",
            "Data Manipulation",
            "Data Visualization",
            "Retail Sales Analysis",
            "Visualization"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087658526",
        "posted_time": "2024-12-03 04:23:13"
    },
    {
        "title": "Applied Scientist, Generative Artificial Intelligence (AI) Innovation Center",
        "company": "Amazon Web Services (AWS)",
        "location": "Sydney, New South Wales, Australia",
        "description": "Description\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector. The AWS Global Support team interacts with leading companies and believes that world-class support is critical to customer success. AWS Support also partners with a global list of customers that are building mission-critical applications on top of AWS services.\n\nThe Generative Artificial Intelligence (AI) Innovation Center team at AWS provides opportunities to innovate in a fast-paced organization that contributes to game-changing projects and technologies leveraging cutting-edge generative AI algorithms.\n\nAs an Applied Scientist, you'll partner with technology and business teams to build solutions that surprise and delight our customers. We’re looking for Applied Scientists capable of using generative AI and other ML techniques to design, evangelize, and implement state-of-the-art solutions for never-before-solved problems.\n\nKey job responsibilities\n\n Collaborate with scientists and engineers to research, design and develop cutting-edge generative AI algorithms to address real-world challenges Work across customer engagement to understand what adoption patterns for generative AI are working and rapidly share them across teams and leadership Interact with customers directly to understand the business problem, help and aid them in implementation of generative AI solutions, deliver briefing and deep dive sessions to customers and guide customer on adoption patterns and paths for generative AI Create and deliver best practice recommendations, tutorials, blog posts, sample code, and presentations adapted to technical, business, and executive stakeholder Provide customer and market feedback to Product and Engineering teams to help define product direction.\n\nA day in the life\n\nHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\n\nAbout The Team\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nWhat if I don’t meet all the requirements?\n\nThat’s okay! We hire people who have a passion for learning and are curious. You will be supported in your career development here at AWS. You will have plenty of opportunities to build your technical, leadership, business and consulting skills. Your onboarding will set you up for success, including a combination of formal and informal training. You’ll also have a chance to gain AWS certifications and access mentorship programs. You will learn from and collaborate with some of the brightest technical minds in the industry today.\n\nBasic Qualifications\n\n 2+ years of building machine learning models or developing algorithms for business application experience Master's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field Knowledge of programming languages such as C/C++, Python, Java or Perl Proven knowledge of deep learning and experience hosting and deploying ML solutions (e.g., for training, tuning, and inferences)\n\nPreferred Qualifications\n\n PhD in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field Working knowledge of generative AI and hands on experience in prompt engineering, deploying and hosting Large Foundational Models Hands on experience building models with deep learning frameworks like Tensorflow, PyTorch, or MXNet\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844118",
        "skills": [
            "Algorithms",
            "Artificial Intelligence (AI)",
            "Computer Science",
            "Generative AI",
            "Java",
            "Pattern Recognition",
            "Perl",
            "Presentations",
            "Prompt Engineering",
            "Tutorials"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210047",
        "posted_time": "2024-12-03 09:22:30"
    },
    {
        "title": "Platform Architect",
        "company": "ING Australia",
        "location": "Sydney, New South Wales, Australia",
        "description": "At ING Platform Architects are team members of Tech Strategy and Architecture who are responsible for owning and driving the Application Platform direction within the organization. As such, they have and demonstrate high technical skills not only through designs, application architectural patterns and integration best practices, but also by delivering small-scale proof of concepts to introduce platform innovation in the Engineering Teams.\nThe focus of this team of Platform Architects is the Applications’ Architecture, understanding and utilizing the infrastructure provided. We also review and communicate what is the best way to integrate existing application services to deliver new features., setting standards, reference architectures and aligning these back into the Australian landscape.\n\nWhat you’ll do\nDesign the Application Platform’s Architecture for non-functional aspects Security, Resilience and Reliability, Scalability, Data Integrity and Consistency, and Performance for best usage of the underlying infrastructure.\nProvides guidance to Engineers, managers and teams/squads for the platform by describing and showcasing design patterns in cookbooks, workshops and hackathons. Supports the Engineers in how these best practices can actually be implemented in practice.\nDeliver Proof of Concepts to provide evidence of the effectiveness of the proposed solution where needed\nLeverages and adapt standards industry frameworks for usage within ING. Collaborates in defining Global standards in collaboration with other Architects, Engineers, IT Leads, etc. of Head Office and other ING Group’s Countries.\nEnsure that the designs are implemented according to plan, minimizing complexity, technical debt and deviations due to tactical implementations.\nHelps the Business breaks down desired themes into epics and features across multiple platforms, that can be further refined into implementable stories\nWhat we’re looking for\n4+ Years experience in Enterprise Java with lightweight frameworks (Spring, Spring Boot) and strong disposition to exploration and experimentation.\n2+ Years experience in data structures, application architecture and integration patterns, algorithms, and engineering best practices not only in coding, but also in quality and testing.\nExperience working on distributed application projects, cloud-native application factors and solving the fallacies of distributed computing using distributed application patterns.\nHigh awareness in Security in general (infrastructure, network, operations), and knowledge on various application security aspects such as Authentication and Authorization protocols, security frameworks, secure coding. Knowledge of PKI principles and practices, and identity management.\nAwareness of other Open Source Application Frameworks and Open Source contribution and collaboration models\nAwareness of messaging technologies like Kafka, RabbitMQ, ActiveMQ, etc.\n\n\nWhat’s in it for you?\nDrop everything and learn with over 16,000 professional and personal development courses to choose fromDiscounted ING Health InsuranceAn additional Rest Day to support your wellbeingAn IMPACT Day to volunteer on approved sustainability activity\nAbout Us\nAt ING, we want to make life simpler and more worthwhile – for everyone who banks with us, for the people who work with us, and the community at large, too.\nWhen you come to work at ING, you are joining a team where individuality is not just accepted, it is encouraged. We have built a culture that is fun, friendly, and supportive – it is the kind of place where you can be yourself and make the most of whatever you have to offer.\nWe give people the freedom to think differently, take ownership of their work, and make great things happen. We are here to help you get ahead. And with our global network, there is plenty of scope to take your career in new directions, perhaps even ones you have never considered.\nWe are all about celebrating success and as a result we are proud to be a WGEA Employer of Choice for Gender Equality and a certified Family Inclusive workplace.\nSound like the kind of place you would feel at home? We would love to hear from you.\n(One last thing, ING operates a direct talent sourcing model. So, no agency introductions, please.)\n\nApplications close 29 December 2024\nBefore you apply \nHere at ING, we consider employee development to be important and encourage existing employees to apply for suitable internal positions. It is expected that any employee applying for a vacant position would have been in their current role for a minimum of twelve (12) months before applying. This may be waived in exceptional circumstances and after consultation with your manager.\nStill in two minds?\nAt ING, we know that diversity drives innovation. Research reveals that 60% of women and underrepresented groups may pause at this stage, even after starting their application. Don’t miss out on the opportunity to bring your unique perspective to our team - submit your application today!",
        "skills": [
            "Application Architecture",
            "Distributed Computing",
            "Java",
            "Platform Architecture",
            "Spring Boot",
            "Spring Framework",
            "System Performance"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090089522",
        "posted_time": "2024-12-03 07:15:13"
    },
    {
        "title": "Expression Of Interest (EOI) - Senior/ Staff/ Principal Platform Engineer",
        "company": "Commonwealth Bank",
        "location": "Sydney, New South Wales, Australia",
        "description": "We are recruiting Platform Engineers at all levels, across many technology stacks!\n\nWhat is Platform Engineering @ CommBank\n\nPlatform Engineers architect, design, run, and evolve our Platforms – the core technology that our people use to deliver value to our customers.\n\nPlatform Engineers work hard so that our Platforms are loved by their users – our Product Engineers – because they help them get more done, spend less time on undifferentiated heavy lifting, and more time focusing on delivering great products to our customers.\n\nPlatform Engineers take an ‘automate first’ approach, ensuring that deployments and operations are performed via pipelines, and using Infrastructure as Code. Wherever possible, we encourage our people to write code that does the work, and to spend dedicated time improving the flow of work.\n\nWhat levels of role are you recruiting for?\n\nWe are currently recruiting for engineers, senior engineers, staff engineers, principal engineers, and chief engineers, as well as all levels of engineering managers.\n\nWhat skills do Platform Engineers have, and what Technology will I be working on?\n\nPlatform Engineers have strong infrastructure and systems knowledge combined with proficiency in modern DevOps practices, automation, and writing code to automate operations.\n\nThis is not an exhaustive list of technologies, so if you’re unsure, please apply.\n\nCloud: AWS, Kubernetes, Docker, Ansible, TerraformMonitoring & Observability: Go, Python, Grafana, Prometheus.End-User Compute: Windows, Mac OS X, InTune, Entra ID, Autopilot, Active DirectoryEngineering Tooling: GitHub, GitHub Actions, Perfecto, Artifactory, Snyk, TeamCity\n\nThe Responsibilities:\n\nDesign, develop and maintain platforms and tools that make life easier for our product engineersDesign and implement the technology stack and integration using infrastructure as code principlesTroubleshoot and resolve stability issues to increase system resilience and stabilityFocus on automating deployments, testing, and all kinds of toilListen to the users of the platform and iteratively evolve the platform to deliver even better experiencesShare your knowledge, and create documentation that is easy to read and understandMentor and guide junior engineers on the teamParticipate in our overall Engineering community – learning from and teaching others\n\nQualifications and experience:\n\nExperience performing platform engineering, software engineering, or systems engineering, or another related discipline – depending on the level of roleCloud certifications in AWS or Azure are useful, but not required (we will help you get certified if you want)Deep knowledge of the technology concepts and stack of one of our platformsFamiliarity with DevOps methodologies and CI/CD pipelinesScripting and programming skills, and the desire to learn new programming languagesExcellent problem solving and analytical skillsDemonstrated track record of showing that you are kind, curious & humble\n\nWorking with us\n\nWhether you're passionate about customer service, driven by data, or called by creativity, a career with CommBank is for you. Our people bring their diverse backgrounds and unique perspectives to build a respectful, inclusive, and flexible workplace with flexible work locations.\n\nHere, you’ll thrive. You’ll be supported when faced with challenges and empowered to tackle new opportunities. We’re hiring engineers from across all of Australia and have opened technology hubs in Melbourne and Perth. We really love working here, and we think you will too. \n\nWe support our people with the flexibility to balance where work is done with at least half their time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work in the role you’re interested in.\n\nIf this sounds like the role for you then we would love to hear from you. Apply today!\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 14/12/2024",
        "skills": [
            "Stack",
            "Analytical Skills",
            "Automation",
            "Autopilot",
            "DevOps",
            "EOI",
            "Microsoft Intune",
            "Problem Solving",
            "Resiliency",
            "Systems Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4070703005",
        "posted_time": "2024-12-03 10:15:52"
    },
    {
        "title": "Senior Data Engineer",
        "company": "Queensland Government",
        "location": "Brisbane, Queensland, Australia",
        "description": "The Senior Data Engineer will work within the ITS Technology Services Group to provide administration, advisory and support services to the Department of Justice and Attorney-General’s (DJAG) business applications and databases.\n\nYour Key Responsibilities\n\n Support the continuous improvement of the Department's SQL, Power Platform and Azure database environments including the optimisation of production databases and database management systems to maintain the data integrity, operational efficiently and security. Analyse business requirements, provide guidance and advice and design databases that fulfil diverse user requirements and satisfy relevant departmental, government and industry standards. Provide expert technical database and applications administration support services for the DJAG database applications. Provide secondary level technical support and consultation for database related incidents and requests logged via the Service Desk ensuring service level targets are met. Report and maintain statistical and historical metrics to measure and monitor service health and usage. Provide consultancy services to programmers in the team to assist in the optimisation of development databases. Actively develop, implement and maintain standards, guidelines and knowledge base articles for database installation, administration and support while ensuring compliance to change control processes, relevant industry standards and government policies.\n\n\nTechnical Skills, Abilities And Cultural Capability\n\n Proficient in on-premise SQL Server database management, including SSRS and SSIS. Working knowledge of Microsoft Fabric. Working knowledge of Databricks. Working knowledge of data integrity principles and security practices. Proficient in T-SQL code. Analysis skills, including ability to analyse business requirements, database performance metrics. Stakeholder management skills - work closely with other team members, leaders, analysts and other stakeholders to understand data needs and\n\n\nrequirements.\n\nApplications to remain current for 12 months.\n\nJob Ad Reference: QLD/607569/24\n\nClosing Date: Tuesday, 17th Demember 2024\n\nOccupational group IT & Telecommunications",
        "skills": [
            "Analytical Skills",
            "Business Requirements",
            "Data Analytics",
            "Data Engineering",
            "Data Warehousing",
            "Databases",
            "Extract, Transform, Load (ETL)",
            "Industry standards",
            "Optimization",
            "Performance Metrics"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089571278",
        "posted_time": "2024-12-02 19:52:47"
    },
    {
        "title": "Engineering Manager (BE) - AdTech - (Remote ANZ)",
        "company": "Canva",
        "location": "Sydney, New South Wales, Australia",
        "description": "Company Description\n\nJoin the team redefining how the world experiences design.\n\n\nHey, g'day, mabuhay, kia ora, 你好, hallo, vítejte!\n\nThanks for stopping by. We know job hunting can be a little time consuming and you're probably keen to find out what's on offer, so we'll get straight to the point.\n\nWhere And How You Can Work\n\nOur flagship campus is in Sydney. We also have a campus in Melbourne and co-working spaces in Brisbane, Perth and Adelaide. But you have choice in where and how you work, we trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals.\n\nWhat You’d Be Doing In This Role\n\nAs Canva scales change continues to be part of our DNA. But we like to think that's all part of the fun. So this will give you the flavour of the type of things you'll be working on when you start, but this will likely evolve.\n\nAt The Moment, This Role Is Focused On\n\nCoaching six software engineers and providing leadership in managing and guiding technical discussions within the AdTech teamActively participating stakeholder meetings with marketing strategists and leadership to advocate for the Engineering perspective and capture engineering requirements.Working collaboratively with group leadership, product managers, and engineers across Marketing and Product to scope and deliver solutions to empower internal teamsLeading the creation of technical design documents for cross-group & cross-team initiatives and contributing to engineering timelines and sprint planning.Designing, developing, and deploying solutions with hands-on software development, while effectively communicating with Program Managers, Product Manager and Engineers.Taking initiative in achieving goals, improving processes, and identifying opportunities for cross-team collaboration to work on new ideas and improvements.\n\n\nYou're probably a match if you have\n\nProven success both technical and people leadership, have honed skills in overseeing a high-performing teamExperience working in platform teams. Understanding of Java, typescript, protocol buffers, cloud Infrastructure (including AWS) and observability and reliability practices would be a huge bonusThrives in working collaboratively with non technical stakeholders such as product and influencing where neededArticulate with a strong background in writing, presenting, and communicating with stakeholders from various technical backgrounds and vernaculars.Experience working with marketing teams, SEM or marketers would be a huge bonus, though not necessary\n\n\nAbout The Team\n\nMarTech Group\n\nThe MarTech Group’s mission is \"to propel Canva's Global Growth by delivering innovative and scalable solutions that empower marketing, engage customers and amplify brand experience.\" MarTech designs and implements intelligent marketing technology solutions to drive efficiency, scalability, and optimisation across Marketing operations. Our work spans from AI-powered automation and data analytics to centralised asset management and personalisation platforms, enabling marketing teams to make smarter decisions and deliver impactful campaigns globally. Our goal is to ensure marketing technology solutions are innovative, cost-effective, and drive measurable business outcomes while supporting user growth, revenue generation, and operational excellence.\n\nAdTech Team\n\nThe Ad Tech team's mission is to accelerate Canva's growth through innovative advertising technology solutions that revolutionise how we create, optimise, and deliver ads at scale. We build and maintain mission-critical internal platforms that power Canva's marketing efforts, combining cutting-edge automation, data science, and artificial intelligence to drive user acquisition and maximise marketing ROI. Through our internal flagship products - Marketing Hub and Data Shipper - we enable Canva marketers to create high-performing campaigns while intelligently targeting high-value users across global markets.\n\nAbout The Role\n\nAt Canva, Engineering Managers play a crucial role in shaping the future of our platform and ensuring our engineering teams operate at their highest potential. By striking a fine balance between technical leadership, project delivery, and people management, they enable their teams to contribute significantly to Canva's vision and strategy. These leaders not only oversee the technical direction and roadmap but also ensure the alignment of their team's work with the broader company goals. Through fostering an environment of collaboration and growth, they help their team members excel and innovate, thus driving real business impact. Engineering Managers at Canva are instrumental in turning ambitious projects into reality, contributing to the company's success by delivering high-quality solutions that meet our users' needs and exceed their expectations.\n\nWhat's in it for you?\n\nAchieving our crazy big goals motivates us to work hard - and we do - but you'll experience lots of moments of magic, connectivity and fun woven throughout life at Canva, too. We also offer a range of benefits to set you up for every success in and outside of work.\n\nHere's a Taste Of What's On Offer\n\nEquity packages - we want our success to be yours tooInclusive parental leave policy that supports all parents & carersAn annual Vibe & Thrive allowance to support your wellbeing, social connection, office setup & moreFlexible leave options that empower you to be a force for good, take time to recharge and supports you personally\n\n\nCheck out lifeatcanva.com for more info.\n\nOther Stuff To Know\n\nWe make hiring decisions based on your experience, skills and passion, as well as how you can enhance Canva and our culture. When you apply, please tell us the pronouns you use and any reasonable adjustments you may need during the interview process.\n\nWe celebrate all types of skills and backgrounds at Canva so even if you don’t feel like your skills quite match what’s listed above - we still want to hear from you!\n\nPlease note that interviews are conducted virtually.",
        "skills": [
            "Ad Tech",
            "Coaching",
            "Cross-team Collaboration",
            "Design Documents",
            "Group Leadership",
            "Negotiation",
            "Presentations",
            "Sprint Planning",
            "Technical Discussions",
            "Timelines"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090058942",
        "posted_time": "2024-12-03 05:22:48"
    },
    {
        "title": "Data Analyst",
        "company": "The Royal Melbourne Hospital",
        "location": "Parkville, Victoria, Australia",
        "description": "A fixed term, 0.4EFT position is available for a suitably qualified and experienced researcher.\n\nSuitable candates must hold a PhD in a health or science field and have demonstrated recent palliative care expertise in research, data analysis, report / manuscript writing.\n\nPalliative Care Data and Project Officer\n\nYou’ll work in a dynamic team, pulling together critical data to inform important service planning and healthcare across the whole of VictoriaYou’ll work in an organisation that values Kindness, putting People First and achieving Excellence Together\n\nThe Parkville Integrated Palliative Care Service is a leading provider of clinical care, education and research across The Royal Melbourne Hospital and The Peter MacCallum Cancer Centre. We undertake research and quality improvement activities to continuously improve the care we provide our patients and community – through leading activities in trials research, health services research and service evaluation.\n\nYour New Role\n\nWork with our research team to optimise data collection, analysis and writing of reports and manuscripts for publication and dissemination with our key stakeholders – including other clinical services and the Victorian Department of HealthGenerate ideas for further research and seek out and apply for new funding opportunities\n\nAbout You\n\nSuitable candidates must hold a PhD in a health or science field and have demonstrated recent palliative care experience/expertise in research, data analysis, report writing and manuscript writingSuitable candidates will have expertise in database design and analysis.\n\nBenefit Of Working With The Royal Melbourne Hospital\n\nBe part of a team that generates ideas and leads innovation in Palliative Care that will provide meaningful benefit for patients and carers across Victoria, Australia and globallyCareer progression opportunities to suit your professional development goals. Enjoy excellent work-life balance working in a supportive and collaborative teamSalary packaging, onsite car parking and, close to public transport.\n\nInterested?\n\nIf you are looking for a challenging role and can demonstrate the above capabilities, connect with us.\n\nFor a confidential discussion please connect via the details below.\n\nAll appointments are made subject to a satisfactory Criminal History Record Check.\n\nDon’t delay, apply now! - recruitment is ongoing, with interviews commencing as soon as suitable candidates are received.\n\nClick here for the Position Description",
        "skills": [
            "Analytical Skills",
            "Data Analysis",
            "Data Analytics",
            "Data Architecture",
            "Data Collection",
            "Data Modeling",
            "Data Science",
            "Databases",
            "Problem Solving",
            "Research Skills"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090004240",
        "posted_time": "2024-12-03 02:29:19"
    },
    {
        "title": "Data Analyst",
        "company": "NDIS Quality and Safeguards Commission",
        "location": "Sydney, New South Wales, Australia",
        "description": "About The NDIS Quality And Safeguards Commission\n\nThe NDIS Quality and Safeguards Commission (the NDIS Commission) is an independent agency established on 1 July 2018 to improve the quality and safety of NDIS supports and services. The NDIS Commission is the dedicated national regulator of NDIS service providers in Australia and a non-corporate entity under the Public Governance, Performance and Accountability Act 2013.\n\nReporting and Insights Team \n\nThe Reporting and Insights Team is responsible for the delivery of high-quality data products that underpin data-driven decision-making and enable the NDIS Commission to ensure people with disability receive quality and safe supports and services under the NDIS. The team is accountable for providing business intelligence to operational units, reporting on key metrics and trends, and developing models to enhance Commission data.\n\nHow to apply:\n\nBy continuing, you agree that you have read our Privacy Statement. Show Privacy Statement Opens in new window",
        "skills": [
            "Analytical Skills",
            "Data Analysis",
            "Data Analytics",
            "Data Modeling",
            "Data Science",
            "Data Visualization",
            "Databases",
            "English",
            "Problem Solving",
            "Statistics"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090278048",
        "posted_time": "2024-12-03 14:18:22"
    },
    {
        "title": "Data Center Technician",
        "company": "Microsoft",
        "location": "Sydney, New South Wales, Australia",
        "description": "As a Microsoft Data Center Technician (DCT), you will stage, set up and perform hardware deployments. In addition, you will also perform troubleshooting and diagnostics on equipment, as well as perform hardware decommissions for simple changes and refreshes following Standard Operating Procedures. This opportunity will allow you to deepen your understanding of Data Center standard processes and procedures, develop mentoring skills while providing guidance to peers, familiarizing yourself with security and data management procedures, and accelerate your career growth in the process.\n\nMicrosoft’s Cloud Operations & Innovation (CO+I) is the engine that powers our cloud services. As a CO+I DCT, you will perform a key role in delivering the core infrastructure and foundational technologies for Microsoft's online services including Bing, Office 365, Xbox, OneDrive, and the Microsoft Azure platform. As a group, CO+I is focused on the personal and professional development of all employees and offers training and growth opportunities including Career Rotation Programs, Diversity & Inclusion training and events, and professional certifications.\n\nOur infrastructure is comprised of a large global portfolio of more than 200 Data Centers in 32 countries and millions of servers. Our foundation is built upon and managed by a team of subject matter experts working to support services for more than 1 billion customers and 20 million businesses in over 90 countries worldwide.\n\nWith environmental sustainability and optimization at the forefront of our data center design and operations, we continue to grow and evolve as we meet the ever-changing business demands that hold Microsoft as a world-class cloud provider.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\nPerforms diagnostics and troubleshooting following standard procedures, quickly identifies the cause(s) of issues, and replaces faulty components with minimal customer and business disruption. Performs post-execution quality checks and verifies that grounding, staging, labeling, and cabling are set up properly according to safety protocols, deployment standards, and planned Network Design Tasks (NDTs).Decommissions hardware for simple changes and refreshes (e.g., memory upgrades, rebuilds) following standard procedures with minimal guidance.Follows procedures to communicate, report, and escalate incidents to appropriate Microsoft data center operations management units, Technician Leads, and engineering specialists. Assists and provides guidance to other technicians to complete challenging or complex tasks. Completes required training aligned to the role and workload; observes more experienced technicians to gain hands-on experience and relevant on-the-job training. Contributes to a positive and effective team environment by sharing information with others, contributing to regular team meetings, asking questions, and staying apprised of the status of others' work. Has pride and a sense of accountability for the service quality, completeness, and resulting user experience; displays accountability and ownership of the data center facilities.Embodies our culture and values.\n\nQualifications\n\nRequired Qualifications:\n\nHigh school diploma, GED, or equivalent and basic knowledge of computer hardware and components AND 1+ year(s) experience supporting IT equipment or related technology.Ability to work shifts, including shift assignments during non-standard business hours that may include evening, nighttime, weekends, and/or holidays\n\nBackground Check Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Citizenship Verification: This position requires verification of Australian Citizenship to meet federal government security requirements.NV1/2, PV Clearance Assessment: This position may require an enhanced background check conducted through the Australian Government Security Vetting Agency.\n\nWhile not required, we also look for the following Preferred Qualifications:\n\n2+ years' experience supporting IT equipment or related technology.Applicable certifications: CompTIA (A+, Server+, Network+), Basic Structure Cabling (BSC).\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
        "skills": [
            "Cabling",
            "Communication",
            "CompTIA Network+",
            "CompTIA Server+",
            "Computer Hardware",
            "Computer Repair",
            "Data Center Operations",
            "Embedded Systems",
            "Job Training",
            "Troubleshooting"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4074703280",
        "posted_time": "2024-12-03 10:46:10"
    },
    {
        "title": "Data Analyst",
        "company": "Workforce Australia for Individuals",
        "location": "Sydney, New South Wales, Australia",
        "description": "About The Company\n\nLeading multinational software company with over 150,000 customers and millions of users across their product range, whose goal and is to change the way people work together with customer experience at the forefront of everything they do. Central modern offices, with an amazing culture, consistent growth, and investment in unleashing the potential of every member of the team.\n\nAbout The Role\n\nThe Senior Data Analyst will oversee the management and enhancement of our client?s database systems. This pivotal role ensures the integrity, security, and efficiency of their data operations. The ideal candidate will have extensive experience in database management, a strong analytical mindset, and the ability to collaborate effectively across teams to drive data-driven decision-making.\n\nKey Responsibilities\n\nCollaborate on a variety of product and business challenges with a diverse range of cross-functional partners, becoming a trusted strategic ally through the structure and clarity \n\n...Click here to view more detail / apply for Data Analyst",
        "skills": [
            "Analytical Skills",
            "Data Analysis",
            "Data Analytics",
            "Data Modeling",
            "Data Visualization",
            "Databases",
            "English",
            "Microsoft Power BI",
            "Problem Solving",
            "Statistics"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088721882",
        "posted_time": "2024-12-03 15:04:25"
    },
    {
        "title": "Software Engineer, Photos",
        "company": "Google",
        "location": "Sydney, New South Wales, Australia",
        "description": "At Google, we have a vision of empowerment and equitable opportunity for all Aboriginal and Torres Strait Islander peoples and commit to building reconciliation through Google’s technology, platforms and people and we welcome Indigenous applicants. Please see our Reconciliation Action Plan for more information.\n\nApplicants to this role must have work authorization in Australia as this role is not eligible for work visa sponsorship.\n\nMinimum qualifications:\n\nBachelor’s degree or equivalent practical experience.2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting. 2 years of experience with data structures or algorithms in either an academic or industry setting. \n\nPreferred qualifications:\n\nMaster's degree or PhD in Computer Science or related technical fields.2 years of experience with performance, large-scale systems data analysis, visualization tools or debugging.Experience developing accessible technologies. Experience in code and system health, diagnosis and resolution, and software test engineering.\n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.\n\nResponsibilities\n\nWrite product or system development code.Lead design reviews with peers and stakeholders to decide among available technologies.Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
        "skills": [
            "Algorithms",
            "Computer Science",
            "Data Analysis",
            "Data Analytics",
            "Data Structures",
            "Debugging",
            "Programming Languages",
            "Software Development",
            "Software Testing",
            "Test Engineering"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087448060",
        "posted_time": "2024-12-03 04:28:01"
    },
    {
        "title": "Data Analytics Internship",
        "company": "Refonte Learning",
        "location": "Australia",
        "description": "Data Analytics Intern (Remote – Australia)Company: Refonte (Refonte AI)\nAre you passionate about data and eager to turn raw information into actionable insights? Refonte AI, a global leader in IT and Ed-tech solutions, is seeking enthusiastic individuals for our Data Analytics Internship Program. This unique program offers hands-on experience and valuable training in data analytics, helping you gain the skills needed to thrive in today’s data-driven world.\n🌐 Learn More: https://refontelearning.com/\nAbout Refonte AIRefonte AI is known for innovation and excellence, providing world-class services in digital marketing, data science, business analytics, cybersecurity, web development, and more. Our teams are driven by a commitment to empower talents worldwide and are ready to offer interns an exceptional experience working on real-world projects that impact businesses globally.\nWhy Join Us?This internship goes beyond theoretical knowledge. At Refonte AI, you’ll work with diverse datasets, uncover insights, and contribute to impactful projects. Through our RIGTIP (Refonte Global Training & Internship Program), you’ll enjoy a flexible, remote work environment, collaborating with an international team from Oceania, Asia, Europe, and the Americas.\nKey Roles & ResponsibilitiesAs a Data Analytics Intern, you’ll dive deep into real-world data projects, gaining experience in:Collecting, processing, and analyzing data using tools like Excel, SQL, Python, and R.Developing dashboards and visualizations with Power BI, Tableau, or other data visualization platforms.Conducting exploratory data analysis (EDA) to identify patterns, trends, and correlations.Creating data reports and presentations that effectively communicate findings to stakeholders.Assisting in building predictive models and leveraging machine learning techniques.Working with cross-functional teams to gather data requirements and support decision-making processes.Understanding data integrity and security best practices to ensure data quality.\nWhat You’ll GainPractical Data Skills: Hands-on training with popular data analysis tools and methods.Real-World Impact: Engage in projects that offer insights to solve real business problems.Networking Opportunities: Work with data professionals across various regions.Mentorship: Guidance from experienced data scientists and analysts to help you grow.\nQualificationsCurrently pursuing a degree in data science, statistics, mathematics, computer science, or a related field.Familiarity with data analysis tools like Excel, SQL, Python, or R is a plus.Excellent analytical and problem-solving skills.Strong written and verbal communication skills for effective teamwork and reporting.\nAdditional DetailsThis is an unpaid internship as part of our Data Analytics Training & Internship Program under RGTIP. Once you apply, our team will contact you with further application details and next steps.\n🌐 Learn More: https://refontelearning.com/\nLocationRemote (Australia-based applicants preferred)\nTake this exciting first step into the world of data analytics with Refonte AI. Apply now to gain experience, build skills, and join a global community of innovators!\nApply Today",
        "skills": [
            "Algorithms",
            "Analytical Skills",
            "Business Intelligence (BI)",
            "Competitive Analysis",
            "Data Analysis",
            "Financial Analysis",
            "Java",
            "Python (Programming Language)",
            "Risk Analytics",
            "Statistical Data Analysis"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089590988",
        "posted_time": "2024-12-02 20:53:14"
    },
    {
        "title": "Software Engineering",
        "company": "Harrison.ai",
        "location": "Sydney, New South Wales, Australia",
        "description": "Why join us?💜 Do work that matters. We’re pioneering AI software that will help diagnose medical images and raise the standard of healthcare for millions of people every day. 🌏 Well-funded and global. Annalise.ai has a global presence across APAC, EU and US regions. We’re powered by Harrison.ai (raised Australia’s largest Series B of $129m in 2021).🌟 Work with a bunch of awesome, genuine people who are passionate about what they do.💻 Flexible and remote-friendly working.🚀 Make an impact. You won’t be another ‘cog in the wheel’ here. We give full trust and autonomy for you to be heard, to work on big & complex projects – and to make a real difference. 🌱 Grow your career with us. We’re big believers in lifelong learning. You’ll be given a $1000 personal L&D budget, access to LinkedIn Learning, plus opportunities for internal mobility and leadership training to fast-track your career. 🙌 Generous parental support including 16 weeks gender-neutral paid parental leave and $10,000 support for egg or sperm freezing. \nAbout Your RoleAs a Software Engineer at Annalise.ai, you will play a key role in developing innovative software solutions that integrate AI models into our platform. Reporting to an Engineering Manager, you will collaborate with cross-functional teams to build high-quality, scalable systems and deliver human-centered, impactful products. Your work will involve developing and maintaining robust software solutions, contributing to the evolution of our products, and advancing our mission. Success in this role means creating reliable software that supports clinicians in delivering better patient care. By leveraging your technical expertise and problem-solving skills, you will help Annalise.ai uphold its high standards of excellence while driving innovation in healthcare technology. This is a unique opportunity to work on meaningful projects that directly impact the lives of patients and their families, making a tangible difference in the world.Please note: Due to the proximity to the holiday break and interviewers taking some well deserved rest over the next month, shortlisting will commence from early - mid Jan 2025.\nWhat You'll Do:Participate in the product software development lifecycle of our product, including requirements refinement, coding, testing, and deploymentWrite clean, efficient, and maintainable code following best practices in software engineering and ensuring alignment with team standardsTroubleshoot, debug, and resolve software issues to ensure system stability, performance, and reliabilityCollaborate with cross-functional teams to deliver robust solutions inline with the requirementsEngage in code reviews to maintain code quality and foster a culture of collaboration and continuous improvementActively participate in team ceremonies such as sprint planning, stand-ups, and retrospectives to support collaboration, improve processes, and ensure successful delivery of team objectivesKeep up-to-date with software engineering trends and tools to recommend innovative technologies and methods that can improve development processes and product quality\n\nWhat You'll BringStrong experience with JavaScript/TypeScript in production applications in specific in the context of API/Backend developmentExperience with React (v18) components and state development and testingExperience with Cypress (or similar frameworks) for end-to-end testingExperience with MongoDB (or similar NoSQL database products)Experience with Docker for containerised development and deployment\n\nNice To Have Skills:Familiarity with AWS services including SQS, S3, EKS , CloudfrontFamiliarity with DICOM standard / medical domain knowledgeFamiliarity with C#\n\nThings To Think About:Being in healthcare, we need to work across a heap of departments to make sure our product is fit for clinical use. As such, you will need to be a collaborative team player with strong communication and stakeholder management skillsWe have team members based all around the globe and are still in the process of mastering async comms. You are adaptable to fully remote work environments and able to work effectively across distributed teamsWe are an ambitious scaleup with massive goals, sometimes priorities might change at the drop of a hat. You are comfortable working on greenfield projects with a high level of ambiguity and the ability to navigate uncertainty\n\n\nWhat You're Working TowardsWe are a team on a mission to make quality healthcare more accessible and affordable worldwide by harnessing the power of artificial intelligence. At Annalise.ai, we focus on creating cutting-edge AI solutions that improve patient outcomes at scale, enabling a healthier future for everyone. To achieve this bold and ambitious goal, we have brought together talented engineers, AI researchers, clinicians, and product experts to develop groundbreaking products that impact millions of lives.\nWhat we’re about We're problem solvers, redefining what’s possible in medical imaging through AI Technology. Our mission is to raise the standard of healthcare for millions of patients every day.Yes, we’re a technology company and yes, we’re leveraging the latest AI technologies, but people are at the heart of everything we do. Annalise.ai was formed in early 2019, powered by Harrison.ai. Since then, we’ve scaled rapidly and we’re focused on creating AI solutions that help radiologists diagnose medical images.Our first product, the world's most comprehensive AI clinical decision-support solution for chest x-rays, is already in made available to 1 in 4 radiologists in Australia and rolling out to hundreds more, globally. This solution is capable of detecting 124 findings and was recently featured in a peer-reviewed publication, Lancet Digital Health journal. And we’re just getting started. Help us shape the future of AI in medical imaging. And most importantly, help us make a real difference in people’s lives. What’s next?If you’re inspired by what we're up to, please apply now and we'll be in touch soon.We are proud to be an Equal Opportunity Employer. Diversity’s not a buzzword here, it’s in our DNA. Diverse perspectives shape our culture and make our work better. That’s why we’re committed to building inclusive teams that represent a variety of backgrounds and skills. If you need any reasonable adjustments, accessibility assistance or would like to note which pronouns you use at any stage of our hiring process, just contact us at accommodations: people@annalise.ai. We look forward to hearing from you.",
        "skills": [
            "Audio Mastering",
            "Code Review",
            "Communication",
            "Databases",
            "Problem Solving",
            "Reliability",
            "Shortlisting",
            "Software Development",
            "Stakeholder Management",
            "TypeScript"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087467006",
        "posted_time": "2024-12-03 00:47:38"
    },
    {
        "title": "Staff Software Engineer, Data Platform (AUS)",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "description": "The Role\n\nAs Staff Software Engineer for Linktree’s Data Platform team, you’ll play a crucial role in building a robust, scalable data platform that drives innovative experiences in our core product. Your contributions will unlock new opportunities for our tens of millions of users and our billions of visitors around the world, helping us achieve Linktree’s mission: empowering anyone to curate, grow and monetize their digital universe.\n\nYou’ll collaborate with a talented group of engineers, analysts, data scientists and product managers and create powerful frameworks, tools, and services that support emerging technologies like semantic search, recommender systems, and content understanding.\n\nNow is an exciting time to join our team as we undergo a major transition to a self-serve data platform. With our company experiencing rapid growth, you'll have the opportunity to be at the forefront of this transformative shift, shaping a pivotal part of our data strategy and making a lasting impact on our future success. Help us take the next giant leap in our data journey.\n\nWhat You’ll Own\n\nYou’ll be responsible for the delivery and real-world application of a broad range of data, ML and AI technologies;You’ll do hands-on work to continuously level-up our event ingestion, event brokers, data warehouses, data pipelines and data integration systems;You’ll design performant, scalable systems that empower our internal teams to self-serve their data needs;You’ll help steer our overall data strategy, in close collaboration with other Staff Engineers and leaders from across the company;You’ll manage a portfolio of experiments with data, testing a wide range of ideas and doubling down on those that work best;You’ll mentor your peers, within a culture of deep collaboration, honest feedback and continuous improvement;You’ll evangelise best practices for data and ML, and drive adoption across the company.\n\nWho We’re Looking For\n\nExperience: 5+ years of software engineering experience with a strong background in building scalable data platforms. Experience with data technologies (e.g. Spark), data warehousing solutions (e.g. Snowflake), and cloud platforms (e.g. AWS).Technical Skills: Proficiency in programming languages such as Python, or Typescript and experience with infrastructure as code tools such as CDK.Communication: Excellent interpersonal and communication skills, with the ability to collaborate effectively across teams and present technical concepts to non-technical stakeholders.Education: Bachelor’s degree in Computer Science, Engineering, or a related field. Advanced degrees or relevant certifications are a plus.\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "Communication",
            "Computer Science",
            "Programming",
            "Programming Languages",
            "TypeScript"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088711058",
        "posted_time": "2024-12-03 12:52:54"
    },
    {
        "title": "Cloud Support Engineer (Big Data / AIML)",
        "company": "Amazon Web Services (AWS)",
        "location": "Sydney, New South Wales, Australia",
        "description": "Description\n\nAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.\n\nAmazon Web Services is the market leader and technology forerunner in the Cloud business. As a member of the AWS Support team you will be at the forefront of this transformational technology, assisting a global list of companies and developers that are taking advantage of a growing set of services and features to run their mission-critical applications. As a Cloud Support Engineer, you will interact with leading engineers and customers around the world to troubleshoot, build, secure, and optimise their workloads.\n\nWould you like to use the latest cloud computing technologies? Do you have a passion for Machine Learning? Can you apply advanced troubleshooting techniques to provide tailored solutions for our customers? Do you want to be part of a customer facing technology team helping to ensure the success of Amazon Web Services (AWS) as a leading technology organization?\n\nIf you fit the description, you might be the person we are looking for! We are a group of smart people, passionate about cloud computing, and believe that world class support is critical to customer success.\n\nKey job responsibilities\n\nEvery day will bring new and exciting challenges on the job while you:\n\n Learn and use groundbreaking technologies, specifically within Machine Learning Apply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs Interact with leading engineers around the world Partner with Amazon Web Services teams to help reproduce and resolve customer issues Leverage your extensive customer support experience to provide feedback to internal AWS teams on how to improve our services Drive customer communication during critical events Drive projects that improve support-related processes and our customers’ technical support experience Write tutorials, how-to videos, and other technical articles for the developer community Work on critical, highly complex customer problems that may span multiple AWS services\n\nAbout The Team\n\nDiverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nHybrid Work\n\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our Australia Sydney or Melbourne Amazon offices.\n\nBasic Qualifications\n\n Bachelor's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field The Big Data role supports services that focus on Machine Learning technologies, including Amazon SageMaker and Bedrock, as well as dealing with open source models Experience with programming/scripting (Batch, VB, PowerShell, Java, C#, Chef, Perl, Ruby and/or PHP) Experience with System Administration with Linux (Ubuntu, CentOS, RedHat) and/or Microsoft Windows Server Experience with Networking and troubleshooting (TCP/IP, DNS, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or related)\n\nPreferred Qualifications\n\n Strong analysis and troubleshooting skills and experience Experienced with Linux system monitoring and analysis Good understanding of distributed computing environments Exposure to Virtualization (VMware, Xen, Hypervisor) Prior working experience with AWS - any or all of EC2, S3, EBS, ELB, Dynamo DB, EMR, Glue, Athena Exposure to security concepts / best practices\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844251",
        "skills": [
            "Curl",
            "Doctrine (PHP)",
            "Domain Name System (DNS)",
            "Dynamo",
            "Elastic Load Balancing",
            "LAN-WAN",
            "Local Area Network (LAN)",
            "Traceroute",
            "Troubleshooting",
            "Wide Area Network (WAN)"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090206850",
        "posted_time": "2024-12-03 09:22:30"
    },
    {
        "title": "Data Analyst (0 Experience Required)",
        "company": "Peroptyx",
        "location": "Perth, Western Australia, Australia",
        "description": "For thousands of years, maps have provided humans with the knowledge they need to make decisions. As a Maps Evaluator, you will have the opportunity to provide ground truth for your town, city or country.\nAt Peroptyx, we are looking for Data Analysts who will review mapping data for digital mapping applications. Your research capabilities will validate and ensure that the navigation of certain routes are accurate and safe.\nAs part of this role you will verify that business names and opening hours are correct. You will check that the distance from a starting point to an end destination is listed accurately resulting in better user experiences.\nWith this job you can plan your days around this highly flexible working schedule, work weekends or late evenings, all from the comfort of your own office. The flexibility of our roles minimizes the impact on your daily routine.\nSo, whether you are a student looking to earn as you learn, a retiree looking for a new challenge a part-time/full time professional or a work from home parent, Peroptyx has the right role for you!\nBenefitsWork up to 20 hours per week.Earn a competitive rate of pay.Develop your research skills.Avoid the long commute.Work from the comfort of your home office.Enjoy the flexibility of setting your own working hours!\nIdeal CandidateFluent in EnglishExcellent research skills.Excellent local knowledge of your home country.Good understanding and general knowledge of the geography and culture of Australia.Analytical mindset.\nJob RequirementsMust be living in Australia for a minimum of 5 consecutive years.Must pass an online open-book exam that can verify your full understanding of the material and concepts.Must be willing to work a minimum of 10 hours and up to 20 hours per week depending on task availability.Good working knowledge of search engines, map applications and familiarity with social media platforms.Strong ability to learn, understand and apply multiple sets of different instructions.All work must be of an independent nature.\nApply Online Today!",
        "skills": [
            "Analytical Skills",
            "Data Analysis",
            "Defining Requirements",
            "Digital Mapping",
            "Easily Adaptable",
            "English",
            "Geography",
            "Research Skills",
            "Social Media",
            "Traditional Knowledge"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088298411",
        "posted_time": "2024-12-03 16:05:47"
    },
    {
        "title": "AI & Data Analytics Training & Intership",
        "company": "Refonte Learning",
        "location": "APJ",
        "description": "Refonte is a globally recognized leader in the IT industry, renowned for delivering high-quality IT and Ed-tech services. We specialize in Artificial Intelligence (AI), digital marketing, data science, data analytics, UI/UX design, web development, and app development. Our commitment to innovation, excellence, and talent empowerment extends across the globe.\nFor more information:\nVisit our website: https://refontelearning.com/\nJob Summary:Refonte is seeking motivated and forward-thinking individuals to join our global team. This internship offers flexibility and the opportunity to work on international projects with a diverse team across Oceania, Asia, Europe, and the Americas. You will gain valuable experience, learn cutting-edge technologies, and contribute to impactful projects within a dynamic, globally recognized IT company.\nJob Description:We are excited to offer an internship focused on AI & Data Analytics. As an AI & Data Analytics Intern, you will collaborate with industry professionals on innovative projects that combine artificial intelligence, data analytics, and cloud technologies. This is a unique opportunity to develop your skills in data analysis, predictive modeling, and AI-driven solutions, all while contributing to projects that shape the future of industries.\nResponsibilities:Data Analysis & Modeling: Collaborate with cross-functional teams to analyze large datasets, extracting actionable insights that drive decision-making.AI Model Development: Assist in developing and optimizing machine learning models to solve complex problems, enhancing performance through data-driven approaches.Data Pipeline Engineering: Contribute to the design and implementation of secure, scalable data pipelines for efficient data processing and storage.Cloud Integration: Support the deployment of AI and data solutions in cloud environments (AWS, Azure, Google Cloud) with a focus on performance and security.Data Visualization: Create intuitive data visualizations that help stakeholders understand trends and make informed decisions.Continuous Improvement: Participate in refining and optimizing data workflows and AI models, ensuring high accuracy and scalability.Collaboration: Work closely with data engineers, AI specialists, and software developers to integrate analytics solutions across different platforms.Research & Innovation: Explore emerging AI and data technologies to propose innovative solutions that enhance business outcomes.\nProjects You Will Work On:Predictive Analytics: Develop AI models to predict trends, outcomes, and behaviors across industries.AI-Driven Automation: Build automated solutions that leverage AI to streamline processes and improve efficiency.Data Integration & Management: Design and manage data architectures that handle large-scale, complex data environments in the cloud.Advanced Data Visualization: Create dynamic dashboards and reports that provide stakeholders with real-time insights.NLP & Text Analytics: Work on natural language processing projects to enhance AI capabilities in language-based applications.AI Ethics & Compliance: Participate in developing AI solutions that adhere to ethical standards and comply with industry regulations.\nQualifications:Currently pursuing a degree in Data Science, Computer Science, AI, or a related field, with a strong passion for AI & Data Analytics.Solid foundation in programming languages such as Python, R, or SQL, with experience in data manipulation and machine learning libraries.Strong analytical skills with the ability to transform data into actionable insights.Excellent communication skills—both written and verbal—with the ability to articulate complex data concepts.Ability to work independently and as part of a team, demonstrating flexibility and problem-solving skills in a fast-paced environment.\nNote:This position is part of our unpaid “AI & Data Analytics Training & Internship” program under RIGTIP. Upon application, our team will provide further details about the process and next steps. This internship is designed to equip you with practical experience in cutting-edge technologies and prepare you for a successful career in AI & Data Analytics.\nLocation:Remote Asia\nFor more information:Visit our website: https://refontelearning.com/\n\n🚀 Join Refonte and fuel your passion for AI & Data Analytics by collaborating with industry experts on groundbreaking projects that are shaping the future of technology and business.",
        "skills": [
            "Analytical Skills",
            "Business Insights",
            "Communication",
            "Data Analytics",
            "Data Manipulation",
            "Data Science",
            "Easily Adaptable",
            "Pattern Recognition",
            "Predictive Analytics",
            "Python (Programming Language)",
            "R (Programming Language)",
            "System Performance"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090086199",
        "posted_time": "2024-12-03 06:55:35"
    },
    {
        "title": "Python Developer",
        "company": "Zerocap",
        "location": "Melbourne, Victoria, Australia",
        "description": "About usZerocap is an award-winning digital asset trading firm. We provide trading and liquidity solutions to forward-thinking institutions and investors. Our mantra is “zero friction, borderless finance.” With clients in over 50 countries, our business spans traditional finance and crypto-native institutions, family offices, and trading firms. Following several years of growth in the Australian market, we are expanding further into the APAC region in 2025 and beyond.\nThe roleWe're looking for a Senior Python Developer to help build and scale our institutional-grade digital asset trading infrastructure. You'll be working on critical systems that process millions in transaction volume, focusing on performance, reliability, and security. The ideal candidate will combine strong technical skills with an understanding of financial markets and a passion for building robust, scalable systems.\nResponsibilitiesDesign and implement high-performance micro-services using Python (FastAPI/Django)Build robust integration layers with crypto and traditional finance infrastructureArchitect scalable solutions leveraging AWS services and containerizationDevelop and maintain mission-critical trading systems with strict reliability requirementsCollaborate with cross-functional teams to deliver complex financial productsMentor junior engineers and contribute to technical decision-making\n Technical skills5+ years of professional software development experience with PythonStrong experience with FastAPI and Django web frameworksDeep understanding of message queues (Redis, Kafka, ZMQ) for real-time data processingProven experience with containerization (Docker) and orchestration (Kubernetes)Strong background in AWS architecture and cloud-native developmentExperience with CI/CD pipelines, particularly Github ActionsProficiency in writing maintainable, tested code with modern testing frameworksExperience with version control (Git) and collaborative development workflows\nDesired experienceExperience with cryptocurrency protocols and blockchain technologyPrevious work in financial technology or trading systemsFamiliarity with financial integrations (Fireblocks, banking APIs)Experience with KYC/AML systems (Onfido, AML screening tools)Background in developing low-latency systemsUnderstanding of financial market structure and trading workflows\nWhat we're looking forStrong problem-solving skills with attention to detailExperience working in Agile environments using JiraExcellent communication skills and ability to work with cross-functional teamsTrack record of delivering complex projects end-to-endPassion for financial technology and digital assets\nYour impactThis role offers significant opportunity for growth and impact:Build core infrastructure powering institutional digital asset tradingDesign and implement systems handling significant transaction volumesShape the technical architecture of a growing fintech platformContribute to the evolution of digital asset market structure\nWe value diverse perspectives and encourage applications from candidates of all backgrounds. If this sounds like your next move, apply through the provided link.",
        "skills": [
            "Amazon Web Services (AWS)",
            "Containerization",
            "Continuous Integration and Continuous Delivery (CI/CD)",
            "Cryptocurrency",
            "Django",
            "FastAPI",
            "Git",
            "Low Latency Trading",
            "Python (Programming Language)",
            "Trading Systems"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087656540",
        "posted_time": "2024-12-03 03:55:38"
    },
    {
        "title": "Data Analyst (12 Month Contract)",
        "company": "iptiQ by Swiss Re",
        "location": "Sydney, New South Wales, Australia",
        "description": "We have a fantastic opening for a Data Scientist in iptiQ ANZ. Apply now to seize this exciting opportunity!\n\nAbout The Role\n\nWe are seeking an individual who enjoys working with data and can assist the business in making data-driven decisions.\n\nYour Main Responsibilities Will Include\n\nManaging and transforming data from multiple sources to align with the requirements of reporting tools. Assisting in the development and maintenance of standardized reports in Power BI. Conducting validation of the reports and ETL results. Collaborate with the Head of Operations, Claims, and Pricing to develop, implement, and sustain the operational performance reporting suite. Provide support for regulatory reporting requirements. Examine web analytics and transaction data to generate insights for optimizing digital tools and business processes. \n\nAbout You\n\nPositive attitude; Excel Power Query knowledge; Python skills; Power BI experience; and Knowledge of Life Insurance would be a bonus. \n\nAbout The Team\n\nThe iptiQ Digital, Data, and Analytics team is responsible for implementing iptiQ's Digital and Data strategy across various groups, including end customers, distribution partners, administrators, and internal users. We adhere to agile practices, allowing flexibility in managing individual work schedules. Each team member is afforded the opportunity to cross-train in digital and data roles and responsibilities.\n\nSwiss Re offers modern working arrangements that allow all employees to adapt to changing work preferences. We provide attractive offices and competitive benefits, including 25 days of annual leave, 15 days of personal leave, flu vaccinations, and annual health checks.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nYou must be an Australian or New Zealand citizen or a permanent resident of Australia to apply for this role.\n\nApplications for this role will close on 15 December 2024. We look forward to your application!\n\nAbout IptiQ\n\nAt iptiQ, we partner with established brands around the world to create impactful digital insurance solutions. We make it easier for consumers to buy the insurance they need from the brands they trust. We provide life and non-life insurance through our end-to-end digital platform and build multi-channel customer experiences.\n\nWhat we offer our employees is outstanding. Hybrid working in offices across the world, phenomenal learning & career opportunities and a culture that encourages new perspectives to challenge conventions and come up with innovative solutions. We believe in the power of inclusion. Drawing on our employees' broad range of perspectives, life experiences and backgrounds stimulates creativity and gives us a competitive edge. iptiQ embraces a workplace where everyone has equal opportunities to thrive regardless of their age, gender, gender identity and/or expression, sexual orientation, race, ethnicity, religion, physical or mental ability, or other characteristic and can be their authentic self. Ignite your curiosity to shape digital insurance.\n\nIf you are an experienced professional returning to the workforce after a career break, we encourage you to apply for open positions that match your skills and experience.\n\niptiQ is part of Swiss Re, one of the world’s leading providers of re/insurance and risk transfer solutions. This means we’re backed by Swiss Re’s capital strength and more than 150 years of risk knowledge. Through our partnerships, we contribute to Swiss Re’s vision to make the world more resilient.\n\nDuring the recruitment process, reasonable accommodations for special needs are available upon request. If contacted for an interview, please inform the Recruiter/HR Professional of the accommodation needed.\n\nKeywords\n\nReference Code: 132142",
        "skills": [
            "Analytical Skills",
            "Analytics",
            "Data Analytics",
            "Data Architecture",
            "Individual Work",
            "Microsoft Power Query",
            "Problem Solving",
            "Query Writing",
            "Regulatory Reporting",
            "Reporting Requirements"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088232758",
        "posted_time": "2024-12-03 09:00:43"
    },
    {
        "title": "Staff Software Engineer, Authentication",
        "company": "Linktree",
        "location": "Sydney, New South Wales, Australia",
        "description": "The Role\nWe are looking for a Staff/Senior Software Engineer to join our Security team.As a member of the Security team, you’ll work across a wide range of areas to improve Linktree’s security posture. This ranges from product security work, such as building easy to use and secure authentication methods to platform work to ensure teams have easy-to-use and secure development tools available. If you’re excited by working with different teams and on a wide range of technologies, this role is for you.\nWhat You’ll Own\nThe systems Linktree uses to secure our users’ accounts, incl. Authentication and bot mitigation systems.Partner with our platform teams in securing our development tooling, incl. CI/CD pipelines and infrastructure primitives we make available to our development teams.Partner with product and platform teams in securing our APIs and infrastructure estate.\nWho We’re Looking For\nYou care about figuring out how to work backwards from a desired outcome and take pride in building the simplest possible solution to achieve that goal.You care about the users of your systems and actively strive to build solutions that make their lives easier, not harder.You get excited by, and are good at getting familiar with new technologies and existing systems written by others.Experience with our stack is a plus: Typescript, Node.js, PostGreSQL. The rest of our stack includes GraphQL, AWS (S3, EventBridge, SQS, Lambda, ECS, DynamoDB, CDK) and Snowflake. Our monolith consists of a PHP code base.Security experience is a plus.\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\nWhere and How We Work\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.We offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\nHow we’ll help you thrive\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:An annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\nOur Story\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "AWS Lambda",
            "Amazon SQS",
            "Cloud Infrastructure",
            "Digital Authentication",
            "Doctrine (PHP)",
            "ECS",
            "GraphQL",
            "PHP",
            "Snowflake",
            "Snowflake Cloud"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087458086",
        "posted_time": "2024-12-02 22:38:45"
    },
    {
        "title": "Senior Backend Engineer, Content Moderation",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "description": "The Role\n\nLinktree is a leading platform that empowers users to centralize their online presence, streamlining how they connect with their audience across various channels. As our company grows, so does the complexity and importance of ensuring a safe and engaging environment for our diverse user base.\n\nWe are seeking a skilled Backend Software Engineer to join our dynamic Content Moderation Team. In this role, you’ll be working with a small team of Software and Machine Learning Engineers in developing and maintaining backend systems that detect and action violative content uploaded to our platform.\n\nWhat You’ll Own\n\nOur Content Moderation platform capabilities, scanning all content shared on Linktree for violations of our Community Standards and implementation of our Trust & Safety team’s policiesThe build, deployment, infrastructure, testing and monitoring of our deployed and running serviceProcesses for scanning content for violations and either automatically moderating it or queueing it for review if requiredTooling used by our Trust & Safety team to review trends in content being uploaded and review content flagged as potentially violativeStandardised interfaces between the Content Moderation team and the rest of the Linktree organisation to communicate content being uploaded, classified, detected as violative and moderated to enable consistent integrations with all teams\n\nWho We’re Looking For\n\nBachelor’s degree in Engineering, Computer Science, Information and Technology or equivalent and 5+ years of relevant industry experience.Prior experience with backend software development (We use Typescript primarily but experience with any equivalent language is fine)Prior experience building services with open source web application frameworks (e.g. Spring, ASP.NET, ExpressJS, Symfony, NestJS) and object oriented programmingPrior experience managing the cloud infrastructure, deployment pipelines, build, testing and monitoring of containerised backend microservicesPrior experience developing and designing event-driven and synchronous systemsWillingness to contribute to the front-end tooling used by the Trust & Safety team (we use a third party platform enabling us to develop this tooling using a building-block framework)Strong verbal and written communication skills and a passion for helping other teams\n\nPreferred Experience, Not Required\n\nExperience working for SAAS companiesExperience building self-service tooling and platformsExperience managing AWS cloud infrastructure with their CDK\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            "Back-End Web Development",
            "Communication",
            "Computer Science",
            "Microservices",
            "Moderating",
            "Object-Oriented Programming (OOP)",
            "Software Development",
            "Symfony Framework",
            "TypeScript",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088710091",
        "posted_time": "2024-12-03 12:52:54"
    },
    {
        "title": "SQL Data Engineer",
        "company": "Billigence",
        "location": "Sydney, New South Wales, Australia",
        "description": "About us\nBilligence Pty Ltd is a specialist in the delivery of market-leading Business Intelligence and CRM solutions. Headquartered in Sydney, Australia and with offices in Prague, London, Frankfurt, and Singapore our passion is data and our focus is the delivery of end-to-end solutions via a talented team of skilled professionals.\nWe are partners with leading edge software platforms including Tableau, Alteryx, Collibra, Snowflake and Salesforce.\n\nWhat we are looking for \n\nA SQL Data Engineer to join our team & work alongside one of Australia's most recognised brands. This is an initial 4 month contract (with strong potential to extend).\nHybrid working model - 3 Days per week near central station.\n\nEssential skills/experience required for this opportunity: \n3-5+ years in-depth SQL experienceData mapping and data lineage experience, ability to independently map data through a production systemExperience reverse engineering production system and rebuilding it into reporting model (RDMS)Strong defect and data problem solving skills identifying root causeAWS experienceExcellent written & verbal communication skills\nNice to have:\nTeradataPythonTableau reporting\n\n\nIf this sounds like something you are interested in, please apply with your most up-to-date CV and we will be in touch! \nPlease note that we are not currently able to offer Visa Sponsorship for this position so you must have full rights to work in Australia and must be based in Sydney.  Only successful candidates will be contacted.",
        "skills": [
            "Amazon Web Services (AWS)",
            "Bash",
            "Database Development",
            "Framework Design",
            "Oral Communication",
            "Python (Programming Language)",
            "SQL",
            "Scripting",
            "Teradata"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090058627",
        "posted_time": "2024-12-03 04:54:17"
    },
    {
        "title": "HubSpot Implementation Specialist",
        "company": "Reel Unlimited",
        "location": "Sydney, New South Wales, Australia",
        "description": "Reel Unlimited is a global creative services solution offering startups and SMBs unlimited design and content writing at a flat rate. Launched in 2021 as a remote-first company, Reel Unlimited is pursuing its mission of delivering reliable, scalable, affordable, and better creative content to any startup. Today, Reel Unlimited serves over 300 startups and agencies, from bootstrapped or VC-backed. Check us out at www.reelunlimited.com.\n\nAbout The Role\n\nReel Unlimited is looking for talented and motivated HubSpot Implementation Specialists to join our Web Design team and earn flat daily pay while helping clients with their websites and HubSpot-related needs. As a freelance position, you will be compensated based on the number of HubSpot tasks you deliver.\n\nYour Responsibilities Will Include The Following\n\nDesign and develop visually appealing and user-friendly websites using HubSpot CMS Hub.Implement and customize HubSpot tools (Services Hub, Marketing Hub, Sales Hub, and Operations Hub) to meet clients' needs.Coordinate and collaborate effectively with project managers, clients, and colleagues to deliver high-quality HubSpot solutions on a short delay, usually a maximum of 48 hours per task.Produce drafts and make revisions based on the feedback received.\n\nHow It Works\n\nOnce accepted into our network, you get daily notifications about HubSpot tasks matching your skills.You will have access to our dashboard to review project details, including deadlines, and will also have access to a private Slack channel for communication and collaboration with clients.Every 2 weeks, you bill us for all your completed tasks, and we direct deposit amounts owed to your bank account within 2 business days.\n\nCompensations\n\nCompensation includes a flat rate of $50-$150 per HubSpot task, bi-weekly payouts for completed tasks, and bonuses and incentives. So, there is no need to fight for clients or pitch without the promise of pay.\n\nThe Minimum Requirements For This Position Include The Following\n\nMinimum 1 year experience working in HubSpot CMS Hub, Services Hub, Marketing Hub, Sales Hub and Operations Hub.HubSpot certifications, the more the better.Strong understanding of website design principles, responsive design, and user experience.Good English communication, detail-oriented, and customer-friendly.Respect the average task turnaround of 48–72 hours per order.Deliver a minimum of 1 task per day, with the ability to take on multiple projects simultaneously.Remote, freelance position with the freedom to choose when and where you work.Strong communication, problem-solving, and design skills.Good interpersonal skills and client-handling experience.Team player with a sense of humor.\n\nHow to apply: If you have experience as a HubSpot Implementation Specialist for brands or startups and are familiar with website design and HubSpot tools, you would be an excellent fit for our expanding Web Design team. Please submit your resume and HubSpot portfolio today, and our team will reach out to you shortly. We are looking for applicants who are available to begin working immediately.",
        "skills": [
            "Communication",
            "English",
            "Interpersonal Communication",
            "Interpersonal Skills",
            "Problem Solving",
            "Responsive Web Design",
            "Software Implementation",
            "Training",
            "User Interface Design",
            "Web Design"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088237277",
        "posted_time": "2024-12-03 08:58:03"
    },
    {
        "title": "Python Developers - Swinburne University",
        "company": "CPT Global",
        "location": "Melbourne, Victoria, Australia",
        "description": "CPT Global is on the lookout for skilled Python Developers to collaborate on innovative projects at Swinburne University. As a Python Developer, you will contribute to the development and enhancement of applications and systems that support the university's diverse educational and administrative functions. Your role will involve writing clean, maintainable code, designing efficient algorithms, and participating in the full software development lifecycle, from requirements gathering to deployment. You will work closely with academic teams and other stakeholders to understand their needs, creating solutions that are not only functional but also scalable and user-friendly. With your expertise in Python and your problem-solving mindset, you will have the opportunity to impact the academic experience of students and faculty alike, helping to drive technological advancements within the university. CPS Global is committed to fostering a collaborative and inclusive work environment, supporting professional development, and driving innovation in our projects.\n\nKey Responsibilities\n\nDesign, develop, and test scalable applications and systems using PythonCollaborate with stakeholders to gather and analyze requirements and translate them into technical specificationsImplement best practices for software development, including code reviews and unit testingOptimize application performance and scalability while ensuring security measures are in placeProvide technical support and troubleshooting for deployed systems and applicationsStay updated with the latest trends in Python development and apply them to current projects\n\n\nRequirements\n\nProven experience as a Python Developer, with a strong portfolio of projectsProficiency in Python frameworks such as Django or FlaskUnderstanding of database management systems (SQL and NoSQL) and ORM technologiesStrong problem-solving skills and the ability to work independently as well as within a teamExperience with version control systems, such as GitFamiliarity with cloud services and deployment tools is a plusExcellent communication skills, both verbal and written, with the ability to work in a collaborative environment",
        "skills": [],
        "job_url": "https://www.linkedin.com/jobs/view/4090206511",
        "posted_time": "2024-12-03 03:54:25"
    },
    {
        "title": "Staff Software Engineer",
        "company": "Commonwealth Bank",
        "location": "Sydney, New South Wales, Australia",
        "description": "Typescript backend developmentAWS mastery (CDK, Lambda, API Gateways, DynamoDb)\n\nDo work that matters \n\nEngineering the future of banking - We're building tomorrow’s bank today, envisioning new technologies that are still waiting to be invented and reimagining payments products that support millions of our customers, and help build Australia’s future economy.\n\nSee yourself in our team\n\nBusiness Banking Technology has a vision of becoming Australia’s leading digital business bank, empowering businesses and people to succeed with tomorrow’s technology. We work hand-in-hand with our business colleagues to solve problems with customer centricity and technical innovation, cultivating a world-class empowered team who build technology solutions for the future.\n\nAs a Staff Software engineer, you’ll be joining a squad within our Real Time Payments crew (domain), working on our highly visibility and market leading product “Payment as a Service” (PaaS). As an experienced Staff Software Engineer, you’ll lead the end-to-end software engineering process, showcasing your forward-thinking solution design skills with hands-on development, deployment, security, and maintenance of the platform that powers our PaaS APIs with DevSecOps principles.\n\nWe’re interested in hearing from people who:\n\nHave strong coaching and influencing skills that they have used to help large scale teams make big shifts in quality. Have led the design and implementation of holistic software development & quality strategies for complex software systems. Passionate about coding and building industry leading PaaS products and APIs from scratch for complex landscape of Payments services provided by the Bank by using modern tech stack. Experienced in building things from ground-up and can influence the product stakeholders with confidence, while driving the technical roadmap with cross-collaborative crews and teams! Ready to execute state-of-the-art coding practices, driving high quality outcomes to solve core business and minimise risks. Curious design thinkers that break boundaries to solve complex API problems with an Agility focused mindset. Naturally driven to engage, consult, influence, educate and provide technology advice to stakeholders, with an innate ability to coach and mentor team members. \n\nTech Skills\n\nWe use a broad range of tools, languages, and frameworks. We don’t expect you to know them all but experience or exposure with some of these (or equivalents) will set you up for success in this team.\n\nDirectly influence product design, implementation and enhancement to support quality, performance and reliability.Strong full-stack background with platform engineering perspective.Full SDLC expertise (including business partnering, solution design, DevSecOps).AWS mastery (CDK, Lambda, API Gateways, DynamoDb, etc). Strong experience in Typescript in backend development, preferably via Nest.js, SSTCI/CD tooling - Github Actions, Docker, Kubernetes OpenTelemetry and modern monitoring and logging tools – Splunk, AppDynamics, CloudWatchExperience with a wide range of system architectures (microservices, web applications, APIs, message queues / event streams) \n\nIf this sounds like you, apply today!\n\nWe support our people with the flexibility to balance where work is done with at least half their time connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few.\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 20/12/2024",
        "skills": [
            "Amazon Dynamodb",
            "Back-End Web Development",
            "Coaching",
            "Distributed Systems",
            "Microservices",
            "Reliability",
            "Software Design",
            "Software Development",
            "System Architecture",
            "TypeScript"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4074013199",
        "posted_time": "2024-12-03 10:14:20"
    },
    {
        "title": "Product Manager - Data Platform (Junior)",
        "company": "THE ICONIC",
        "location": "Sydney, New South Wales, Australia",
        "description": "Since 2011, THE ICONIC has redefined the future of retail in Australia and New Zealand. As the #1 fashion e-commerce destination in the region, our e-commerce platforms (Retail, Marketplace and Services) provide an inspiring and seamless end-to-end customer experience through our own technology innovations. We stand for benchmark-setting customer service, delivery options, returns policies, and curation of brands.\n\nWorking at THE ICONIC means joining a diverse and dynamic community of over 1,000 people working towards our purpose “To bring on the future of shopping”. This diversity is at the heart of everything we do and gives real meaning in creating a positive impact in the world, from our ethical sourcing and sustainability strategies to our community engagement and diversity.\n\nWhat You Will Do\n\nYou bridge technology and business value and are the go-to person who’s responsible and accountable for the inception, design, delivery and testing of solutions that work.\n\nAs the Junior Product Manager for Data Engineering you will support the delivery of multiple data strategies through the development of our data platform.\n\nYou’ll be part of a multidisciplinary team with OKRs (Objectives & Key Results). You’ll work with your team to get things done and advocate for the team, explaining how your solutions deliver value for customers and contribute to THE ICONIC’s success.\n\nIt Is Expected That You\n\nBe the customer voice at the tablePrioritise and have a clear framework that allows easy explanation why we are doing A instead of B. Have a clear overview of what the team is set to achieve and how it relates to the company goals.Understand the viability, feasibility and desirability of what’s set to be delivered.Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams and/or charts.Improve team velocity by analysing current performance, experimenting with new ways of working, improving team engagement and measuring and surfacing agile metrics.\n\n\nWhat We Are Looking For\n\n2+ years in an agile and product environment, as a Product Owner or Technical Business Analyst in the Data spaceExperience in supporting and delivering data engineering projects Strong organisational skillsExcellent written and oral communication skillsGood stakeholder and relationship managementDocumenting, monitoring and revising the following artefacts in support of delivery: product requirements, process maps, use cases, user acceptance test plans, business models, data models and flows, project plans, and release notesExperience in using SQL, data models and databasesWorking with data engineers and agile development teams on design, definition, documentation and implementation of features for web applications, business infrastructure and data structure \n\n\nLife at THE ICONIC\n\nFrom our ways of working to our growth mindset and sustainable approach, we each add unique value and have an incredible amount of fun doing it! People are our greatest asset and our ICONITE experience is designed to empower you to do your best work.\n\nHere’s what to expect when you join THE ICONIC:\n\nFlexible working. We offer a hybrid and flexible working model so you can do your best work in a way that works for you\n\nThe learning collective. Get your knowledge fix with our learning days, hackathons and access to LinkedIn Learning and Udemy\n\nParents at THE ICONIC. Access to our parental leave program and an extra day off for your kids' first day of school every year\n\nBirthday leave. Enjoy a paid day off for your birthday and an ICONIC voucher to treat yourself\n\nCurate your style. No matter what your style is, we have got you covered with our Amazing staff discount and our famous sample sales\n\nWellbeing. Access to our discounted gym memberships and wellbeing programs\n\nPeople first. Access to our Employee Assistance Program for you and your family\n\nVolunteer days. Work as a Charity Partner with Thread Together for society and environmental change.\n\nRefer a friend. Enjoy a referral reward for successfully referring someone to THE ICONIC!\n\nWe are committed to providing reasonable arrangements to all individuals participating in our application and interview process, and while performing job functions. If you require any accommodations or adjustments prior to the submission of your application or throughout your interview process, please contact our Talent Acquisition team directly: talent.acquisition@theiconic.com.au",
        "skills": [
            "Analytical Skills",
            "Communication",
            "Data Engineering",
            "Data Models",
            "Maps",
            "Organization Skills",
            "Product Requirements",
            "Project Plans",
            "Release Notes",
            "Test Planning"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090223308",
        "posted_time": "2024-12-03 10:16:52"
    },
    {
        "title": "Product Lead - Data Platforms",
        "company": "THE ICONIC",
        "location": "Greater Sydney Area",
        "description": "Product Lead- Data Platforms\n\nSince launching in 2011, THE ICONIC has redefined the future of retail in Australia and New Zealand. As the leading fashion, sports and lifestyle e-commerce destination in the region, our e-commerce platforms (Retail, Marketplace and Services) provide a seamless and inspiring end-to-end customer experience.\n\nWe are a diverse and dynamic community of over 1,000 people working towards our purpose “To bring on the future of shopping”. THE ICONIC is people and planet positive, and we strive towards creating a positive impact in the world by driving genuine and meaningful change for the better of all communities involved.\n\nOur Product Team is the connection between business, technology, and customers. We define the direction, strategy and roadmap of new products and features to deliver value to our customers, business partners, and team members.\n\nWe are currently on the look out for a Product Lead to join our team and take on the responsibility for the end-to-end product roadmap at THE ICONIC with a focus on our Data Platforms.\n\nIn this role you will enjoy spending time with internal customers to understand their experiences and problems and find innovative solutions. In this role you will have practical experience to understand that awesome user experiences are usually created by more than just shiny system features - they require robust back-end technology, business processes, data models, and more. You understand how front-end and back-end systems, business processes, data, and product\n\nWhat You’ll Do\n\nCollaborate with cross-functional teams, including Data, Engineering, Marketing, Category Management and Finance, to align product development with company objectives.Working with data scientists, analysts and agile development teams on design, definition, documentation and implementation of features for web applications, business infrastructure and data structureExperience in using SQL, data models and databasesSet a measurable, outcome-orientated, and customer-centric product strategy and direction for a number of initiativesPlan and execute a Product Roadmap that meets customer needs and business objectives for your domain. Challenge the roadmap to ensure we are always working on the right priorities.Ensure your team has the skills it needs to effectively deliver the roadmap, while also scaling the team's expertise to grow with the company.Encourage a culture within the organization for a continuous growth- Mindset with a Test & Learn mentalityManage priorities and ensure that the team completes the most critical features firstImplement a clear vision and strategy for your team by fostering a culture of accountability and by promoting ownership and responsibility.Ensure your team delivers high-quality products that are an asset to the company's strategic objectives.Track and measure the right product metrics /OKRS for their team\n\n\nWhat We Are Looking For\n\nExtensive Product Management experience specifically with Data Platforms expereinceExperience in using SQL, data models and databasesProven track record of collaborating and leading Product teams to deliver a complex roadmapExcellent communication and collaboration skills, with the ability to work effectively with both technical and non-technical teamsExperience in identifying gaps in current solutions and approaches, prioritizing and crafting business cases to validate the importance of new feature requestsExperience partnering with senior leadership and cross-functional stakeholders to understand and prioritise business needs, build consensus, and communicate requirements Champion product design, development, and deliveryExtensive experience in applying product management fundamentals in an Agile environmentExperience in problem discovery, scoping, and specification/requirements gatheringExperienced in taking a product from strategy, through to initial idea, implementation, support, and continuous improvementPragmatic approach to product development with a focus on delivering iterations of customer valueAbility to methodically (with data) assess the value of a solution and evaluate it against othersStrong ability to motivate and inspire people to do their best workRelentlessly focused on customers’ needsAble to clearly articulate a customer or business value/proposition, and influence leaders on strategic decisions\n\n\nWhy you'll love THE ICONIC\n\nFrom Our Ways Of Working To Our Growth Mindset And Sustainable Approach, We Each Add Unique Value And Have An Incredible Amount Of Fun Doing It! People Are Our Greatest Asset And Our ICONITE Experience Is Designed To Empower You To Do Your Best Work. Here’s What To Expect When You Join THE ICONIC\n\nFlexible Working. We offer a hybrid and flexible working model so you can do your best work in a way that works for youThe learning collective. Get your knowledge fix with our learning days & hackathonsParents at THE ICONIC. Access to our parental leave program and an extra day off for your kids' first day of school every year Birthday leave. Enjoy a paid day off for your birthday and an ICONIC voucher to treat yourselfCurate your style. No matter what your style is, we have got you covered with our Amazing staff discount and our famous sample salesPeople & Planet Positive: From our ethical sourcing and sustainability strategies to our community engagement and diversity, our responsibility is multifaceted, and each of these facets are equally important. Wellbeing. Access to our discounted gym memberships and wellbeing programsPeople first. Access our Employee Assistance Program for you and your family. Volunteer days. Work as a Charity Partner with Thread Together for society and environmental change.Refer a friend. Enjoy a referral reward for successfully referring someone to THE ICONIC.\n\n\nAdditional Information\n\nWe are committed to providing reasonable arrangements to all individuals participating in our application and interview process, and while performing job functions. If you require any accommodations or adjustments prior to the submission of your application or throughout your interview process, please contact our Talent Acquisition team directly: talent.attraction@theiconic.com.au",
        "skills": [
            "Business Case Preparation",
            "Business Requirements",
            "Communication",
            "Cross-functional Team Leadership",
            "Data Models",
            "Product Design",
            "Product Management",
            "Product Road Mapping",
            "Product Strategy",
            "Workload Prioritization"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090220719",
        "posted_time": "2024-12-03 10:16:51"
    },
    {
        "title": "Analytics Engineer",
        "company": "Macquarie Group",
        "location": "Sydney, New South Wales, Australia",
        "description": "Join our Data Change team and support the delivery of our Data Transformation initiative - one of the many exciting change transformations happening across Macquarie. We provide data solutions that facilitate effective data management, data-driven insights, and data automation within our Commodities and Global Markets group. At the forefront of the dynamic data landscape, we value you, your development, and the ideas you contribute to our vibrant organisation.\n\nAt Macquarie, our advantage is bringing together diverse people and empowering them to shape all kinds of possibilities. We are a global financial services group operating in 34 markets and with 55 years of unbroken profitability. You’ll be part of a friendly and supportive team where everyone - no matter what role - contributes ideas and drives outcomes.\n\n What role will you play? \n\nYou will focus on designing, implementing, and supporting data pipelines and analytics solutions for major transformation programs across Macquarie. You will build and maintain strong trusted stakeholder relationships, manage risk, and promote a collaborative team environment. With a focus on continuous improvement, you will deliver innovative and impactful data solutions.\n\nWhat You Offer\n\nExtensive experience designing and implementing enterprise grade data pipelinesStrong stakeholder and relationship management skillsSolid understanding of data modelling conceptsStrong SQL and Python development skillsExcellent problem-solving skillsExperience using Dataiku would be a bonus, along with finance domain knowledge.\n\nWe love hearing from anyone inspired to build a better future with us, if you're excited about the role or working at Macquarie we encourage you to apply.\n\nAbout Commodities and Global Markets \n\nIn Commodities and Global Markets you will be part of a global business offering capital and financing, risk management, market access, physical execution and logistics solutions to a diverse client base.\n\nBenefits\n\nMacquarie employees can access a wide range of benefits which, depending on eligibility criteria, include:\n\nHybrid and flexible working arrangements One wellbeing leave day per year and up to five additional days leave based on length of serviceUp to 20 weeks paid parental leave as well as benefits to support you as you transition to life as a working parent Paid volunteer leave and donation matching Range of benefits to support your physical, psychological and financial wellbeing Access to a wide range of learning and development opportunities\n\n Our commitment to diversity, equity and inclusion \n\nWe are committed to providing a working environment that embraces diversity, equity, and inclusion. We encourage people from all backgrounds to apply for a role regardless of their identity, including gender, race, ethnicity, cultural identity, nationality, age, sexual orientation, gender identity, intersex status, marital or family status, neurodiversity, religion or belief, disabilities, or socio-economic background.\n\nIf you require adjustments to your working arrangements or the recruitment process, please let us know when applying.",
        "skills": [
            "Data Analytics",
            "Data Engineering",
            "Data Modeling",
            "Data Pipelines",
            "Data Science",
            "Data Warehousing",
            "Extract, Transform, Load (ETL)",
            "Problem Solving",
            "Python (Programming Language)",
            "SQL"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4072504386",
        "posted_time": "2024-12-03 10:05:10"
    },
    {
        "title": "Solution Architect",
        "company": "Australian Trade and Investment Commission (Austrade)",
        "location": "Greater Sydney Area",
        "description": "Classification: Executive Level 1Location: Brisbane – QLD, Canberra - ACT, Melbourne - VIC, Sydney - NSWSalary: $112,868 - $126,961\n\nThe Role\n\nAustrade is seeking a Solution Architect to support its Digital Client Services program and work across a number of multifunctional teams to help it come to fruition. Our Digital Client Services are focused on providing authenticated and personalized services to Austrade clients.\n\nAs Solution architect, your role will be to develop solutions for a variety of client-facing web applications. The successful candidate will be working with a group of talented and motivated developers and architects using agile delivery and DevOps principles.\n\nDuties Include\n\n Work with stakeholders in an agile environment to architect solutions that meet business requirements while aligning with technology strategy. Coordinate the development of agreed solution architectures across multiple business, infrastructure or functional areas. Provide advice on technical aspects of solution development and ensures relevant technical strategies, polices, patterns and standards are applied. Produce technical plans, blueprints, and roadmaps to articulate the business and technical benefits of proposed solutions. Work with Enterprise Architects to ensure architectural quality and compliance with agency governance.\n\nGiven our commitment to diversity and inclusion, Austrade actively encourages applications from people with disabilities, LGBTQIA+ people, women, and people with diverse linguistic and cultural backgrounds for all of our roles.\n\nClosing Date\n\nApplications close at  11.30PM, Wednesday, 18 December 2024  (AEDT).\n\nEligibility\n\nAustralian Citizenship - Our successful candidate must be an Australian citizen.\n\nSecurity Clearance - Our successful candidate will be required to obtain and maintain a Baseline security clearance.\n\nFor more detailed information please view the Information Pack.",
        "skills": [
            "Architecture",
            "Business Planning",
            "C#",
            "Cloud Computing",
            "IT Strategy",
            "Presales",
            "Service-Oriented Architecture (SOA)",
            "Software Architecture",
            "Software Development",
            "Solution Architecture"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089507476",
        "posted_time": "2024-12-02 16:40:04"
    },
    {
        "title": "Data Engineer",
        "company": "Talent Ready",
        "location": "Sydney, New South Wales, Australia",
        "description": "About the jobWe are recruiting for a technology and engineering professional services business based in Sydney who help enable organisations with their technical architecture and development capabilities to reach transformational outcomes. Utilize the latest in application and integration DevOps and Data technologies and work with high profile clients in government, financial services and utilities. The market for Data expertise is on an exponential growth trajectory and to meet demand they are looking for an experienced Data Engineer.\nDuties and Responsibilities:Deliver client solutions on end to end data engineering projects from a consulting/lead positionComplex analysis and interpretation of clients needs to deliver suitable pipelines, housewarming and data lakesData quality, integrity and usability governance, working in collaboration with the wider data team and businessMentor and direct team members from a technical and design perspectiveStakeholder and client relationship and expectation management\nAbout you:Consulting level experience with data engineering practices like data transformation, modeling and warehousing using modern data technology including Snowflake and Databricks Strong knowledge of Python/SQLMigration experience moving enterprise data warehouse with hands on experience with data warehouse platforms like Teradata/Cloudera or others.We would expect broader experience across AWS Cloud Architecture, DevOps, networking, Machine Learning and security.This role requires strong stakeholder management and communication skills with the ability to problem solve and build relationships underpinned by excellent communication and presentation skills.\nWhy you should join us:We work on the latest cloud technology on challenging complex integration and digital transformation projectsWe offer remote work with 4 days from home per weekWe are a fast paced rapidly growing specialist consulting firm with a strong reputation and growing list of high-profile clientsWe have supportive management and offer career growth and learning opportunitiesWe offer excellent remuneration and flexible, family friendly working arrangements\nIf this sounds like you and you’re interested in joining us on our data journey, please apply now!",
        "skills": [
            "Amazon Web Services (AWS)",
            "Azure Databricks",
            "Cloud Computing",
            "Data Engineering",
            "Data Modeling",
            "Data Pipelines",
            "Data Warehouse Architecture",
            "DevOps",
            "SQL",
            "Snowflake"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087633628",
        "posted_time": "2024-12-03 00:45:47"
    },
    {
        "title": "Data Analyst (AI)",
        "company": "N/A",
        "location": "Sydney, New South Wales, Australia",
        "description": "Company DescriptionExpression of Interest for upcoming project in 2025Role DescriptionThis is a contract role located in NSW, with flexibility for remote work. As a Data Analyst (AI), you will be responsible for analyzing complex data sets, creating data models, and generating insights using artificial intelligence technologies. You will collaborate with cross-functional teams to support business decision-making and drive data-driven strategies.\nQualificationsProficiency in data analysis tools such as Python, R, SQL, and TableauExperience with machine learning algorithms, statistical modeling, and data visualizationStrong understanding of artificial intelligence concepts and techniquesExcellent analytical and problem-solving skillsAbility to communicate complex data findings to non-technical stakeholdersBachelor's degree in Computer Science, Statistics, Mathematics, or related fieldExperience in handling and analyzing large datasetsKnowledge of data cleaning, transformation, and preprocessing techniquesCertifications in data analysis or artificial intelligence are a plus",
        "skills": [
            "Analytics",
            "Data Analysis",
            "Data Analytics",
            "Data Cleaning",
            "Data Mining",
            "Data Science",
            "Data Visualization",
            "Datasets",
            "Problem Solving",
            "Visualization"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087454756",
        "posted_time": "2024-12-03 05:23:31"
    },
    {
        "title": "Revenue Platforms Data Engineer",
        "company": "Google",
        "location": "Sydney, New South Wales, Australia",
        "description": "At Google, we have a vision of empowerment and equitable opportunity for all Aboriginal and Torres Strait Islander peoples and commit to building reconciliation through Google’s technology, platforms and people and we welcome Indigenous applicants. Please see our Reconciliation Action Plan for more information.Minimum qualifications:\n\nBachelor's degree in Business, Finance, a related quantitative field, or equivalent practical experience.3 years of experience with Finance systems, Accounting, Operations, Tax, Internal Controls, Requirements Documentation, Testing, and Validation.Experience in SQL/database management.Experience with Object-Oriented Programming.\n\nPreferred qualifications:\n\nExperience in collaborative coding and version control.Experience in machine learning, including data preparation, model selection, performance evaluation, and parameter tuning.Ability to deliver operational process improvements.Excellent communication and customer service skills.Passion for developing and analyzing data sets and converting them into business insights.\n\nAbout the jobIn this role your mission is to simplify and centralize the prioritization and deployment of smart, Quote-to-Report (Q2R) digitalization to deliver the Return on Investment (ROI) on Finance platforms, for Alphabet. We aim to enable Q2R systems, processes and data fit for Finance that allow every product, anywhere, anytime, the right way, effortlessly.\n\nResponsibilities\n\n Collaborate with Stakeholders, w ork with finance Subject matter experts to understand report requirements and provide necessary data solutions, access and support.Develop and Maintain Data Pipelines design and implement Extract, Transform, and Load (ETL) processes (SQL, Python) to ensure timely collection and integration of financial data from various sources. Manage Data Architecture understands internal infrastructure to select appropriate sources and technologies to manage data, and design data architecture to support financial reporting. Ensure data security and compliance.Ensure Data Quality implements data validation and cleansing processes to maintain quality data for accurate business reporting.Automate manual tasks and design data solutions. Efficiently handle volumes of financial data.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
        "skills": [
            "Collaborative Coding",
            "Communication",
            "Data Analytics",
            "Data Engineering",
            "Data Modeling",
            "Data Preparation",
            "Databases",
            "Model Selection",
            "Product Requirements",
            "Version Control"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087397754",
        "posted_time": "2024-12-02 19:38:33"
    },
    {
        "title": "Data Analyst (SQL + Alteryx)",
        "company": "CareCone Group",
        "location": "Sydney, New South Wales, Australia",
        "description": "Position: Data Analyst (SQL + Alteryx)Location: Sydney / Melbourne / BrisbaneFulltime (Permanent)\nJob Description:Strong years using SQL at least 4Good experience using AlteryxGather requirements from Data Analysts and Data Scientists on known data issues.Analyze consumption layer data to determine data quality.Root cause analysis to diagnose data quality issues.Lead solution implementation/design with technical data teams (Data Engineers, Solution Architects)Build visualization assets to monitor data quality pre/post solution implementation.\nInterested Candidates can share their updated resumes on sourabh.sood@carecone.com.au or can reach me on +61 290 559 949.",
        "skills": [
            "Agile Methodologies",
            "Alteryx",
            "Data Analysis",
            "Data Center Design",
            "Data Quality",
            "Data Visualization",
            "Python (Programming Language)",
            "Requirements Gathering",
            "SQL",
            "Solution Implementation"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090018396",
        "posted_time": "2024-12-03 03:14:33"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Linktree",
        "location": "Melbourne, Victoria, Australia",
        "description": "The Role\n\nWe are looking for Senior Software Engineers who are great problem solvers, enjoy collaborating with others (not just engineers) that value well-written and tested code. As a Software Engineer at Linktree, you’ll be working together with various members and teams to achieve your goals. You’ll dive deep into how we currently work and help us optimize it as you grow into your role. We’re just getting started, so joining us now means a LOT of influence on the direction we’re going.\n\nWhat We’re Looking For\n\nDegree in Engineering, Computer Science, or equivalent and 5+ years of Software Engineering experienceYou care about figuring out how to work backwards from a desired outcome and take pride in building the simplest possible solution to achieve that goal.You care about the users of your systems and actively strive to build solutions that make their lives easier, not harder.Experience with our stack is a plus: Typescript, Node.js and PostGreSQL. The rest of our stack includes GraphQL, AWS (S3, EventBridge, SQS, Lambda, ECS, CDK) and Snowflake. Our monolith consists of a PHP code base.\n\nP.S. If you don’t tick every box in this ad, please don’t rule yourself out. We take pride in inclusion and hiring incredible human beings with great potential over ticking boxes – so if this role resonates with you, hit that apply button!\n\nWhere And How We Work\n\nWe are a global and diverse group offering a truly flexible and family friendly work environment. Kids, pets, and the occasional delivery person are all actively encouraged to appear on our Zoom screens. All of us at Linktree work either fully remote or a flex hybrid approach.\n\nWe offer autonomy and flexibility in how you structure your days and weeks. There will be the need for some collaboration outside of your usual 9-5 being a global company, but we aim to work asynchronously where possible.\n\nHow We’ll Help You Thrive\n\nOur approach to benefits considers the whole person and the unique contributions they bring to Linktree. We want the experience at Linktree to be one that enables people to truly thrive so we can Go Further Together. Some ways we support you:\n\nAn annual wellbeing allowance to use on things like (but not limited to) fitness memberships, development courses, childcare, travel, charitable donations, pet insurance, home office set up - the choice is yours!100% coverage (and 80% for your dependents) of your monthly premiums for medical, dental, vision, disability and life insurance for US-based employees.Employer contribution towards your retirement.Generous time off for vacation, holidays, parental leave, volunteer time and other categories.Employee Stock Option Program - we want each and every employee to share in the company’s success as we go further together.\n\nTo learn more about our benefits, including our parental leave program, volunteering leave, DE&I initiatives, and more, click here!\n\nOur Story\n\nWe're on a mission to empower anyone to curate, grow and monetize their digital universe. We created the \"link in bio\" category and are trusted by some of the world's biggest brands and celebrities including TikTok, The UN Environmental Program, The White House, F1, Manchester United, Olivia Rodrigo and Selena Gomez. With over 50M+ users and 40,000 new accounts created everyday, Linktree is the fastest growing leader in our category. Linktree has partnered with some of today’s biggest names like Amazon, TikTok, Snap, YouTube, GoFundMe, Spotify, Google, Stripe, Reddit and more to help unify users’ digital spaces— and we’re just getting started. Join us in empowering everyone from businesses to creatives in building their online presence.\n\nAt Linktree, we celebrate and support everyone’s perspective and background, and we’re proud to be an equal opportunity workplace. We aim to foster a diverse and inclusive environment where all team members have a sense of belonging, because we believe in going further together. Linktree welcomes all people regardless of sex, gender identity, race, ethnicity, disability, pregnancy, age, or other lived experience. If you require accommodations to fully participate in our opportunities, please don't hesitate to reach us at talent@linktr.ee – your needs are important to us.",
        "skills": [
            ".NET Framework",
            "ASP.NET",
            "AutoCAD",
            "Cascading Style Sheets (CSS)",
            "Computer Science",
            "HTML",
            "Object-Oriented Programming (OOP)",
            "Programming",
            "Python (Programming Language)",
            "XML"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088705781",
        "posted_time": "2024-12-03 12:52:53"
    },
    {
        "title": "Data Platforms - Technical Business Analyst",
        "company": "Endeavour Group",
        "location": "Surry Hills, New South Wales, Australia",
        "description": "Company Description\n\nLet’s create a more sociable future together\n\nAt Endeavour, we’re totally into what we do. With a portfolio that includes Dan Murphy’s, BWS, ALH Hotels, Pinnacle Drinks and more, we love to bring people together. Together we share our passion for our products and industry; it’s what inspires us to dream big, and continue to create new experiences for our customers and teams across Australia. If you thrive on positive energy, we want to meet you!\n\nJob Description\n\nLove what you do and leave your markBe a part of one of Australia's largest Transformation projects Flexible and Hybrid working\n\nThe Data Platforms - Technical Business Analyst will play a key role in performing requirements gathering, impact analysis, testing and change management/comms/training for the delivery of the target state EGL enterprise data platform and transition of EGL core data assets from shared platforms to the new EGL enterprise data platform.\n\nThe role will work with stakeholders and perform system analysis to gather functional and non-functional requirements, perform technical and functional impact analysis and provide key input into the transition/build plan. This role will act as the bridge between the data stream and the BAU data platform team, ensuring a smooth transition into BAU. They will work closely with the Analytics & Reporting stream to ensure that the plans align with the Pillar Analytics & Reporting transition plans.\n\nThis is a hands-on role that will work closely with external SIs who will ultimately deliver the plan.\n\nThe Analyst will have a proven track record of successfully translating between technical and business requirements, understanding the impacts of solutions on business needs/processes and costs, and the ability to engage with a range of stakeholders at a variety of levels within the business. The role is a critical conduit in supporting the team throughout the project lifecycle.\n\nSound good? Read on.\n\nHere is a taster of what you can expect in this role:\n\nTaking the direction from the Data - Data Foundations Stream Lead, the Analyst will collaborate with the SME’s as well as other Business Analysts and/or Technical and Business and Functional Leads to identify and agree on the foundations business and technical requirements.Assists in documenting, reviewing, and supporting approvals of the project scope/requirements in their area (data pipelines, models and reporting to be delivered on the data platform).Participates in workshops and ensures the inclusion of relevant team members from the business to validate the design being implemented. Works with the Pillar, Technical and Business Teams to ensure all possible due diligence is carried out to provide confidence of the implementation prior to the go live. There may be a need to travel to stores and/or interstate offices to gather requirements.Supports testing, where required, assisting to create test scripts, perform testing, and provide potential solutions to resolve errors. Supports system unit and integration testing as required including checking test results and identifying re-work and revalidation after subsequent corrections. Works together with Integration and Data Engineers and System Owners to ensure that data sources within the solution are validated, leading to the successful delivery of data pipelines, modelling and reporting on the analytics platform. \n\nQualifications\n\nNow let’s talk about you:\n\n3-5+ years of experience in an insights driven business and/or data analyst role. Advanced proficiency in various data and insight based software, including but not limited to Excel, Google Sheets, database querying and TableauAdvanced SQL skillsExcellent verbal and written communication skills to effectively communicate with individuals at all levels of the organisation.Strong change management and leadership skills to effectively support the implementation’s change initiatives through the change team.Demonstrated ability to influence, facilitate, and negotiate effectively.Ability to motivate others, track progress, and collaborate effectively with peers.Sound judgement in decision-making and problem-solving.Able to work effectively with individuals from diverse cultural backgrounds.Positive and ‘can do’ attitude.\n\nStrong analytical skills.\n\nThe benefits are good too! \n\nWe offer flexible working in every senseAn exclusive discount card for BWS, Dan Murphy’s, Woolworths, BIG W and other Endeavour Group brands, including our ALH pubsMonthly meeting-free days Your health and wellbeing is your most important asset, and as one of our valued team members, it’s our first priority. You will have a range of free services to help you live well and support your physical, mental and financial wellbeingEndeavour Group is full of opportunities - use our dedicated learning and development options to grow an idea, yourself, and your career. This is just the start, so dream big.\n\nAt Endeavour, we value being a workplace where everyone’s welcome - if you meet a number of the requirements (and not all), we encourage you to apply.\n\nAdditional Information\n\nWe are together creators\n\nWith a portfolio that includes Dan Murphy’s, BWS, ALH Hotels, Pinnacle Drinks and more, Endeavour Group is big on sociability. Together we create the moments that bring millions of people together. And together we have more fun, create more opportunities, and score a lot more goals. We’re serious about creating a safe, inclusive and fun place to rock up to where equal opportunity is key, and flexibility is part of how we roll.\n\nWe’re all about creating a more sociable future - for our customers and each other. If this job excites you - and you’re close-enough on the requirements, reach out, we’d love to hear from you.\n\nYou can learn more about working with us on LinkedIn or at endeavourgroupcareers.com.au.\n\nOur Talent Team and Hiring Leaders kindly request no unsolicited resumes or approaches from Recruitment Agencies. Endeavour Group is not responsible for any fees related to unsolicited resumes.\n\n#WeAreTogetherCreators #ComeAsYouAre #DreamBig #FeelTheEnergy #LeaveYourMark #EndeavourGroup\n\n",
        "skills": [
            "Analytical Skills",
            "Business Requirements",
            "Communication",
            "Data Analysis",
            "Documentation",
            "EGL",
            "Google Sheets",
            "Negotiation",
            "Problem Solving",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4021841290",
        "posted_time": "2024-12-03 10:33:10"
    },
    {
        "title": "Data Analyst (370916)",
        "company": "Department of State Growth (Tas)",
        "location": "Hobart, Tasmania, Australia",
        "description": "Employment Type:Appointment to this role is on a permanent, full-time basis (up to 73.5 hours per fortnight).\nSalary: $99,482 to $104,352 per annum plus Superannuation. \nPosition Objective: To provide support for the deployment and ongoing maintenance of departmental Business Intelligence tools. The position plays a key role in the development and improvement of business intelligence platforms, providing technical advice to Department divisions and acting as an internal technology subject matter expert when liaising with relevant vendors. \nDuties: To develop and deploy data management and analytics tools for the department.To support the migration of legacy reports to Fabric.To provide technical support in developing solutions across a range of Power Platform tools.Assist the Business Systems Strategy and Innovation Manager with the ongoing operations and implementation of systems upgrades to Agency Business Systems.\nTo apply and for more information, please visit www.jobs.tas.gov.au\nApplications close on Sunday, 22 December 2024 at 11:55pm.\nFor more information, please contact: Tim NoviceManager, Business Systems, Strategy and InnovationEmail: Tim.Novice@stategrowth.tas.gov.auPhone: (03) 6165 4038",
        "skills": [
            "Ad Hoc Analysis",
            "Analytical Skills",
            "Applied Mathematics",
            "Data Analysis",
            "Data Analytics",
            "Data Science",
            "Data Visualization",
            "Mathematics",
            "Problem Solving",
            "Visualization"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087462077",
        "posted_time": "2024-12-02 23:35:50"
    },
    {
        "title": "Data Analyst",
        "company": "Peoplebank",
        "location": "Sydney, New South Wales, Australia",
        "description": "About The Company\n\nLeading multinational software company with over 150,000 customers and millions of users across their product range, whose goal and is to change the way people work together with customer experience at the forefront of everything they do. Central modern offices, with an amazing culture, consistent growth, and investment in unleashing the potential of every member of the team.\n\nAbout The Role\n\nThe Senior Data Analyst will oversee the management and enhancement of our client’s database systems. This pivotal role ensures the integrity, security, and efficiency of their data operations. The ideal candidate will have extensive experience in database management, a strong analytical mindset, and the ability to collaborate effectively across teams to drive data-driven decision-making.\n\nKey Responsibilities\n\nCollaborate on a variety of product and business challenges with a diverse range of cross-functional partners, becoming a trusted strategic ally through the structure and clarity of your work.Apply technical expertise in quantitative analysis, experimentation, and data presentation to develop strategies for our business and help solve its biggest challenges.Develop hypotheses through analytical approaches, using different methodologies and frameworks to test them.Define, understand, and test opportunities to improve products and business performance, influencing roadmaps with insights and recommendations.Partner with cross-functional teams to inform, influence, and execute strategic decisions.Identify and measure the success of product initiatives through forecasting and monitoring key product metrics to understand trends.Use data to shape product development, quantify new opportunities, and identify upcoming challenges.\n\nSkills/Experience:\n\nMinimum of 10 years of relevant experience in data analysis, database management, or a related role.Proven experience in an analytics role, turning data into actionable insights and recommendations.Strong analytical and communication skills, with the ability to synthesise insights into compelling narratives.Experience with the SaaS customer lifecycle, from acquisition to retention.Skilled in designing and analysing experiments.Superior SQL skills (Snowflake, Postgres) — able to write structured and efficient queries on large data sets.Extensive experience with a Business Intelligence tool (e.g. Tableau or Hex).Experience with a statistical scripting language (e.g. R or Python) is a plus.\n\nGreat Chance to join a market leader! For more info contact Nic on nic.gulliver@peoplebank.com.au\n\nThis is a critical role for our client, please click ‘apply now’ and quote #264307",
        "skills": [
            "Analytical Skills",
            "Analytics",
            "Communication",
            "Data Analysis",
            "Data Analytics",
            "Database Administration",
            "Databases",
            "Presentations",
            "Problem Solving",
            "Snowflake Cloud"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090225513",
        "posted_time": "2024-12-03 11:22:08"
    },
    {
        "title": "Data Processing Software Engineer ? SKA-Low Telescope",
        "company": "Workforce Australia for Individuals",
        "location": "Perth, Western Australia, Australia",
        "description": "Acknowledgement of Country \n\nCSIRO acknowledges the Traditional Owners of the land, sea and waters, of the area that we live and work on across Australia. We acknowledge their continuing connection to their culture and pay our respects to their Elders past and present. View our vision towards reconciliation\n\nChild safety \n\nCSIRO is committed to the safety and wellbeing of all children and young people involved in our activities and programs. View our Child Safe Policy .\n\nThe opportunity \n\nThe SKA Observatory (SKAO) is a next-generation radio astronomy facility that will revolutionise our understanding of the Universe and the laws of fundamental physics. Enabled by cutting-edge technology, it promises to have a major impact on society, in science and beyond.\n\nIn Australia, the SKAO is collaborating\n\nClick here to view more detail / apply for Data Processing Software Engineer ? SKA-Low Telescope",
        "skills": [
            ".NET Framework",
            "ASP.NET",
            "C++",
            "Cascading Style Sheets (CSS)",
            "HTML",
            "Object-Oriented Programming (OOP)",
            "Programming",
            "Python (Programming Language)",
            "Software Development",
            "Telescope"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4087645465",
        "posted_time": "2024-12-03 02:37:32"
    },
    {
        "title": "Principal Engineer - Digital",
        "company": "Commonwealth Bank",
        "location": "Sydney, New South Wales, Australia",
        "description": "We're embarking on an engineering transformation program and are ready to push the boundaries. You have knowledge that spans both development and operations, including coding, infrastructure management, system admin/engineering and DevOps Toolchains. Together we will build tomorrow’s bank today, using world-leading engineering, technology, and innovation. \n\nDo work that matters:\n\nWe're building tomorrow’s bank today, which means we need creative and diverse engineers to help us redefine what customers expect from a bank. Envisioning new technologies that are still waiting to be invented and reimagining products that support our customers and help build Australia’s future economy.\n\nCommBank is recognised as leading the industry in IT and operations with its world-class platforms and processes, agile IT infrastructure, and innovation in everything from payments to internet banking and mobile apps. Our Software team are the brains behind Australia’s number one banking app, Netbank, Cardless Cash, Comm Sec Pocket and Spend Tracker. We go beyond a passion for web and mobile development, creating reliable APIs at a unique scale in Australia. And you could be a part of that journey.\n\nSee yourself in our team: \n\nThis role sits within Business Banking (BB) Technology, providing technology solutions to Business Banking domains across Business Banking and CommSec and empowering businesses and people to succeed with tomorrow’s technology. Our purpose is to become the leading digital business bank, powered by the next horizon of technology.\n\nWithin BB Technology, the Digital Domain focuses on technology enablement of digital engagement channels and covers. The teams that support BB Digital and CommBank Smart Health, contribute to strategic BB and Customer NPS +30 outcomes.\n\nTechnology is the enabling force behind information technology functions for the Group to achieve the highest levels of customer experience, security, reliability, velocity, and innovation.\n\nWe’re interested in hearing from people who:\n\nAs a Principal Engineer, you will shape the future of our digital platform while focusing on designing, developing, and deploying innovative technology solutions that will enable us to build tomorrow's bank today. You’ll use your skills to lead our engineers in implementing complex technical solutions in a SaaS and cloud-based environment. You’ll possess a strong risk mindset in ensuring that appropriate cyber security controls are implemented and play a significant mentoring role in providing technical assistance to the engineers in the team.\n\nWe’re Interested In Hearing From People Who\n\nDesigns and implements solutions to complex problems, including onboarding and migrating to new tooling as well as removing obsolete systems and codeProvides expert consultancy across the enterprise, with a particular focus on DevOps and CI/CD toolingDrives continuous improvement and technical uplift initiatives for the teamProactively collaborates with others to share knowledge and resolve issuesEncourages risk-taking and constructively challenges the status quo while influencing stakeholders and building diverse and inclusive teamsExperience and knowledge of Release and Deployment strategies, tools and systemsUnderstanding of the various types of testing (eg unit, integration, non-functional) with an appreciation of why this is important\n\nTech skills:\n\nWe use a broad range of tools, languages, and frameworks. We don’t expect you to know all of them but experience or exposure to some of them will set you up for success in this team:\n\nEnd to end - Digital, cloud, data, APIProficient in developing applications using C#, .NET Core, Kafka, JavaScript frameworks (React), APIs and Databases such as SQL Server, Oracle, Mongo DB and Aurora.Proven technical experience in leading digital channels and customer experienceSolid technical background in building and designing data integration, microservices and workflow automation on cloud platforms using AWSThorough understanding of large-scale distributed systems, solution design and architecture principlesExpertise in setting up DevOps, CI/CD pipelines, logging and monitoring tools (TeamCity, Octopus, GitHub, GitHub Actions, Artifactory, Snyk and Sonarqube)Ability to design solutions to meet the highest possible quality standards while simultaneously balancing security, performance, availability, and maintainability concernsBanking and financial services experience in a complex environment preferred\n\nMust have:\n\nEnd to end Development background - 3 tier architecture we play in the UX in reactCloud - AWS Data integration pattens - Kafka API - Java and .NET / C# \n\nWorking with us:\n\nWhether you’re passionate about customer service, driven by data, or called by creativity, a career with CommBank is for you.\n\nWe support our people with the flexibility to balance where work is done with at least half your time each month connecting in office. We also have many other flexible working options available including changing start and finish times, part-time arrangements and job share to name a few. Talk to us about how these arrangements might work for you.\n\nIf you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We’re keen to support you with the next step in your career.\n\nWe're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696.\n\nAdvertising End Date: 07/01/2025",
        "skills": [
            "JavaScript Frameworks",
            "Apache Kafka",
            "C#",
            "Deployment Strategies",
            "Digital Channels",
            "Enterprise Solution Design",
            "MongoDB",
            "Onboarding",
            "Quality Control",
            "Workflow Automation"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4056507716",
        "posted_time": "2024-12-03 10:18:40"
    },
    {
        "title": "Data Engineer",
        "company": "Capgemini",
        "location": "Sydney, New South Wales, Australia",
        "description": "Come and join a thriving company and become part of a diverse global collective of free-thinkers, entrepreneurs and industry experts who are all driven to use technology to reimagine what’s possible. Capgemini. Get the future you want.\n \nThis role could be in Sydney, Melbourne, Canberra, Brisbane, or Adelaide. \n \nFor more about why Capgemini https://www.capgemini.com/au-en/careers/why-join-capgemini/\n \n Let’s talk about the role and responsibilities:\n  Collaborate with business analysts and end-users to identify requirements and develop technical specifications for software applications Design, develop, and maintain software applications using one or more programming languages and development frameworks, such as Java, Python, .NET wtc. Perform unit testing and integration testing to ensure software quality and reliability Debug and troubleshoot software issues in a timely and efficient manner Write and maintain technical documentation, including user manuals and system documentation Collaborate with development teams to integrate software applications with other systems and platforms Participate in code reviews and provide constructive feedback to improve code quality Stay up-to-date with emerging technologies and programming languages to improve software development processes and outcomes Provide technical support to end-users to resolve software issues Collaborate with other IT teams, including infrastructure, security, and database administrators, to ensure smooth software application delivery and maintenance \n \n Let's talk about the team:\n \n Capgemini Financial Services is a Global Strategic Business Unit that provides information technology and consultancy services to the Banking, Capital Markets and Insurance industries. Capgemini FS brings you leading insights & deep industry experience to drive the future of Financial Services. Our customers count on us for the very latest in innovative service offerings & next generation global delivery.\n \n \n Let’s talk about your capability and experience:\n  Bachelor's degree in Computer Science, Information Technology, or related field 3+ years of experience in software development, preferably as an analyst programmer in Financial Services (Banking preferred) industry Proficiency in one or more programming languages and development frameworks, such as Java, Python, .NET etc. Experience in developing and maintaining software applications using Agile methodologies Knowledge of software development best practices, including unit testing, code reviews, and version control Strong analytical and problem-solving skills Excellent verbal and written communication skills Demonstrated ability to work collaboratively with cross-functional teams Ability to prioritize and manage multiple projects simultaneously Strong attention to detail and accuracy \n \n About Capgemini\n \nAt Capgemini, we are more than just a business, we are a diverse global collective of strategic and technological experts who are passionate about finding ways technology can help our clients, our people and our communities get the future they want.\n \nOur people are the key to making this vision a reality, which is why we have been recognised by the Australian Workplace Equality Index as LGTBQ+ ‘Employer of the Year’ and ‘Inclusion of Trans and Gender Diverse Employees’ for the past two years. We believe in creating a safe, flexible, and inclusive culture where everyone can bring their authentic selves to work, contributing to our inclusive culture and truly belong, and our staff-led community groups are a testament to this commitment. We are committed to being active allies for everyone. \nWe believe by combining the power of the latest technology with our human energy, we can drive sustainable thinking into our operations and the work we do with clients. Its why we are committing to being carbon neutral for our own operations no later than 2025 and across our supply chain by 2030 and committed to becoming a net zero business by 2040. \n \nEmpower yourself with the knowledge and skills you need to succeed with our access to premier learning platforms, sought-after certifications and boundless development opportunities. You’ll be encouraged to gain at least 40 hours of training each year. \n \nFor over 50 years our values and ethics have been at heart of our identity. From our approach to ethics to the way we interact with one another, honesty, boldness, trust, freedom, team spirit, modesty, and fun guide and inspire all we do and have led to us being recognised as one of the World’s Most Ethical Companies by the Ethisphere Institute 12 years in a row. \n \nOur Commitment to Diversity & Inclusion\nDon’t meet every single requirement for this role? Studies have shown women and people from diverse minority backgrounds are less likely to apply to jobs unless they meet every single requirement. At Capgemini, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role but your experience doesn’t align perfectly, we encourage you to apply and tell us what you can bring to the role.\nWe understand for some people, a standard hiring processes can come with challenges. If you are living with a disability, are gender diverse or neurodivergent and we can provide support with access requirements or by making an adjustment to our hiring process, please contact us at talentacquisitionaunz@capgemini.com\n\nInformation Security and Compliance\nCapgemini Australia has developed and manages, process orientated Management Systems compliant to the requirements of ISO9001, ISO27001 and ISO14001. We are committed to delivering secure solutions and services through state-of-the-art processes and continual improvement frameworks in line with industry best practices as well as contractual, statutory, and regulatory requirements.\n\n",
        "skills": [
            "Communication",
            "Computer Science",
            "Data Engineering",
            "Data Science",
            "Extract, Transform, Load (ETL)",
            "IT Documentation",
            "Problem Solving",
            "Technical Documentation",
            "Technical Specs",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4071484736",
        "posted_time": "2024-12-03 10:16:29"
    },
    {
        "title": "Data Engineer",
        "company": "Xero",
        "location": "Melbourne, Victoria, Australia",
        "description": "\n\n\nXero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive. \n\n At Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place. \n\nHow you’ll make an impact\n\nAs a data engineer in the Marketing Data Science, Analytics & Insights team, you will be responsible for engineering large and complex data sets, as well as build robust, reusable and optimized data pipelines. You will have broad technical skills of developing and implementing data pipelines as well as data infrastructure to support the implementation of data transformation for analytics, business intelligence, machine learning models and other data projects. \n\nWhat you’ll doCreate integration between Xero’s Kafka infrastructure, Customer Data platform and other OLAP systemsDeploy data pipelines following DevOps principles and incorporating automated code & data testing.Demonstrates a focus on continual self improvement, across both the technical and business aspects of delivering high quality data enrichment solutionsProvide support to data quality and data validation through analysis of data and assisting in understanding the meaning of dataHelp drive continuous improvements to data quality procedures and a consistent approach to how data quality is measured, monitored and reported.Work on incident management, service requests, enhancements/changes and audits \n\nWhat you’ll bring with youStrong data and technical background demonstrating innovation, initiative and a passion for dataConfidence in collecting, collating and interpreting business requirements in order to produce quality outcomesGood time management with the ability to multitask, prioritize and deliver to scheduleHighly motivated and proactive nature, constantly looking at methods for improvementSolution focused and has strong attention to detailExperience working with Business Owners and different stakeholders to gather data requirements and provide solutionsCI/CD tools like Teamcity, GitHub Actions Jenkins, Harness or Circle.cInfrastructure as code utilities like Terraform, Cloudformation.Docker and Kubernetes.Good knowledge of SQL, Snowflake, dbt, Python, AWS, AWS Serverless (Lambda Functions), SQS, -SNS, S3, Glue,Clear and concise oral & written communication including technical documentationExperienced in orchestration tools (such as Apache Airflow, Prefect)Proficient in roll out and maintenance of cloud infrastructureKnowledge of data requirements for ML / AI use cases beneficialCDP implementation experience is plus \n\n Why Xero?  \n Offering very generous paid leave to use however you’d like (plus statutory holidays!), dedicated paid leave to care for your physical and mental wellbeing as well as an Employee Assistance Program to access mental health care for you and your family, health insurance, life insurance, and income protection, wellbeing and sports programmes, employee resource groups, 26 weeks of paid parental leave for primary caregivers, an Employee Share Plan, beautiful offices, flexible working, career development, and many other benefits that reflect our human value, you’ll do the best work of your life at Xero.",
        "skills": [
            "Apache Kafka",
            "Attention to Detail",
            "Collating",
            "Communication",
            "Data Engineering",
            "Data Pipelines",
            "Data Science",
            "Self Help",
            "Skilled Multi-tasker",
            "Written Communication"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090210003",
        "posted_time": "2024-12-03 08:39:34"
    },
    {
        "title": "Data Analyst",
        "company": "Data#3",
        "location": "Brisbane, Queensland, Australia",
        "description": "We're currently seeking an experienced Power BI Data Analyst / Report Developer for a 6-month contract with our client. This is an exciting opportunity to be at the forefront of data-driven decision-making and support the business with automated reporting solutions.\nKey Responsibilities:Develop and deliver meaningful, automated reports using Power BIDesign and implement Power BI solutions, including DAX SQL and Power QueryCollaborate with business and technical teams to transform data into powerful visualizationsBuild prototypes to help the business understand the existing data landscape\nKey Skills & Experience:Hands-on experience with Power BI and expertise in DAX SQL, Power QueryStrong understanding of UI visual design principles and report development best practicesAbility to rapidly understand business processes and operational complexitiesExceptional communication and interpersonal skillsFamiliarity with Databricks, Oracle P6, and Power BI Service is desirableExperience with older tools such as Tableau or SAP Business Objects is a bonus\nHow to ApplyPlease include your resume and contact details.Contact Usama at Data#3 on 0414 330 211 or usama_siddiqui@data3.com.au for any questions.If you do not meet the role criteria but are still interested in hearing about opportunities through Data#3, please also get in touch for more info on our other available positions!Data#3 will request as part of the recruitment process reference checks and verification of your right to work in Australia. All final applicants for this position will be asked to consent to a police check.Please note that applicants with criminal records will not automatically be excluded from the recruitment process. Each application will be considered on its merits and inherent requirements of the role.",
        "skills": [
            "Business Process",
            "Computer Engineering",
            "Design",
            "Interpersonal Skills",
            "Microsoft Power BI",
            "Microsoft Power Query",
            "Report Development",
            "Statutory Accounting Principles (SAP)",
            "Visual Design"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4088208017",
        "posted_time": "2024-12-03 07:30:36"
    },
    {
        "title": "Robotics engineer - Intern",
        "company": "Emesent",
        "location": "Brisbane, Queensland, Australia",
        "description": "Our Mission to be Bold and Impactful\n\nWe are looking for an enthusiastic and motivated Intern to join our robotics group, where you'll\n\njoin our Autonomy team to develop automated tooling for the analysis of test data captured\n\nduring development testing, QA testing, and field trips. This is a hands-on role, offering the\n\nchance to work on advanced robotics technologies in our Brisbane CBD Head Office. The\n\nexperience you gain will lead to a broader development role within our team in the event of the\n\nposition being extended.\n\nThe paid internship program will run for 6 months from October 2024. There is a high likelihood\n\nof extension, based on performance and project requirements. This is an excellent opportunity\n\nfor a recent graduate who has studied any of the following degrees is an excellent\n\nopportunity for a recent graduate who has studied any of the following degrees:\n\nInformation TechnologyComputer ScienceSoftware Engineering (or similar)Mechatronics Engineering (or similar)\n\n\nHere's what we need\n\nCollaborate with our Autonomy team to develop tools that automate the analysis of large data sets, optimizing workflows during testing and deploymentEnsure data pipelines and automation tools are efficient, scalable, and robust with guidance from senior colleaguesDeliver high-quality tools on time, keeping internal stakeholders informed throughout the project timelineEngage with team members to plan and design tools that meet business and technical needsContribute to the team's knowledge of data analysis workflows\n\n\nHow you'll succeed \n\nFamiliarity with Python for data analysis and automationExperience with C++ development, especially in a robotics or data processing contextKnowledge of ROS (Robot Operating System) for robotics integration and data collection workflowsAbility to write clean, concise, and well-documented codeStrong problem-solving skills and the ability to work with large datasets\n\n\nThe added perks\n\nGet a competitive remuneration package + superannuationWork alongside a friendly and passionate team on cutting edge technology! - We know that our success and growth is a result of our motivated and inspiring teamsTake up our genuine learning and development opportunitiesSettle into our great work environment and facilitiesWork in comfort with a casual dress code1 full day of leave, each year for work anniversaries!\n\n\nWho are we?\n\nEmesent is a world-leader in drone autonomy, LiDAR mapping, and data analytics. Our vision is to autonomously map the inaccessible. Founded in 2018, with deep connections to Australia's globally recognised CSIRO, we have established ourselves worldwide with a reputation for delivering high-quality data capture in the mining, infrastructure, survey, and mapping industries. Our team of 100+ roboticists, engineers, and business development experts work side-by-side to deliver revolutionary efficiency, safety, and operational insights to our customers.\n\nOur flagship product, Hovermap, is a smart mobile scanning unit that combines advanced collision avoidance and autonomous flight technologies to map hazardous and GPS-denied environments. Its award-winning technology utilises innovative hardware, advanced algorithms, and machine learning to automate collection and analysis of the physical world. Equally capable above ground or underground, indoors, or out, Hovermap is a complete mobile LiDAR mapping solution. Hovermap is uniquely versatile, it can be backpack, drone, or vehicle-mounted to map challenging, inaccessible areas enabling our customers to gain insights that were not possible before.\n\nWith multiple applications across several industries and a rapidly growing customer base, Hovermap and our other solutions are being used commercially for a variety of applications by enterprise customers around the world.\n\nWhy Emesent?\n\nAt Emesent, you will have the opportunity to work on ground-breaking technology that is shaping the future. We offer a dynamic and collaborative work environment, competitive compensation, and opportunities for professional growth. Join us in our mission to push the boundaries of robotics and digitisation to help humanity explore further and understand more.\n\nApply for this job",
        "skills": [
            "Analytical Skills",
            "Artificial Intelligence (AI)",
            "Automation",
            "Computer Science",
            "Data Processing",
            "Problem Solving",
            "Process Automation",
            "Robot Operating System (ROS)",
            "Robotic Process Automation (RPA)",
            "Robotics"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4089580580",
        "posted_time": "2024-12-02 20:16:26"
    },
    {
        "title": "Senior Solution Architect, Startups",
        "company": "Amazon Web Services (AWS)",
        "location": "Melbourne, Victoria, Australia",
        "description": "Description\n\nDo you want to be part of the team helping startups to become future unicorns? Are you passionate about startups and how technology can help them accelerate their growth? Do you like helping fast-moving companies solve technical problems?\n\nWe have an exciting opportunity for a Solution Architect to partner with startups and scale-ups across a wide range of industries, and different stages in their lifecycle. You will be equally at ease working with key customers on their specific deep architectural discussions, and also participating in startup community and scale activities.\n\nAs a Solution Architect, you will own the technical engagement and ultimate success around specific implementation projects, and developing a deep expertise in AWS technologies, as well as broad know-how around how applications and services are constructed using the AWS platform.\n\nYour experience will include working in, or leading software engineering teams at fast-moving and growing companies within the tech and startup industry. Your customer facing skills will allow you to represent Amazon well within a customer’s environment or the broader startup community; as well as a technical background that enables you to easily interact with and give guidance to software developers and architects.\n\n#aws-ags-anz\n\nKey job responsibilities\n\n Partnering with a diverse range of startups to adopt the right architecture at each stage in their lifecycle and driving the architecture of scalable, reliable and secure solutions Scoping each customer engagement, with attention towards clear and well-defined goals and success criteria Driving adoption of a broad range of AWS services to deliver business value and accelerate growth Partnering with engineering teams to support the evolution and roadmap of the AWS platform and services through customer feedback Building and nurturing technical relationships within the startup ecosystem, including accelerators, incubators and VCs Developing startup specific technical content, such as blog posts, sample code and solutions, to assist customers solve technical problems and reduce time-to-market\n\nWhat if I don’t meet all the requirements?\n\nThat’s okay! We hire people who have a passion for learning and are curious. You will be supported in your career development here at AWS. You will have plenty of opportunities to build your technical expertise, business and consulting skills. Your onboarding will set you up for success, including a combination of formal and informal training. You’ll also have a chance to gain AWS certifications and access mentorship programs. You will learn from and collaborate with some of the brightest technical minds in the industry today.\n\nA day in the life\n\nLearn more about being a Solutions Architect at Amazon Web Services: https://www.youtube.com/watch?v=Js21xKMFdww\n\nAbout The Team\n\nDiverse Experiences\n\nAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nWork/Life Balance\n\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nInclusive Team Culture\n\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship and Career Growth\n\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nBasic Qualifications\n\n 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data & analytics) experience 3+ years of design, implementation, or consulting in applications and infrastructures experience 10+ years of IT development or implementation/consulting in the software or Internet industries experience\n\nPreferred Qualifications\n\n 5+ years of infrastructure architecture, database architecture and networking experience Knowledge of SAP systems (like SAP Business Suite, S/4HANA, SAP Business Warehouse, SAP HANA, SAP Business Objects, etc.) and their architecture and infrastructure needs Experience working with end user or developer communities\n\nAcknowledgement Of Country\n\nIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\n\nIDE Statement\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Web Services Australia Pty Ltd\n\nJob ID: A2844212",
        "skills": [
            "Architecture",
            "Customer Engagement",
            "Data Architecture",
            "Databases",
            "Marketing",
            "Networking",
            "Presales",
            "Service-Oriented Architecture (SOA)",
            "Solution Architecture",
            "Technical Architecture"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090204941",
        "posted_time": "2024-12-03 09:22:30"
    },
    {
        "title": "Senior Data Analyst",
        "company": "NDIS Quality and Safeguards Commission",
        "location": "Sydney, New South Wales, Australia",
        "description": "About The NDIS Quality And Safeguards Commission\n\nThe NDIS Quality and Safeguards Commission (the NDIS Commission) is an independent agency established on 1 July 2018 to improve the quality and safety of NDIS supports and services. The NDIS Commission is the dedicated national regulator of NDIS service providers in Australia and a non-corporate entity under the Public Governance, Performance and Accountability Act 2013.\n\nReporting and Insights Team \n\nThe Reporting and Insights Team is responsible for the delivery of high-quality data products that underpin data-driven decision-making and enable the NDIS Commission to ensure people with disability receive quality and safe supports and services under the NDIS. The team is accountable for providing business intelligence to operational units, reporting on key metrics and trends, and developing models to enhance Commission data.\n\nHow to apply:\n\nBy continuing, you agree that you have read our Privacy Statement. Show Privacy Statement Opens in new window",
        "skills": [
            "Analytical Skills",
            "Analytics",
            "Data Analytics",
            "Data Modeling",
            "Data Science",
            "Data Visualization",
            "Databases",
            "Microsoft Power BI",
            "R (Programming Language)",
            "Statistics"
        ],
        "job_url": "https://www.linkedin.com/jobs/view/4090271920",
        "posted_time": "2024-12-03 14:18:22"
    }
]